Infineon/mtb-pdl-cat2/devices/svd/psoc4hvpaspm10.svd
        <register>
          <name>CLK_DFT_SELECT</name>
          <description>Clock DFT Mode Selection Register</description>
          <addressOffset>0x34</addressOffset>
          <resetMask>0x00007F7F</resetMask>
          <fields>
            <field>
              <name>DFT_SEL0</name>
              <description>Select clock for Calibration Counter #1</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NC</name>
                  <description>Disabled - output is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ILO</name>
                  <description>clk_ilo: ILO output</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IMO</name>
                  <description>clk_imo: IMO primary output</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECO</name>
                  <description>clk_eco: ECO output</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLK</name>
                  <description>clk_ext: external clock input</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFCLK</name>
                  <description>clk_hf: root of the high-speed clock tree</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFCLK</name>
                  <description>clk_lf:  root of the low-speed clock tree</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCLK</name>
                  <description>clk_sys:  root of the CPU/AHB clock tree (gated version of clk_hf)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUMPCLK</name>
                  <description>clk_pump: clock provided to charge pumps in FLASH and PA</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLPCTRLCLK</name>
                  <description>clk_slpctrl:  clock provided to Sleep Controller</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPOSC</name>
                  <description>clk_hposc:  HPOSC output.  Applicable only if HPOSC_PRESENT=1</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PILO</name>
                  <description>clk_pilo:  PILO output.  Applicable only if PILO_PRESENT=1</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ILO_EN</name>
                  <description>clk_ilo: enable. Use for startup time measurements.  Use only with DFT_DIV0.NO_DIV</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IMO_EN</name>
                  <description>clk_imo: enable. Use for startup time measurements. Use only with DFT_DIV0.NO_DIV</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPOSC_EN</name>
                  <description>clk_hposc: enable. If HPOSC_PRESENT=1, Use for startup time measurements. Use only with DFT_DIV0.NO_DIV</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PILO_EN</name>
                  <description>clk_pilo: enable. If PILO_PRESENT=1, Use for startup time measurements. Use only with DFT_DIV0.NO_DIV</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFT_DIV0</name>
              <description>Calibration Counter #1 pre-divider</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DIV</name>
                  <description>Direct Output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_2</name>
                  <description>Divide by 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_4</name>
                  <description>Divide by 4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_8</name>
                  <description>Divide by 8</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFT_EDGE0</name>
              <description>Edge sensitivity for pre-divider (only relevant when DIV0&gt;0).</description>
              <bitRange>[6:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POSEDGE</name>
                  <description>Use posedge for divider</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEGEDGE</name>
                  <description>Use negedge for divider</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFT_SEL1</name>
              <description>Select clock for Calibration Counter #2</description>
              <bitRange>[11:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NC</name>
                  <description>Disabled - output is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ILO</name>
                  <description>clk_ilo: ILO output</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IMO</name>
                  <description>clk_imo: IMO primary output</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECO</name>
                  <description>clk_eco: ECO output</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLK</name>
                  <description>clk_ext: external clock input</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFCLK</name>
                  <description>clk_hf: root of the high-speed clock tree</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFCLK</name>
                  <description>clk_lf:  root of the low-speed clock tree</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCLK</name>
                  <description>clk_sys:  root of the CPU/AHB clock tree (gated version of clk_hf)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUMPCLK</name>
                  <description>clk_pump: clock provided to charge pumps in FLASH and PA</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLPCTRLCLK</name>
                  <description>clk_slpctrl:  clock provided to Sleep Controller</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPOSC</name>
                  <description>clk_hposc:  HPOSC output.  Applicable only if HPOSC_PRESENT=1</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PILO</name>
                  <description>clk_pilo:  PILO output.  Applicable only if PILO_PRESENT=1</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ILO_EN</name>
                  <description>clk_ilo: enable. Use for startup time measurements.  Use only with DFT_DIV0.NO_DIV</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IMO_EN</name>
                  <description>clk_imo: enable. Use for startup time measurements. Use only with DFT_DIV0.NO_DIV</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPOSC_EN</name>
                  <description>clk_hposc: enable. If HPOSC_PRESENT=1, Use for startup time measurements. Use only with DFT_DIV0.NO_DIV</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PILO_EN</name>
                  <description>clk_pilo: enable. If PILO_PRESENT=1, Use for startup time measurements. Use only with DFT_DIV0.NO_DIV</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFT_DIV1</name>
              <description>Calibration Counter #2 pre-divider</description>
              <bitRange>[13:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DIV</name>
                  <description>Direct Output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_2</name>
                  <description>Divide by 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_4</name>
                  <description>Divide by 4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_8</name>
                  <description>Divide by 8</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFT_EDGE1</name>
              <description>Edge sensitivity for pre-divider (only relevant when DIV0&gt;0).</description>
              <bitRange>[14:14]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POSEDGE</name>
                  <description>Use posedge for divider</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEGEDGE</name>
                  <description>Use negedge for divider</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SRSS_MASKED</name>
          <description>SRSS Interrupt Masked Register</description>
          <addressOffset>0x40</addressOffset>
          <access>read-only</access>
          <resetMask>0x0000001E</resetMask>
          <fields>
            <field>
              <name>TEMP_HIGH</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LIFETIME_WAKEUP</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_CAL</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CRWDT</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRSS_INTR</name>
          <description>SRSS Interrupt Register</description>
          <addressOffset>0x44</addressOffset>
          <resetMask>0x0000001E</resetMask>
          <fields>
            <field>
              <name>TEMP_HIGH</name>
              <description>Regulator over-temp interrupt.  This interrupt can occur when a short circuit exists on the vccd pin or when extreme loads are applied on IO-cells causing the die to overheat.  Firmware is encourage to shutdown all IO cells and then go to DeepSleep mode when this interrupt occurs if protection against such conditions is desired.</description>
              <bitRange>[1:1]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>LIFETIME_WAKEUP</name>
              <description>Wakeup Interrupt from LIFETIME Counter. This bit is set when LIFETIME_COUNTER ==LIFETIME_WAKEUP. This is a DeepSleep Interrupt.  The interrupt source will reset only with hard reset (power related, XRES, WDT).</description>
              <bitRange>[2:2]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>CLK_CAL</name>
              <description>Clock calibration counter is done.  This field is reset during DeepSleep mode.</description>
              <bitRange>[3:3]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>CRWDT</name>
              <description>Interrupt from CRWDT. This bit is set by the CRWDT when enabled by CRWDT_CONFIG.</description>
              <bitRange>[4:4]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SRSS_INTR_SET</name>
          <description>SRSS Interrupt Set Register</description>
          <addressOffset>0x48</addressOffset>
          <resetMask>0x0000001E</resetMask>
          <fields>
            <field>
              <name>TEMP_HIGH</name>
              <description>Writing 1 to this bit internally sets the overtemp interrupt.  This can be observed by reading SRSS_INTR.TEMP_HIGH.  This bit always reads back as zero.</description>
              <bitRange>[1:1]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>LIFETIME_WAKEUP</name>
              <description>Writing 1 to this bit internally sets the LIFETIME_WAKEUP interrupt.  Reads back same as SRSS_INTR.LIFETIME_WAKEUP.  The interrupt source will reset only with hard reset (power related, XRES, WDT).</description>
              <bitRange>[2:2]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>CLK_CAL</name>
              <description>Set interrupt for clock calibration counter done.  This field is reset during DeepSleep mode.  Reads back same as SRSS_INTR.CLK_CAL.</description>
              <bitRange>[3:3]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>CRWDT</name>
              <description>Set interrupt for Challenge/Response Interrupt.  Reads back same as SRSS_INTR.CRWDT.</description>
              <bitRange>[4:4]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SRSS_INTR_MASK</name>
          <description>SRSS Interrupt Mask Register</description>
          <addressOffset>0x4C</addressOffset>
          <resetMask>0x0000001E</resetMask>
          <fields>
            <field>
              <name>TEMP_HIGH</name>
              <description>Masks REG_OVERTEMP interrupt</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LIFETIME_WAKEUP</name>
              <description>Mask for lifetime counter</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CLK_CAL</name>
              <description>Mask for clock calibration done</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CRWDT</name>
              <description>Mask for CRWDT interrupt</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
