Infineon/mtb-pdl-cat2/devices/svd/psoc4hvpaspm10.svd
        <register>
          <name>PWR_SSV_CTL</name>
          <description>Supply Supervisory Control Register  (Lock Protected)</description>
          <addressOffset>0xE0</addressOffset>
          <resetValue>0x00000808</resetValue>
          <resetMask>0x88080808</resetMask>
          <fields>
            <field>
              <name>BODVDDD_ENABLE</name>
              <description>Enable for BOD on vddd.  This cannot be disabled during normal operation.</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>BODVCCD_ENABLE</name>
              <description>Enable for BOD on vccd.  This cannot be disabled during normal operation.</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OVDVDDD_ENABLE</name>
              <description>Enable for OVD on vddd.  FW should enable this after the OVD trims are set during boot-up and keep it enabled.</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>OVDVCCD_ENABLE</name>
              <description>Enable for OVD on vccd.  FW should enable this after the OVD trims are set during boot-up and keep it enabled.</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>BODHVSS_ENABLE</name>
              <description>Enable for BOD on vddd from HVSS.  This gives BOD robustness during DeepSleep.  FW should enable during boot-up and keep it enabled.</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_SSV_STATUS</name>
          <description>Supply Supervision Status Register</description>
          <addressOffset>0xE4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00001005</resetValue>
          <resetMask>0x00001505</resetMask>
          <fields>
            <field>
              <name>BODVDDD_OK</name>
              <description>BOD indicates vddd is ok.  This will always read 1, because a detected brownout will reset the chip.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BODVCCD_OK</name>
              <description>BOD indicates vccd is ok.  This will always read 1, because a detected brownout will reset the chip.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OVDVDDD_OK</name>
              <description>OVD indicates vddd is ok.    After OVDVDDD is enabled it will always read 1, because a detected over-voltage condition will reset the chip.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OVDVCCD_OK</name>
              <description>OVD indicates vccd is ok.    After OVDVCCD is enabled it will always read 1, because a detected over-over-voltage condition will reset the chip.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BODHVSS_OK</name>
              <description>BODHVSS indicates vddd is ok.   This will always read 1, because a detected brownout will reset the chip.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <cluster>
          <name>WDT</name>
          <description>Watchdog Timer</description>
          <headerStructName>WDT</headerStructName>
          <addressOffset>0x100</addressOffset>
          <register>
            <name>CTL</name>
            <description>WDT Control Register</description>
            <addressOffset>0x0</addressOffset>
            <resetValue>0x80000001</resetValue>
            <resetMask>0x80000001</resetMask>
            <fields>
              <field>
                <name>ENABLED</name>
                <description>Indicates actual state of watchdog.  May lag ENABLE by up to three clk_lf cycles.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>ENABLE</name>
                <description>Enable watchdog.  May take up to three clk_lf cycles to take effect.  When ENABLE changes from 1-&gt;0, the counter is cleared.  Do not enter DeepSleep if ENABLE&lt;&gt;ENABLED.  This can be done by waiting until ENABLE==ENABLED whenever ENABLE is changed.
0: Counter is disabled (not clocked).
1: Counter is enabled (counting up)</description>
                <bitRange>[31:31]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>LOWER_LIMIT</name>
            <description>WDT Lower Limit Register</description>
            <addressOffset>0x4</addressOffset>
            <fields>
              <field>
                <name>LOWER_LIMIT</name>
                <description>Lower limit for watchdog.  See LOWER_ACTION.</description>
                <bitRange>[31:0]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>UPPER_LIMIT</name>
            <description>WDT Upper Limit Register</description>
            <addressOffset>0x8</addressOffset>
            <resetValue>0x00008000</resetValue>
            <fields>
              <field>
                <name>UPPER_LIMIT</name>
                <description>Upper limit for watchdog.  See UPPER_ACTION.</description>
                <bitRange>[31:0]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>WARN_LIMIT</name>
            <description>WDT Warn Limit Register</description>
            <addressOffset>0xC</addressOffset>
            <fields>
              <field>
                <name>WARN_LIMIT</name>
                <description>Warn limit for watchdog.  See WARN_ACTION.</description>
                <bitRange>[31:0]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG</name>
            <description>WDT Configuration Register</description>
            <addressOffset>0x10</addressOffset>
            <resetValue>0x00000010</resetValue>
            <resetMask>0xB0001111</resetMask>
            <fields>
              <field>
                <name>LOWER_ACTION</name>
                <description>Action taken if this watchdog is serviced before LOWER_LIMIT is reached.  LOWER_ACTION is ignored (i.e. treated as NOTHING) when a debugger is connected and/or when the chip is in DeepSleep modes.
For LOWER_LIMIT &gt;= 1: The action is triggered on same edge when it meets this condition.
For LOWER_LIMIT == 0: No action is triggered.</description>
                <bitRange>[0:0]</bitRange>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOTHING</name>
                    <description>Do nothing</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RESET</name>
                    <description>Trigger a reset.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>UPPER_ACTION</name>
                <description>Action taken if this watchdog is not serviced before UPPER_LIMIT is reached.  The counter stops counting when UPPER_LIMIT is reached, regardless of UPPER_ACTION setting.   UPPER_ACTION is ignored (i.e. treated as NOTHING) when a debugger is connected.
For UPPER_LIMIT &gt;= 2: The action is triggered on same edge when it meets this condition.
For UPPER_LIMIT &lt; 2: The action may take up to one extra clk_lf cycle to trigger.</description>
                <bitRange>[4:4]</bitRange>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOTHING</name>
                    <description>Do nothing</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RESET</name>
                    <description>Trigger a reset.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WARN_ACTION</name>
                <description>Action taken when the count value reaches WARN_LIMIT.  The minimum setting to achieve a periodic interrupt is WARN_LIMIT==1.  A setting of zero will trigger once but not periodically.
For WARN_LIMIT &gt;= 2: The action is triggered on same edge when it meets this condition.
For WARN_LIMIT &lt; 2  : The action may take up to one extra clk_lf cycle to trigger.</description>
                <bitRange>[8:8]</bitRange>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOTHING</name>
                    <description>Do nothing</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INT</name>
                    <description>Trigger an interrupt.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTO_SERVICE</name>
                <description>Automatically service when the count value reaches WARN_LIMIT.  This allows creation of a periodic interrupt if this counter is not needed as a watchdog.  This field is ignored when LOWER_ACTION&lt;&gt;NOTHING or when UPPER_ACTION&lt;&gt;NOTHING.</description>
                <bitRange>[12:12]</bitRange>
              </field>
              <field>
                <name>DEBUG_TRIGGER_EN</name>
                <description>Enables the trigger input for WDT to pause the counter during debug mode.  To pause at a breakpoint while debugging, configure the trigger matrix to connect the related CPU halted signal to the trigger input for this WDT, and then set this bit.  It takes up to two clk_lf cycles for the trigger signal to be processed.  Triggers that are less than two clk_lf cycles may be missed.  Synchronization error can accumulate each time it is halted.
0: Pauses the counter whenever a debug probe is connected.
1: Pauses the counter whenever a debug probe is connected and the trigger input is high.</description>
                <bitRange>[28:28]</bitRange>
              </field>
              <field>
                <name>DPSLP_PAUSE</name>
                <description>Pauses/runs this counter when the system is in DeepSleep.  Note it may take up to two clk_lf cycles for the counter to pause, due to internal synchronization.  During DeepSleep wakeup, the pause request is removed when clk_hf starts clocking, and then it may take up to two clk_lf cycles for the counter to start.  After wakeup, the LOWER_ACTION is ignored until after the first service.  This prevents an unintentional trigger of the LOWER_ACTION before the firmware realigns the servicing period.  After the first service, LOWER_ACTION behaves as configured.
0: Counter behaves normally during DeepSleep.
1: Counter pauses during DeepSleep.</description>
                <bitRange>[29:29]</bitRange>
              </field>
              <field>
                <name>DEBUG_RUN</name>
                <description>Pauses/runs this counter while a debugger is connected.  Other behaviors are unchanged during debugging, including service, configuration updates and enable/disable.  Note it may take up to two clk_lf cycles for the counter to pause and another two cycles to unpause, due to internal synchronization.  If the debugger is connected for at least two clk_lf cycles, the LOWER_ACTION is ignored until after the first service after the debugger is disconnected.  This prevents an unintentional trigger of the LOWER_ACTION before the firmware realigns the servicing period.  After the first service, LOWER_ACTION behaves as configured.  If the debugger is disconnected before two clk_lf cycles, the LOWER_ACTION may or may not be ignored.
0: When debugger connected, counter pauses incrementing as configured in DEBUG_TRIGGER_EN.
1: When debugger connected, counter increments normally, but reset generation is blocked.</description>
                <bitRange>[31:31]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>CNT</name>
            <description>WDT Count Register</description>
            <addressOffset>0x14</addressOffset>
            <fields>
              <field>
                <name>CNT</name>
                <description>Current value of subcounter for this WDT.  This field may lag the actual count value by up to one clk_lf cycle, due to internal synchronization.  When this subcounter is disabled and unlocked, the count value can be written for verification and debugging purposes.  Software writes are always ignored when the subcounter is enabled.</description>
                <bitRange>[31:0]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>LOCK</name>
            <description>WDT Lock register</description>
            <addressOffset>0x40</addressOffset>
            <resetValue>0x00000003</resetValue>
            <resetMask>0x00000003</resetMask>
            <fields>
              <field>
                <name>WDT_LOCK</name>
                <description>Prohibits writing control and configuration registers related to this WDT when not equal 0 (as specified in the other register descriptions).  Requires at least two different writes to unlock.
Note that this field is 2 bits to force multiple writes only.  This register also locks the clk_lf settings.</description>
                <bitRange>[1:0]</bitRange>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_CHG</name>
                    <description>No effect</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLR0</name>
                    <description>Clears bit 0</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLR1</name>
                    <description>Clears bit 1</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET01</name>
                    <description>Sets both bits 0 and 1</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SERVICE</name>
            <description>WDT Service register</description>
            <addressOffset>0x44</addressOffset>
            <resetMask>0x00000001</resetMask>
            <fields>
              <field>
                <name>SERVICE</name>
                <description>Services the watchdog.  This resets the count value to zero.  This may take up to three clk_lf cycle to take effect.  Hardware clears this bit, after necessary synchronization.  To ensure a pending SERVICE write is reflected, firmware should wait until this bit reads low before attempting to write SERVICE=1.  If WDT is disabled, SERVICE will not trigger a LOWER_ACTION and will not clear a preloaded count value.</description>
                <bitRange>[0:0]</bitRange>
                <modifiedWriteValues>oneToSet</modifiedWriteValues>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR</name>
            <description>WDT Interrupt Register</description>
            <addressOffset>0x50</addressOffset>
            <resetMask>0x00000001</resetMask>
            <fields>
              <field>
                <name>WDT</name>
                <description>WDT Interrupt Request.  This bit is set as configured by WDT action and limits.  Due to internal synchronization, it takes up to 8 SYSCLK cycles to update after a W1C or reading this register and during this time AHB bus is stalled.</description>
                <bitRange>[0:0]</bitRange>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR_SET</name>
            <description>WDT Interrupt Set Register</description>
            <addressOffset>0x54</addressOffset>
            <resetMask>0x00000001</resetMask>
            <fields>
              <field>
                <name>WDT</name>
                <description>Set interrupt.
Due to internal synchronization, it takes up to 8 SYSCLK cycles to update after a W1S or reading from this register and during this time AHB bus is stalled.  Reads back same as WDT_B.INTR.WDT</description>
                <bitRange>[0:0]</bitRange>
                <modifiedWriteValues>oneToSet</modifiedWriteValues>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR_MASK</name>
            <description>WDT Interrupt Mask Register</description>
            <addressOffset>0x58</addressOffset>
            <resetMask>0x00000001</resetMask>
            <fields>
              <field>
                <name>WDT</name>
                <description>Mask for watchdog timer.  Clearing this bit will not forward the interrupt to the CPU.</description>
                <bitRange>[0:0]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR_MASKED</name>
            <description>WDT Interrupt Masked Register</description>
            <addressOffset>0x5C</addressOffset>
            <access>read-only</access>
            <resetMask>0x00000001</resetMask>
            <fields>
              <field>
                <name>WDT</name>
                <description>Logical and of corresponding request and mask bits.
Due to internal synchronization, it takes up to 8 SYSCLK cycles to read from this register.  During this time AHB bus is stalled.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>HPOSC_CTL</name>
          <description>High Precision Oscillator Control  (Lock Protected)</description>
          <addressOffset>0x300</addressOffset>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x80000013</resetMask>
          <fields>
            <field>
              <name>LEAKC_DIS</name>
              <description>N/A</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CTAT_SEL</name>
              <description>CTAT generator selection, only valid when CTAT_SW = 1.
0 - Low noise type CTAT generator
1 - Fast start-up type CTAT generator</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CTAT_SWB</name>
              <description>Selection control for internal CTAT generator. 
0 - Auto Select (Fast start followed by low noise generator)
1 - Generator selected by CTAT_SEL</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IMO_EN</name>
              <description>HPOSC enable.  Setting this bit will enable the HPOSC and clearing this bit will disable the HPOSC.  Don't disable this clock if the system is using this clock as the source.</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PILO_CTL</name>
          <description>Precision Low Power Oscillator Control  (Lock Protected)</description>
          <addressOffset>0x400</addressOffset>
          <resetValue>0x0000C001</resetValue>
          <resetMask>0x8000FF13</resetMask>
          <fields>
            <field>
              <name>LEAKC_DIS</name>
              <description>N/A</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CTAT_SEL</name>
              <description>CTAT generator selection, only valid when CTAT_SW = 1.
0 - Low noise type CTAT generator
1 - Fast start-up type CTAT generator</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CTAT_SWB</name>
              <description>Selection control for internal CTAT generator. 
0 - Auto Select (Fast start followed by low noise generator)
1 - Generator selected by CTAT_SEL</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TR_CAP</name>
              <description>PILO user temperature fine trim.  This register field resets with hard reset (power related, XRES, WDT)..</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>ILO_EN</name>
              <description>PILO enable.  Setting this bit will enable the PILO and clearing this bit will disable it.  Do not disable this clock prior to changing  CLK_LF to use the PILO as a source.  CLK_LF must be configured to use PILO as a source while the PILO clock is enabled prior to making such a change.   Writes to this field are ignored when LFCLK_SEL is using this clock as the source and WDT is locked using WDT_LOCK register.  Consequently, if CLK_LF is sourced by the PILO and the PILO is to be disabled, clear WDT_LOCK before-hand. This register field resets with hard reset (power related, XRES, WDT).</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_BG_TRIM1</name>
          <description>Bandgap Trim Register  (Lock Protected)</description>
          <addressOffset>0xFF00</addressOffset>
          <resetValue>0x0000000D</resetValue>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>REF_VTRIM</name>
              <description>Trims the bandgap reference voltage output.  Used to trim the VBG to the voltage where its temperature curvature is minimal.  Bit [5] is unused within the bandgap block.</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_BG_TRIM2</name>
          <description>Bandgap Trim Register  (Lock Protected)</description>
          <addressOffset>0xFF04</addressOffset>
          <resetValue>0x00000023</resetValue>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>REF_ITRIM</name>
              <description>Trims the bandgap reference current output.  Used to trim the IBG to the voltage where its temperature curvature is minimal.</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
