Infineon/mtb-pdl-cat2/devices/svd/psoc4hvpaspm10.svd
        <register>
          <name>CLK_IMO_SELECT</name>
          <description>IMO Frequency Select Register  (Lock Protected)</description>
          <addressOffset>0xFF08</addressOffset>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>FREQ</name>
              <description>Select operating frequency</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>24_MHZ</name>
                  <description>IMO runs at 24 MHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>28_MHZ</name>
                  <description>IMO runs at 28 MHz</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32_MHZ</name>
                  <description>IMO runs at 32 MHz</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>36_MHZ</name>
                  <description>IMO runs at 36 MHz</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>40_MHZ</name>
                  <description>IMO runs at 40 MHz</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>44_MHZ</name>
                  <description>IMO runs at 44 MHz</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>48_MHZ</name>
                  <description>IMO runs at 48 MHz</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_IMO_TRIM1</name>
          <description>IMO Trim Register  (Lock Protected)</description>
          <addressOffset>0xFF0C</addressOffset>
          <resetValue>0x0000006C</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Frequency trim bits.  These bits are determined at manufacturing time for each FREQ setting (IMO_TRIM2) and stored in SFLASH.  This field is hardware updated during USB osclock mode. This field is mapped to the most significant bits of the IMO trim imo_clk_trim[10:3].  The step size of 1 LSB on this field is nominally 160 kHz.</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_IMO_TRIM2</name>
          <description>IMO Trim Register  (Lock Protected)</description>
          <addressOffset>0xFF10</addressOffset>
          <resetValue>0x000000A0</resetValue>
          <resetMask>0x000000F7</resetMask>
          <fields>
            <field>
              <name>FSOFFSET</name>
              <description>Frequency trim bits.  These bits are not trimmed during manufacturing and kept at 0 under normal operation.  This field is hardware updated during USB osclock mode. This field is mapped to the least significant bits of the IMO trim imo_clk_trim[2:0].  The step size of 1 LSB on this field is nominally 20 kHz.</description>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>TCTRIM</name>
              <description>IMO temperature compensation trim.  These bits are determined at manufacturing time to adjust for temperature dependence. This bits are dependent on frequency and need to be changed using the Infineon provided frequency change algorithm.</description>
              <bitRange>[7:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_IMO_TRIM3</name>
          <description>IMO Trim Register  (Lock Protected)</description>
          <addressOffset>0xFF14</addressOffset>
          <resetValue>0x0000000F</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>STEPSIZE</name>
              <description>IMO trim stepsize bits.  These bits are determined at manufacturing time to adjust for process variation.  They are used to tune the stepsize of the FSOFFSET and OFFSET trims.</description>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_PWRSYS_TRIM1</name>
          <description>Power System Trim Register  (Lock Protected)</description>
          <addressOffset>0xFF18</addressOffset>
          <resetValue>0x00000010</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>DPSLP_REF_TRIM</name>
              <description>Trims the DeepSleep reference that is used by the DeepSleep regulator and DeepSleep power comparator.</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>SPARE_TRIM</name>
              <description>Active-Reference temperature compensation trim (repurposed from spare bits).
Bits [7:6] - trim the Active-Reference IREF temperature coefficient (TC).
  00: TC = 0 (unchanged)
  01: TC = +80ppm/C 
  10: TC = -80ppm/C
  11: TC = -150ppm/C

Bits [5:4] - trim the Active-Reference VREF temperature coefficient (TC).
  00: TC = 0 (unchanged)
  01: TC = -50ppm/C 
  10: TC = -80ppm/C
  11: TC = +150ppm/C</description>
              <bitRange>[7:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIM_BODVCCD</name>
          <description>Brown Out Detect Trim (VCCD)  (Lock Protected)</description>
          <addressOffset>0xFF1C</addressOffset>
          <resetValue>0x00000008</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>BOD_TRIPSEL_VCCD</name>
              <description>BOD VCCD trim (production)</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>BOD_RANGE_SELECT_VCCD</name>
              <description>Range select between 1.6V Vs 1.69V nominal.</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIM_OVDVCCD</name>
          <description>Over Voltage Detect Trim (VCCD)  (Lock Protected)</description>
          <addressOffset>0xFF20</addressOffset>
          <resetValue>0x00000007</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>OVD_TRIPSEL_VCCD</name>
              <description>OVD VCCD trim (options)</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIM_HPOSC0_CTL</name>
          <description>High Precision Oscillator Trim Control 0  (Lock Protected)</description>
          <addressOffset>0xFF24</addressOffset>
          <resetValue>0x0000000F</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>CTATEF</name>
              <description>HPOSC frequency CTAT extra-fine trim</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>PTATEF</name>
              <description>Fine trim for HPOSC PTAT current</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>CTATEC</name>
              <description>Coarse trim for HPOSC CTAT current</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>PTATEC</name>
              <description>Coarse trim for HPOSC PTAT current</description>
              <bitRange>[7:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIM_HPOSC1_CTL</name>
          <description>High Precision Oscillator Trim Control 1  (Lock Protected)</description>
          <addressOffset>0xFF28</addressOffset>
          <resetValue>0x0000000D</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>TCF</name>
              <description>HPOSC temp-co fine trim</description>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIM_HPOSC2_CTL</name>
          <description>High Precision Oscillator Trim Control 2  (Lock Protected)</description>
          <addressOffset>0xFF2C</addressOffset>
          <resetValue>0x000000A4</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>PTAT</name>
              <description>HPOSC PTAT trim</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIM_HPOSC3_CTL</name>
          <description>High Precision Oscillator Trim Control 3  (Lock Protected)</description>
          <addressOffset>0xFF30</addressOffset>
          <resetValue>0x000000B1</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>CTAT</name>
              <description>HPOSC CTAT trim</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIM_HPOSC4_CTL</name>
          <description>High Precision Oscillator Trim Control 4  (Lock Protected)</description>
          <addressOffset>0xFF34</addressOffset>
          <resetValue>0x00000003</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>TOC</name>
              <description>HPOSC temp-co coarse trim</description>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>HPOSC_LEAK</name>
              <description>HPOSC leakage cancellation trim</description>
              <bitRange>[7:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIM_PILO0_CTL</name>
          <description>Low Frequency Oscillator Trim Control 0   (Lock Protected)</description>
          <addressOffset>0xFF38</addressOffset>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>CTATEF</name>
              <description>PILO frequency CTAT extra-fine trim</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>PTATEF</name>
              <description>PILO frequency PTATextra-fine trim</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>CTATEC</name>
              <description>PILO temperature CTAT extra-coarse trim</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>PTATEC</name>
              <description>PILO temperature PTATextra-coarse trim</description>
              <bitRange>[7:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIM_PILO1_CTL</name>
          <description>Low Frequency Oscillator Trim Control 1   (Lock Protected)</description>
          <addressOffset>0xFF3C</addressOffset>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>TCF</name>
              <description>PILO temp-co fine trim (MSB, bit 4, is not used)</description>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIM_PILO2_CTL</name>
          <description>Low Frequency Oscillator Trim Control 2  (Lock Protected)</description>
          <addressOffset>0xFF40</addressOffset>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>PTAT</name>
              <description>PILO frequency PTAT coarse trim</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIM_PILO3_CTL</name>
          <description>Low Frequency Oscillator Trim Control 3  (Lock Protected)</description>
          <addressOffset>0xFF44</addressOffset>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>CTAT</name>
              <description>PILO frequency CTAT coarse trim</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIM_PILO4_CTL</name>
          <description>Low Frequency Oscillator Trim Control 4  (Lock Protected)</description>
          <addressOffset>0xFF48</addressOffset>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>TCC</name>
              <description>PILO temperature coarse trim</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIM_PILO5_CTL</name>
          <description>Low Frequency Oscillator Trim Control 5  (Lock Protected)</description>
          <addressOffset>0xFF4C</addressOffset>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>PILO_TR_LEAK</name>
              <description>PILO leakage cancellation trim</description>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIM_BODVDDD</name>
          <description>Brown Out Detect Trim (VDDD)  (Lock Protected)</description>
          <addressOffset>0xFF50</addressOffset>
          <resetValue>0x00000008</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>BOD_TRIPSEL_VDDD</name>
              <description>BOD VDDD trim (options)</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIM_OVDVDDD</name>
          <description>Over Voltage Detect Trim  (VDDD) (Lock Protected)</description>
          <addressOffset>0xFF54</addressOffset>
          <resetValue>0x00000007</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>OVD_TRIPSEL_VDDD</name>
              <description>OVD VDDD trim (options)</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>OVD_RANGE_SELECT_VDDD</name>
              <description>Range select between 3.8V Vs 5.77V nominal.</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
