Infineon/mtb-pdl-cat2/devices/svd/psoc4hvpaspm10.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>HVSS</name>
      <version>2.0</version>
      <description>High Voltage Subsystem</description>
      <baseAddress>0x40060000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>65536</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>HVREG_STATUS</name>
          <description>HVREG Status</description>
          <addressOffset>0x0</addressOffset>
          <access>read-only</access>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>PWR_GOOD</name>
              <description>High if regulator is settled and operating within normal limits</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWR_GOOD_MAST</name>
              <description>Master Power Good</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWR_GOOD_SLAVE</name>
              <description>Slave Power Good</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>THERMAL_SHUTDOWN</name>
              <description>Thermal Shutdown Active</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HVREG_BIST</name>
          <description>HVREG Bist</description>
          <addressOffset>0x4</addressOffset>
          <resetMask>0x0000F11F</resetMask>
          <fields>
            <field>
              <name>HVREG_ADFT</name>
              <description>Controls ADFT switches</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal operation, amuxbus_a=Z</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIAS_CIRCUIT_CURRENT_MONITOR</name>
                  <description>Vbias monitor</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IREF1P4V</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IBIAS</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAST_IDRIVE</name>
                  <description>N/A</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAST_TSD_GATE</name>
                  <description>N/A</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAST_TSD_DIODE</name>
                  <description>N/A</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAST_ZENER_GATE</name>
                  <description>N/A</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAST_ILIM</name>
                  <description>N/A</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAST_ILIM2</name>
                  <description>N/A</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSD_VTH_VOTAGE_DET</name>
                  <description>N/A</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSD_VTH_VOTAGE_REL</name>
                  <description>N/A</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSD_OUT_VCCD</name>
                  <description>N/A</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSD_OUT_VCCD2</name>
                  <description>N/A</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSVD_14</name>
                  <description>N/A</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSVD_15</name>
                  <description>N/A</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HVREG_DDFT</name>
              <description>Enable HVREG DDFT outputs to DDFT interface when '1'
(PG on ddft0, '0' on ddft1)</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EN_BURN_IN</name>
              <description>Enable burn-in test mode with Vccd(1.8V) domain</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SLAVE_ADFT</name>
              <description>Controls ADFT switches</description>
              <bitRange>[15:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal operation, amuxbus_a=Z</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSVD_1</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSVD_2</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSVD_3</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLAVE_IDRIVE</name>
                  <description>Slave driver current monitor (3uA nominal)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLAVE_TSD_GATE</name>
                  <description>Slave TSD NMOS gate voltage</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSVD_6</name>
                  <description>N/A</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLAVE_ZENER_GATE</name>
                  <description>Slave Zener enable gate voltage</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLAVE_ILIM</name>
                  <description>Slave Current limit mirror</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLAVE_ILIM2</name>
                  <description>Slave Current limit2 monitor</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSVD_10</name>
                  <description>N/A</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSVD_11</name>
                  <description>N/A</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSVD_12</name>
                  <description>N/A</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSVD_13</name>
                  <description>N/A</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSVD_14</name>
                  <description>N/A</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSVD_15</name>
                  <description>N/A</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HVREG_CTRL</name>
          <description>HVREG Control</description>
          <addressOffset>0x8</addressOffset>
          <resetValue>0x00000003</resetValue>
          <resetMask>0x00008133</resetMask>
          <fields>
            <field>
              <name>ZENER_CLAMP_MODE</name>
              <description>Controls zener clamp mode</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLAMP_NOT_PRESENT_0</name>
                  <description>Zener disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLAMP_NOT_PRESENT_1</name>
                  <description>Zener disabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZENER_CLAMP_PRESENT</name>
                  <description>Zener enabled</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZENER_CLAMP_DIODE_PRESENT</name>
                  <description>Zener and diode enabled</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSD_MODE</name>
              <description>Controls thermal shutdown mode</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KEEP_REGULATORS_ON_FOR_TSD</name>
                  <description>Keep Vdd on for TSD event (LIN turns off)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TURN_OFF_REGULATORS_ON_TSD</name>
                  <description>Turn off Vdd and LIN on TSD event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSVD_2</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TURN_OFF_TSD</name>
                  <description>Turn off TSD circuit</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN_VDIV</name>
              <description>Enable Vbat Voltage divider</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EN_SLAVE</name>
              <description>Enable slave</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RDIV_CTL</name>
          <description>Resistor Attenuator Control</description>
          <addressOffset>0x10</addressOffset>
          <resetMask>0x00000037</resetMask>
          <fields>
            <field>
              <name>RDIV_EN_0</name>
              <description>Enable VS0
0=Disabled
1=Enabled during power modes selected by RDIV_ACT_EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RDIV_EN_1</name>
              <description>Enable VS1
0=Disabled
1=Enabled during power modes selected by RDIV_ACT_EN</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RDIV_ACT_EN</name>
              <description>Power modes where RDIV is enabled
0=Enable in Active and Deep-Sleep modes
1=Enable in Active mode only</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RDIV_SCALE_0</name>
              <description>VS0 attenuation
0=16X attenuation
1=24X attenuation</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RDIV_SCALE_1</name>
              <description>VS1 attenuation
0=16X attenuation
1=24X attenuation</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LIN_CTL</name>
          <description>LIN PHY Control</description>
          <addressOffset>0x20</addressOffset>
          <resetMask>0x80003117</resetMask>
          <fields>
            <field>
              <name>LIN_MODE</name>
              <description>Controls LIN mode</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>OFF (TX off, Rx off, Bias Circuits Off), LIN pin recessive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLEEP</name>
                  <description>TX off, RX on, LIN pin recessive (typically used in deep-sleep)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STANDBY</name>
                  <description>TX off, RX off, Bias circuits on (faster turn-on, not normally used)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIAGNOSIS</name>
                  <description>TX on, RX on, TX w/weak pull-down (broken wire detect diag)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORMAL_1_0</name>
                  <description>TX on, RX on, 1.0V/us TX edge rate, may not meet all parameters of LIN spec at some operating conditions</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORMAL_1_5</name>
                  <description>TX on, RX on, 1.5V/us TX edge rate, meets all parameters of LIN spec</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORMAL_2_0</name>
                  <description>TX on, RX on, 2.0V/us TX edge rate, may not meet all parameters of LIN spec at some operating conditions</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAST</name>
                  <description>Fast mode (non-lin compliant, up to 100kb/s capable)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RF_DETECT</name>
              <description>Renamed from SL_ROUND. 0=off; 1=on, reduce impact on LIN driver from incoming EMI.</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USE_ALT_INTERFACE</name>
              <description>Selects Primary or Alternate interface for PHY.  The primary use is to enable compliance testing by directly manipulating the PHY interface through GPIOs.
0 = Primary interface (connected to internal LIN/CXPI controller through HSIOM)
1 = Alternate interface (connected to GPIOs through HSIOM)</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SEL_CXPI_LIN</name>
              <description>Selects LIN or CXPI interface. Bit 1 selects between LIN and CXPI, Bit 0 selects between CXPI master and slave</description>
              <bitRange>[13:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LIN_PHY_0</name>
                  <description>Operates as LIN interface</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LIN_PHY_1</name>
                  <description>Operates as LIN interface</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CXPI_MASTER</name>
                  <description>Operates as CXPI master</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CXPI_SLAVE</name>
                  <description>Operates as CXPI slave</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LIN_EN</name>
              <description>Master enable of the LIN/CXPI interface.  
0=Interface is reset and LIN pin is in Hi-Z state
1=Enable the LIN interface</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LIN_TIMER</name>
          <description>LIN Timer Control</description>
          <addressOffset>0x24</addressOffset>
          <resetMask>0xCFFF0FFF</resetMask>
          <fields>
            <field>
              <name>WAKEUP_TIMER</name>
              <description>Number of CLK_LF edges before wakeup interrupt is triggered</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>FAULT_TIMER</name>
              <description>Number of CLK_LF edges before fault interrupt is triggered</description>
              <bitRange>[27:16]</bitRange>
            </field>
            <field>
              <name>WAKEUP_TIMER_EN</name>
              <description>Wakeup timer is running, required for full LIN compatibility if using Deep-sleep power mode</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>FAULT_TIMER_EN</name>
              <description>Dominant state fault timer is running, required for full LIN compatibility</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LIN_STATUS</name>
          <description>LIN Status</description>
          <addressOffset>0x28</addressOffset>
          <access>read-only</access>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>LIN_RXD</name>
              <description>Current state of LIN pin, except when LIN_CTL.LIN_MODE is 0 or 2, when RXD = 1.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LIN_BIST</name>
          <description>LIN BIST Control</description>
          <addressOffset>0x2C</addressOffset>
          <resetMask>0x00000037</resetMask>
          <fields>
            <field>
              <name>LIN_ADFT</name>
              <description>Enables Test Modes</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal Operation (DFT disabled), amuxbus_a=Z, dft&lt;1:0&gt;=0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CURRENT_MONITOR_LWAVE</name>
                  <description>amuxbus_a=Iwave (PMOS drain), dft&lt;1:0&gt;=0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOLTAGE_MONITOR_ERRBUFF</name>
                  <description>amuxbus_a=ErrBuff, dft&lt;1:0&gt;=0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WEAK_OUTFET</name>
                  <description>OUTFET = 1/10,  (amuxbus_a=Z, dft&lt;1:0&gt;=0)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CURRENT_MONITOR_FOR_BIAS_CKT</name>
                  <description>amuxbus_a=Ibias monitor (PMOS drain), dft&lt;1:0&gt;=0</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SL_ROUND</name>
                  <description>0=Normal, 1=More moderate (rounded) edge for lower EMI</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DDFT_OSC</name>
                  <description>amuxbus_a = Z
dft&lt;1&gt; = LIN_DFT_START,  dft&lt;0&gt; = LIN_OSC</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DDFT_DELAY</name>
                  <description>amuxbus_a = Z
dft&lt;1&gt; = LIN_DFT_START,  dft&lt;0&gt; = LIN_DELAY</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LIN_DDFT</name>
              <description>Enable LIN DDFT outputs to DDFT interface
ddft1 = dft&lt;1&gt;, ddft0 = dft&lt;0&gt;</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LIN_DFT_START</name>
              <description>Delay line input</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
