Infineon/mtb-pdl-cat2/devices/svd/psoc4hvpaspm10.svd
        <register>
          <name>LIN_INTR</name>
          <description>HVSS Interrupt Request Register</description>
          <addressOffset>0x30</addressOffset>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>WAKEUP</name>
              <description>Master asserted dominant state wakeup (wakeup timer timeout)</description>
              <bitRange>[0:0]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>FAULT</name>
              <description>Interface asserted state for too long (dominant state timeout)</description>
              <bitRange>[1:1]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>HVREG_TSD</name>
              <description>Thermal Shutdown Detected</description>
              <bitRange>[2:2]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LIN_INTR_SET</name>
          <description>HVSS Interrupt set register</description>
          <addressOffset>0x34</addressOffset>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>WAKEUP</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[0:0]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>FAULT</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[1:1]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>HVREG_TSD</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[2:2]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LIN_INTR_MASK</name>
          <description>HVSS Interrupt mask register</description>
          <addressOffset>0x38</addressOffset>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>WAKEUP</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FAULT</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HVREG_TSD</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LIN_INTR_MASKED</name>
          <description>HVSS Interrupt masked register</description>
          <addressOffset>0x3C</addressOffset>
          <access>read-only</access>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>WAKEUP</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FAULT</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HVREG_TSD</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HVSS_DDFT</name>
          <description>HVSS DDFT Control</description>
          <addressOffset>0x40</addressOffset>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>LSOUT_DDFT</name>
              <description>Enable LSOUT DDFT output to DDFT interface
ddft1 = lsout_ddft, ddft0 = 0</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HVREG_TRIM</name>
          <description>HVREG Master Trim (Output Voltage)</description>
          <addressOffset>0xFF00</addressOffset>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>TRIM</name>
              <description>Trim for VDDD output.</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LIN_TRIM</name>
          <description>LIN Trim Settings</description>
          <addressOffset>0xFF04</addressOffset>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>SLEW_CTL</name>
              <description>N/A</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HVREG_TRIM_VREF</name>
          <description>HVREG Vref Trim</description>
          <addressOffset>0xFF10</addressOffset>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>VREF_CTL</name>
              <description>Vref Trim</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HVREG_TRIM_VREF_TC</name>
          <description>HVREG Vref Output Voltage temp-co Trim</description>
          <addressOffset>0xFF14</addressOffset>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>TC_CTL</name>
              <description>Vref Temperature Trim</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HVREG_TRIM_TSD</name>
          <description>HVREG TSD detection temperatureTrim</description>
          <addressOffset>0xFF18</addressOffset>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>TSD_CTL</name>
              <description>TSD Trim</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HVREG_TRIM_S</name>
          <description>HVREG Slave Trim (Output Voltage)</description>
          <addressOffset>0xFF1C</addressOffset>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>TRIM</name>
              <description>Trim for VDDD output.</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
