Infineon/mtb-pdl-cat2/devices/svd/psoc4hvpaspm10.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CRYPTO</name>
      <version>2.0</version>
      <description>Cryptography component</description>
      <baseAddress>0x400C0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>65536</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTL</name>
          <description>Control</description>
          <addressOffset>0x0</addressOffset>
          <resetValue>0x0000001F</resetValue>
          <resetMask>0x8000001F</resetMask>
          <fields>
            <field>
              <name>OPCODE</name>
              <description>Specifies the operation:
'0': AES forward block cipher.
'1': AES inverse block cipher.
'16': SHA operation.
'24': CRC operation.
otherwise: undefined.</description>
              <bitRange>[4:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AES_FORWARD</name>
                  <description>SRC_CTL0.OFFSET specifies the offset of the key (as used in the first  cipher round) in the memory buffer.
SRC_CTL1.OFFSET specifies the offset of the plaintext in the memory buffer.
DST_CTL0.OFFSET specifies the offset of the key (as used by the last  cipher round) in the memory buffer....</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES_INVERSE</name>
                  <description>SRC_CTL0.OFFSET specifies the offset of the round key (as used in the first inverse cipher round) in the memory buffer.
SRC_CTL1.OFFSET specifies the offset of the ciphertext in the memory buffer.
DST_CTL0.OFFSET specifies the offset of the key (as used by the last inverse cipher round) in the memory buffer....</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHA</name>
                  <description>SRC_CTL0.OFFSET specifies the offset of the message in the memory buffer.
SRC_CTL1.OFFSET specifies the offset of the input hash in the memory buffer.
DST_CTL0.OFFSET specifies the offset of a temporary buffer (to hold message schedule round constants) in the memory buffer....</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC</name>
                  <description>SRC_CTL0.OFFSET specifies the offset of the data in the memory buffer.

When the operation has completed, the resulting CRC can be read from CRC_REM.</description>
                  <value>24</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLED</name>
              <description>IP enable:
'0': Disabled. All non-retention registers (command and status registers) are reset to their default value when the IP is disabled. All retention registers retain their value when the IP is disabled.
'1': Enabled.</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0x4</addressOffset>
          <access>read-only</access>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>Reflects the state of the component:
'0': IP (AES, SHA, CRC component) is not busy.
'1': IP (AES, SHA, CRC component) is busy performing a operation. An operation is started through the CMD register or through the 'tr_in' input trigger. When the IP is busy, it is NOT possible to start another operation. When the IP is busy, it is possible to access the memory buffer (to prepare for another operation).</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD</name>
          <description>Command</description>
          <addressOffset>0x8</addressOffset>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>START</name>
              <description>FW sets this field to '1' to start an operation as specified by CTL.OPCODE. HW sets this field to '0' to indicate that the operation has completed.

HW can start an operation through the 'tr_in' input trigger. A rising edge ('0' to '1' transition) on this trigger starts an operation (as specified by CTL.OPCODE). When an operation completes, a two cycle '1' pulse (on 'clk_sys') is generated on the 'tr_out' output trigger.

SW and HW control over the start of an operation should not be mixed.

When an operation is busy (STATUS.BUSY is '1'), no new operation can be started. A SW write to START is ignored and a HW input trigger 'tr_in' rising edge is ignored.</description>
              <bitRange>[0:0]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SRC_CTL0</name>
          <description>Source control 0</description>
          <addressOffset>0x10</addressOffset>
          <resetMask>0x000007FC</resetMask>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Word (32-bit) offset of source 0 in the data buffer.</description>
              <bitRange>[10:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRC_CTL1</name>
          <description>Source control 1</description>
          <addressOffset>0x14</addressOffset>
          <resetMask>0x000007FC</resetMask>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Word (32-bit) offset of source 1 in the data buffer.</description>
              <bitRange>[10:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DST_CTL0</name>
          <description>Destination control 0</description>
          <addressOffset>0x20</addressOffset>
          <resetMask>0x000007FC</resetMask>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Word (32-bit) offset of destination 0 in the data buffer.</description>
              <bitRange>[10:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DST_CTL1</name>
          <description>Destination control 1</description>
          <addressOffset>0x24</addressOffset>
          <resetMask>0x000007FC</resetMask>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Word (32-bit) offset of destination 1 in the data buffer.</description>
              <bitRange>[10:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AES_CTL</name>
          <description>AES control</description>
          <addressOffset>0x100</addressOffset>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>KEY_SIZE</name>
              <description>AES key size:
'0': 128-bit key, 10 rounds AES (inverse) cipher operation. SRC_CTL0 and DST_CTL0 specify the offset of a 16 Byte key in the memory buffer.
'1': 192-bit key, 12 rounds AES (inverse) cipher operation. SRC_CTL0 and DST_CTL0 specify the offset of a 24 Byte key in the memory buffer.
'2': 256-bit key, 14 rounds AES (inverse) cipher operation. SRC_CTL0 and DST_CTL0 specify the offset of a 32 Byte key in the memory buffer.
'3': undefined</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PR_CTL</name>
          <description>Pseudo random control</description>
          <addressOffset>0x200</addressOffset>
          <fields>
            <field>
              <name>MAX</name>
              <description>Specifies the maximum random value of the pseudo random number generator:
'0': produces a random number in the range {0}
'1': produces a random number in the range [0, 1]
'2': produces a random number in the range [0, 1, 2]
'3': produces a random number in the range [0, 3]
...
'(2^32)-1': produces a random number in the range [0, (2^32)-1].</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PR_CMD</name>
          <description>Pseudo random command</description>
          <addressOffset>0x208</addressOffset>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>START</name>
              <description>SW sets this field to '1' to start the pseudo ransom number generator. HW clears this field to '0' when the operation has completed and the resulting pseudo random number (in the range [0, PR_CTL.MAX]) can be read from PR_RESULT.</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PR_LFSR_CTL0</name>
          <description>Pseudo random LFSR control 0</description>
          <addressOffset>0x210</addressOffset>
          <fields>
            <field>
              <name>LFSR32</name>
              <description>State of a 32-bit Linear Feedback Shift Registers (LFSR) that is used to generate a pseudo random bit sequence. This register needs to be initialized by SW. The initialization value should be different from '0'.

The three PR_LFSR_CTL registers represents the state of a 32-bit, 31-bit and 29-bit LFSR. Individually, these LFSRs generate a pseudo random bit sequence that repeats itself after (2^32)-1, (2^31)-1 and (2^29)-1 bits. The numbers (2^32)-1, (2^31)-1 and (2^29)-1 are relatively prime (their greatest common denominator is '1'). The three bit sequence are combined (XOR'd) into a single bitstream to create a pseudo random bit sequence that repeats itself after ((2^32)-1) * ((2^31)-1) * ((2*29)-1) bits.

The following polynomials are used:
- 32-bit irreducible polynomial: x^32+x^30+x^26+x^25+1.
- 31-bit irreducible polynomial: x^31+x^28+1.
- 29-bit irreducible polynomial: x^29+x^27+1.</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PR_LFSR_CTL1</name>
          <description>Pseudo random LFSR control 1</description>
          <addressOffset>0x214</addressOffset>
          <resetMask>0x7FFFFFFF</resetMask>
          <fields>
            <field>
              <name>LFSR31</name>
              <description>State of a 31-bit Linear Feedback Shift Registers (LFSR) that is used to generate a pseudo random bit sequence. See PR_LFSR_CTL0.</description>
              <bitRange>[30:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PR_LFSR_CTL2</name>
          <description>Pseudo random LFSR control 2</description>
          <addressOffset>0x218</addressOffset>
          <resetMask>0x1FFFFFFF</resetMask>
          <fields>
            <field>
              <name>LFSR29</name>
              <description>State of a 29-bit Linear Feedback Shift Registers (LFSR) that is used to generate a pseudo random bit sequence. See PR_LFSR_CTL0.</description>
              <bitRange>[28:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PR_RESULT</name>
          <description>Pseudo random status</description>
          <addressOffset>0x220</addressOffset>
          <fields>
            <field>
              <name>DATA32</name>
              <description>Result of a pseudo random number generation operation. The resulting value DATA is in the range [0, PR_CTL.MAX]. HW generates the number in this field.
Note that SW can write this field. This functionality can be used prevent information leakage from the privileged domain to the user domain.</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TR_CTL0</name>
          <description>True random control 0</description>
          <addressOffset>0x280</addressOffset>
          <resetValue>0x00030000</resetValue>
          <resetMask>0x31FFFFFF</resetMask>
          <fields>
            <field>
              <name>SAMPLE_CLOCK_DIV</name>
              <description>Specifies the clock divider that is used to sample oscillator data. This clock divider is wrt. 'clk_sys'.
'0': sample clock is 'clk_sys'.
'1': sample clock is 'clk_sys'/2.
...
'255': sample clock is 'clk_sys'/256.</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>RED_CLOCK_DIV</name>
              <description>Specifies the clock divider that is used to produce reduced bits. 
'0': 1 reduced bit is produced for each sample.
'1': 1 reduced bit is produced for each 2 samples.
...
'255': 1 reduced bit is produced for each 256 samples.

The reduced bits are considered random bits and shifted into TR_RESULT0.DATA32.</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>INIT_DELAY</name>
              <description>Specifies an initialization delay: number of removed/dropped samples before reduced bits are generated. This field should be programmed in the range [1, 255]. After starting the oscillators, at least the first 2 samples should be removed/dropped to clear the state of internal synchronizers. In addition, it is advised to drop the second 2 samples from the oscillators (to circumvent the semi-predictable oscillator startup behavior). This result in the default field value of '3'. Field encoding is as follows:
'0': 1 sample is dropped.
'1': 2 samples are dropped.
...
'255': 256 samples are dropped.

The TR_INITIALIZED interrupt cause is set to '1', when the initialization delay is passed.</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>VON_NEUMANN_CORR</name>
              <description>Specifies if the 'von Neumann corrector' is disabled or enabled:
'0': disabled.
'1': enabled.
The 'von Neumann corrector' post-processes the reduced bits to remove a '0' or '1' bias. The corrector operates on reduced bit pairs ('oldest bit, newest bit'):
'00': no bit is produced.
'01': '0' bit is produced (oldest bit).
'10': '1' bit is produced (oldest bit).
'11': no bit is produced.
Note that the corrector produces bits at a random pace and at a frequency that is 1/4 of the reduced bit frequency (reduced bits are processed in pairs, and half of the pairs do NOT produce a bit).</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>STOP_ON_AP_DETECT</name>
              <description>Specifies if TRNG functionality is stopped on an adaptive proportion test detection (when HW sets INTR.TR_AP_DETECT to '1'):
'0': Functionality is stopped (TR_CMD fields are set to '0' by HW).
'1': Functionality is NOT stopped.</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>STOP_ON_RC_DETECT</name>
              <description>Specifies if TRNG functionality is stopped on a repetition count test detection (when HW sets INTR.TR_RC_DETECT to '1'):
'0': Functionality is stopped (TR_CMD fields are set to '0' by HW).
'1': Functionality is NOT stopped.</description>
              <bitRange>[29:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TR_CTL1</name>
          <description>True random control 1</description>
          <addressOffset>0x284</addressOffset>
          <resetValue>0x00000020</resetValue>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>DATA_BIT_SIZE</name>
              <description>Specifies the number of desired of bits in the generated random number (legal range: [1, 32]). The TR_DATA_AVAILABLE interrupt cause is set to '1' when TR_RESULT1.DATA_BIT_SIZE &gt;= DATA_BIT_SIZE.</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TR_RESULT0</name>
          <description>True random result 0</description>
          <addressOffset>0x288</addressOffset>
          <fields>
            <field>
              <name>DATA32</name>
              <description>Generated true random number. HW generates the number in this field. When a new random bit is generated, it is shifted into the lowest bit position (DATA32[0]) and the highest bit position (DATA32[31]) is shifted out.

Note that SW can write this field. This functionality can be used prevent information leakage.</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TR_RESULT1</name>
          <description>True random result 1</description>
          <addressOffset>0x28C</addressOffset>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>DATA_BIT_SIZE</name>
              <description>Specifies the number of bits in the generated true random number (TR_RESULT0.DATA32). When a new random bit is generated, this field is incremented by '1'. The value is in the range [0, 32] (a saturating counter is used).

Note that SW can write this field. This functionality can be used prevent information leakage. 

Typically, this field is updated/decremented in the interrupt handler. The interrupt handler decrements the field by the number of consumed bits. If the interrupt handler does NOT update this field (and TR_RESULT.DATA_BIT_SIZE is unchanged), the TR_DATA_AVAILABLE interrupt cause will remain activated. Therefore, proper interrupt based usage is as follows:
- Consume bits from TR_RESULT0.
- Write consumed bits in TR_RESULT0 to '0's (if information leakage needs to prevented).
- Decrement TR_RESULT1 by the number of consumed bits.
- Deactivate INTR.TR_DATA_AVAILABLE.</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TR_CMD</name>
          <description>True random command</description>
          <addressOffset>0x290</addressOffset>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>START_RO11</name>
              <description>SW sets this field to '1' to start the ring oscillator with 11 inverters.</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>START_RO15</name>
              <description>SW sets this field to '1' to start the ring oscillator with 15 inverters.</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>START_GARO15</name>
              <description>SW sets this field to '1' to start the fixed Galois ring oscillator with 15 inverters.</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>START_GARO31</name>
              <description>SW sets this field to '1' to start the programmable Galois ring oscillator with up to 31 inverters. The TR_GARO_CTL register specifies the programmable polynomial.</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>START_FIRO15</name>
              <description>SW sets this field to '1' to start the fixed Fibonacci ring oscillator with 15 inverters.</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>START_FIRO31</name>
              <description>SW sets this field to '1' to start the programmable Fibonacci ring oscillator with up to 31 inverters. The TR_FIRO_CTL register specifies the programmable polynomial.</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TR_GARO_CTL</name>
          <description>True random GARO control</description>
          <addressOffset>0x2A0</addressOffset>
          <resetMask>0x7FFFFFFF</resetMask>
          <fields>
            <field>
              <name>POLYNOMIAL31</name>
              <description>Polynomial for programmable Galois ring oscillator. The polynomial is represented WITHOUT the high order bit (this bit is always assumed '1'). The polynomial should be aligned such that the more significant bits (bit 30 and down) contain the polynomial and the less significant bits (bit 0 and up) contain padding '0's.</description>
              <bitRange>[30:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TR_FIRO_CTL</name>
          <description>True random FIRO control</description>
          <addressOffset>0x2A4</addressOffset>
          <resetMask>0x7FFFFFFF</resetMask>
          <fields>
            <field>
              <name>POLYNOMIAL31</name>
              <description>Polynomial for programmable Fibonacci ring oscillator. The polynomial is represented WITHOUT the high order bit (this bit is always assumed '1'). The polynomial should be aligned such that the more significant bits (bit 30 and down) contain the polynomial and the less significant bits (bit 0 and up) contain padding '0's.</description>
              <bitRange>[30:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TR_MON_CTL</name>
          <description>True random monitor control</description>
          <addressOffset>0x2C0</addressOffset>
          <resetValue>0x00000002</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>BITSTREAM_SEL</name>
              <description>Selection of the bitstream:
'0': DAS bitstream.
'1': RED bitstream.
'2': TR bitstream.
'3': Undefined.</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TR_MON_CMD</name>
          <description>True random monitor command</description>
          <addressOffset>0x2C8</addressOffset>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>START_AP</name>
              <description>Adaptive proportion (AP) test enable:
'0': Stopped.
'1': Started.

On a AP detection, HW sets this field to '0' and sets INTR.TR_AP_DETECT to '1.</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>START_RC</name>
              <description>Repetition count (RC) test enable:
'0': Disabled.
'1': Enabled.

On a RC detection, HW sets this field to '0' and sets INTR.TR_RC_DETECT to '1.</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
