Infineon/mtb-pdl-cat2/devices/svd/psoc4hvpaspm10.svd
        <register>
          <name>TR_MON_RC_CTL</name>
          <description>True random monitor RC control</description>
          <addressOffset>0x2D0</addressOffset>
          <resetValue>0x000000FF</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>CUTOFF_COUNT8</name>
              <description>Cutoff count (legal range is [1, 255]):
'0': Illegal.
'1': 1 repetition.
...
'255': 255 repetitions.</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TR_MON_RC_STATUS0</name>
          <description>True random monitor RC status 0</description>
          <addressOffset>0x2D8</addressOffset>
          <access>read-only</access>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>BIT</name>
              <description>Current active bit value:
'0': '0'.
'1': '1'.

This field is only valid when TR_MON_RC_STATUS1.REP_COUNT is NOT equal to '0'.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TR_MON_RC_STATUS1</name>
          <description>True random monitor RC status 1</description>
          <addressOffset>0x2DC</addressOffset>
          <access>read-only</access>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>REP_COUNT</name>
              <description>Number of repetitions of the current active bit counter:
'0': 0 repetitions.
...
'255': 255 repetitions.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TR_MON_AP_CTL</name>
          <description>True random monitor AP control</description>
          <addressOffset>0x2E0</addressOffset>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CUTOFF_COUNT16</name>
              <description>Cutoff count (legal range is [1, 65535]).
'0': Illegal.
'1': 1 occurance.
...
'65535': 65535 occurances.</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>WINDOW_SIZE</name>
              <description>Window size (minus 1) :
'0': 1 bit.
...
'65535': 65536 bits.</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TR_MON_AP_STATUS0</name>
          <description>True random monitor AP status 0</description>
          <addressOffset>0x2E8</addressOffset>
          <access>read-only</access>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>BIT</name>
              <description>Current active bit value:
'0': '0'.
'1': '1'.

This field is only valid when TR_MON_AP_STATUS1.OCC_COUNT is NOT equal to '0'.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TR_MON_AP_STATUS1</name>
          <description>True random monitor AP status 1</description>
          <addressOffset>0x2EC</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>OCC_COUNT</name>
              <description>Number of occurances of the current active bit counter:
'0': 0 occurances
...
'65535': 65535 occurances</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WINDOW_INDEX</name>
              <description>Counter to keep track of the current index in the window (counts down from TR_MON_AP_CTL.WINDOW_SIZE to '0').</description>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_CTL</name>
          <description>SHA control</description>
          <addressOffset>0x300</addressOffset>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>SHA mode:
'0': SHA1. The message is 16 32 bits words: 64 Bytes. The hash is 5 32-bit words: 20 Bytes. There are 80 32-bit message schedule round constants: 320 Bytes.
'1': SHA2_224, SHA2_256. The message is 16 32-bit words: 64 Bytes. The hash is 8 32-bit words: 32 Bytes. There are 64 32-bit message schedule round constants: 256 Bytes. The difference between SHA2-224 and SHA2-256 is entirely in software.
'2': undefined
'3': SHA2-384 (NOT supported)
'4': SHA2-512 (NOT supported)
'5': SHA2-512/224 (NOT supported)
'6': SHA2-512/256 (NOT supported)
'7': undefined</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CRC_DATA_CTL0</name>
          <description>CRC data control 0</description>
          <addressOffset>0x400</addressOffset>
          <resetMask>0x07FF0001</resetMask>
          <fields>
            <field>
              <name>DATA_REVERSE</name>
              <description>Specifies the bit order in which a data byte is processed (reversal is performed after XORing):
'0': Most significant bit (bit 1) first.
'1': Least significant bit (bit 0) first.</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DATA_SIZE</name>
              <description>Size of the data in bytes (the size is limited by the memory buffer size), the number bytes processed is DATA_SIZE+1:
'0': 1 byte.
'1': 2 bytes.
...
'2047': 2048 bytes.</description>
              <bitRange>[26:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CRC_DATA_CTL1</name>
          <description>CRC data control 1</description>
          <addressOffset>0x404</addressOffset>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>DATA_XOR</name>
              <description>Specifies a byte mask with which each data byte is XOR'd. The XOR is performed before data reversal.</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CRC_POL_CTL</name>
          <description>CRC polynomial control</description>
          <addressOffset>0x410</addressOffset>
          <fields>
            <field>
              <name>POLYNOMIAL</name>
              <description>CRC polynomial. The polynomial is represented without the high order bit (this bit is always assumed '1'). The polynomial should be aligned such that the more significant bits (bit 31 and down) contain the polynomial and the less significant bits (bit 0 and up) contain padding '0's. Some frequently used polynomials:
- CRC32: POLYNOMIAL is 0x04c11db7.
- CRC16: POLYNOMIAL is 0x80050000.
- CRC16 CCITT: POLYNOMIAL is 0x10210000.</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CRC_LFSR_CTL</name>
          <description>CRC LFSR control</description>
          <addressOffset>0x414</addressOffset>
          <fields>
            <field>
              <name>LFSR32</name>
              <description>State of a 32-bit Linear Feedback Shift Registers (LFSR) that is used to implement CRC. This register needs to be initialized by SW to provide the CRC seed value.

The seed value should be aligned such that the more significant bits (bit 31 and down) contain the seed value and the less significant bits (bit 0 and up) contain padding '0's.</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CRC_REM_CTL0</name>
          <description>CRC remainder control 0</description>
          <addressOffset>0x420</addressOffset>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>REM_REVERSE</name>
              <description>Specifies whether the remainder is bit reversed (reversal is performed after XORing):
'0': No.
'1': Yes.</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CRC_REM_CTL1</name>
          <description>CRC remainder control 1</description>
          <addressOffset>0x424</addressOffset>
          <fields>
            <field>
              <name>REM_XOR</name>
              <description>Specifies a mask with which the LFSR register is XOR'd to produce a remainder. The XOR is performed before remainder reversal.</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CRC_REM</name>
          <description>CRC remainder status</description>
          <addressOffset>0x428</addressOffset>
          <access>read-only</access>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>REM</name>
              <description>Remainder value. The alignment of the remainder depends on CRC_REM_CTL0.REM_REVERSE: 
'0': the more significant bits (bit 31 and down) contain the remainder.
'1': the less significant bits (bit 0 and up) contain the remainder.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR</name>
          <description>Interrupt request</description>
          <addressOffset>0x7C0</addressOffset>
          <resetMask>0x000003C3</resetMask>
          <fields>
            <field>
              <name>DONE</name>
              <description>This interrupt cause is activated (HW sets the field to '1') when a command/operation completes. SW writes a '1' to this field to clear the interrupt cause.

As an alternative to interrupt driven operation, SW can poll the STATUS.BUSY field to determine completion of an operation.</description>
              <bitRange>[0:0]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ACCESS_ERROR</name>
              <description>This interrupt cause is activated (HW sets the field to '1') when a command/operation is aborted due to a user/privileged mode violation of the buffer accesses.</description>
              <bitRange>[1:1]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TR_INITIALIZED</name>
              <description>This interrupt cause is activated (HW sets the field to '1') when the true random number generator is initialized.</description>
              <bitRange>[6:6]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TR_DATA_AVAILABLE</name>
              <description>This interrupt cause is activated (HW sets the field to '1') when the true random number generator has generated a data value of the specified bit size: (TR_RESULT.DATA_BIT_SIZE &gt;= TR_CTL.DATA_BIT_SIZE).
See TR_RESULT1.DATA_BIT_SIZE for proper deactivation of this interrupt cause.</description>
              <bitRange>[7:7]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TR_AP_DETECT</name>
              <description>This interrupt cause is activated (HW sets the field to '1') when the true random number generator monitor repetition count test detects a repetition of a specific bit value.</description>
              <bitRange>[8:8]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TR_RC_DETECT</name>
              <description>This interrupt cause is activated (HW sets the field to '1') when the true random number generator monitor adaptive proportion test detects a disproportionate occurrence of a specific bit value.</description>
              <bitRange>[9:9]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_SET</name>
          <description>Interrupt set request</description>
          <addressOffset>0x7C4</addressOffset>
          <resetMask>0x000003C3</resetMask>
          <fields>
            <field>
              <name>DONE</name>
              <description>SW writes a '1' to this field to set the corresponding field in interrupt request register.</description>
              <bitRange>[0:0]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>ACCESS_ERROR</name>
              <description>SW writes a '1' to this field to set the corresponding field in interrupt request register.</description>
              <bitRange>[1:1]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>TR_INITIALIZED</name>
              <description>SW writes a '1' to this field to set the corresponding field in interrupt request register.</description>
              <bitRange>[6:6]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>TR_DATA_AVAILABLE</name>
              <description>SW writes a '1' to this field to set the corresponding field in interrupt request register.</description>
              <bitRange>[7:7]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>TR_AP_DETECT</name>
              <description>SW writes a '1' to this field to set the corresponding field in interrupt request register.</description>
              <bitRange>[8:8]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>TR_RC_DETECT</name>
              <description>SW writes a '1' to this field to set the corresponding field in interrupt request register.</description>
              <bitRange>[9:9]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_MASK</name>
          <description>Interrupt mask</description>
          <addressOffset>0x7C8</addressOffset>
          <resetMask>0x000003C3</resetMask>
          <fields>
            <field>
              <name>DONE</name>
              <description>Mask bit for corresponding field in interrupt request register.</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ACCESS_ERROR</name>
              <description>Mask bit for corresponding field in interrupt request register.</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TR_INITIALIZED</name>
              <description>Mask bit for corresponding field in interrupt request register.</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TR_DATA_AVAILABLE</name>
              <description>Mask bit for corresponding field in interrupt request register.</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TR_AP_DETECT</name>
              <description>Mask bit for corresponding field in interrupt request register.</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TR_RC_DETECT</name>
              <description>Mask bit for corresponding field in interrupt request register.</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_MASKED</name>
          <description>Interrupt masked</description>
          <addressOffset>0x7CC</addressOffset>
          <access>read-only</access>
          <resetMask>0x000003C3</resetMask>
          <fields>
            <field>
              <name>DONE</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ACCESS_ERROR</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TR_INITIALIZED</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TR_DATA_AVAILABLE</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TR_AP_DETECT</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TR_RC_DETECT</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
