Infineon/mtb-pdl-cat2/devices/svd/psoc4hvpaspm10.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>EXCO</name>
      <version>2.0</version>
      <description>ECO+PLL as SRSSLT clk_eco external source</description>
      <baseAddress>0x400F0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>65536</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CLK_SELECT</name>
          <description>Clock Select Register</description>
          <addressOffset>0x0</addressOffset>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>CLK_SELECT</name>
              <description>Select a clock source for clk_eco:
If PLL_CONFIG.ENABLE=0, then clk_eco=clk_osc. 
When PLL_CONFIG.ENABLE=1, and PLL_CONFIG.BYPASS=2'b10:
0: clk_osc
1: clk_pll</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>REF_SEL</name>
              <description>N/A</description>
              <bitRange>[2:1]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEL_ECO</name>
                  <description>From ECO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL_EXT_REF</name>
                  <description>From external reference</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL_CLK_IMO</name>
                  <description>From CLK_IMO</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ECO_CONFIG</name>
          <description>ECO Configuration Register</description>
          <addressOffset>0x8</addressOffset>
          <resetValue>0x00000002</resetValue>
          <resetMask>0x80000003</resetMask>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Clock Enable.  When enabling the clock, first write ENABLE=1, wait at least 10us, and then write CLK_EN=1.  When disabling, clearing both CLK_EN=0 and ENABLE=0 can be done in the same AHB write</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>AGC_EN</name>
              <description>Automatic Gain Control (AGC) enable.  When set, the oscillation amplitude is controlled to the level selected by ECO_TRIM0.ATRIM.  When low, the amplitude is not explicitly controlled and will grow until it saturates to the supply rail (1.8V nom).  WARNING: use care when disabling AGC because driving a crystal beyond its rated limit can permanently damage the crystal.</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Master enable for ECO oscillator.  Refer to CLK_EN for sequencing.</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ECO_STATUS</name>
          <description>ECO Status Register</description>
          <addressOffset>0xC</addressOffset>
          <access>read-only</access>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>WATCHDOG_ERROR</name>
              <description>This bit is set to 1 if the oscillator is stuck.  The ECO clock is gated off during a watchdog error condition. Due to internal synchonization, the clock is stopped two cycles after an error condition is observed and ungated two cycles after the error condition is resolved.

Note: This bit setting reflected in INT.WD_ERR if Interrupts are enabled.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL_CONFIG</name>
          <description>PLL Configuration Register</description>
          <addressOffset>0x14</addressOffset>
          <resetValue>0x00020000</resetValue>
          <resetMask>0xC037FFFF</resetMask>
          <fields>
            <field>
              <name>FEEDBACK_DIV</name>
              <description>Control bits for feedback divider:

0x08 = Divide by 8 (minimum legal value)
0x09 = Divide by 9
...
0xFF = Divide by 255

Must be set so that 22.5MHz &lt;= FVCO &lt;= 104MHz, where
FVCO = FREF * FEEDBACK_DIV  / ( REFERENCE_DIV+1 )

Do not change while PLL output is selected. Additional limitations on PLL output frequency apply if PLL is providing the system clock.</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>REFERENCE_DIV</name>
              <description>Control bits for reference divider:

0x00 = Divide by 1
0x01 - Divide by 2
...
0x3F = Divide by 64

Must be set so that 1 MHz &lt;= FPFD &lt;= 3 MHz, where
FPFD = FREF / (REFERENCE_DIV+1)

Do not change while PLL output is selected.</description>
              <bitRange>[13:8]</bitRange>
            </field>
            <field>
              <name>OUTPUT_DIV</name>
              <description>Control bits for Output divider:

FOUT = FVCO / {1,2,4,8}</description>
              <bitRange>[15:14]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PASS</name>
                  <description>Pass Through</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>Divide by 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>Divide by 4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>Divide by 8</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICP_SEL</name>
              <description>Programmable charge pump current between 0uA and 7uA.  For functional operation, the value must be set according to the PLL output frequency Fout (measured before the output divider):
0,1: Illegal
2: 2uA. Use when Fout &lt;= 67MHz
3: 3uA. Use when Fout &gt; 67MHz
4-7: Illegal</description>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>BYPASS_SEL</name>
              <description>N/A</description>
              <bitRange>[21:20]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUTO</name>
                  <description>Automatic using lock indicator.  When unlocked, automatically selects PLL reference input (bypass mode).  When locked, automatically selects PLL output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO1</name>
                  <description>Same as AUTO</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_REF</name>
                  <description>Select PLL reference input (bypass mode).  Ignores lock indicator</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_OUT</name>
                  <description>Select PLL output.  Ignores lock indicator.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISOLATE_N</name>
              <description>Isolation control of PLL outputs.  This also internally resets the PLL.  De-assert &gt;= 5us after ENABLE=1.  Assertion can happen in same write as ENABLE=0.
0: Isolate outputs
1: Do not isolate outputs</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>ENABLE</name>
              <description>N/A</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL_STATUS</name>
          <description>PLL Status Register</description>
          <addressOffset>0x18</addressOffset>
          <access>read-only</access>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>LOCKED</name>
              <description>PLL Lock Indicator</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL_TEST</name>
          <description>PLL Test Register</description>
          <addressOffset>0x1C</addressOffset>
          <resetValue>0x00000008</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>TEST_MODE</name>
              <description>N/A</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal Operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_VC_LKG</name>
                  <description>Vcontrol Leakage Test Mode
Measure frequency drift over time to indirectly measure leakage on Vcontrol</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_CP_DN</name>
                  <description>Charge Pump Down Current Test Mode
With ICPSEL&gt;0, directly measure charge pump up current on Vcontrol
With ICPSEL=0, directly measure leakage on Vcontrol...</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_CP_UP</name>
                  <description>Charge Pump Up Current Test Mode
With ICPSEL&gt;0, directly measure charge pump up current on Vcontrol
With ICPSEL=0, directly measure leakage on Vcontrol...</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USER_EXT_FL</name>
                  <description>User Mode with Extended Fast Lock Precharge</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_CTR_PQ</name>
                  <description>Reference and Feedback Counter Test Mode</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_LD_DLY</name>
                  <description>Lock Detector Delay Line Test Mode</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_CTR_ALT</name>
                  <description>Lock Detector Wait and Extended Fast Lock Counter Test Mode
With ICPSEL=0 and Reference Clock stopped directly measure precharge current on Vcontrol
With ICPSEL=0 and Reference Clock running directly measure leakage on Vcontrol</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAST_LOCK_EN</name>
              <description>N/A</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>UNLOCK_OCCURRED</name>
              <description>This bit is not retained.</description>
              <bitRange>[4:4]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXCO_PGM_CLK</name>
          <description>EXCO Program Clock</description>
          <addressOffset>0x20</addressOffset>
          <resetMask>0x8000001E</resetMask>
          <fields>
            <field>
              <name>CLK_ECO</name>
              <description>Bit bang clk_eco</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CLK_PLL0_IN</name>
              <description>Observation point for clk_pll0_in, not retained. Not applicable if PLL is absent from the product configuration</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_PLL0_OUT</name>
              <description>Bit bang clk_pll0_out. Not applicable of PLL is absent from the product configuration.</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EN_CLK_PLL0</name>
              <description>Bit bang en_clk_pll0. Not applicable of PLL is absent from the product configuration.</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable bit-banging test capability in this register.</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REF_CTL</name>
          <description>Clock Supervision Reference Contol</description>
          <addressOffset>0x30</addressOffset>
          <resetValue>0x00040000</resetValue>
          <resetMask>0x8007FFFF</resetMask>
          <fields>
            <field>
              <name>STARTUP</name>
              <description>Startup delay time -1 (in reference clock cycles), after enable or DeepSleep wakeup, from reference clock start to monitored clock start.
At a minimum (both clocks running): STARTUP &gt;= (PERIOD +3) * FREQ_RATIO - UPPER, with FREQ_RATIO = (Reference frequency / Monitored frequency)
On top of that the actual clock startup delay and the margin for accuracy of both clocks must be added.</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>CSV_INT_EN</name>
              <description>Enable CSV setting INT.CSV_CLK_SW if a clock switch occurs to IMO.</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CSV_TRIG_EN</name>
              <description>Enable CSV to cause trigger if a clock switch occurs to IMO.</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CSV_CLK_SW_EN</name>
              <description>Enable CSV to cause Clock Switch to IMO when set.</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CSV_EN</name>
              <description>Enables clock supervision, both frequency and loss.    
CSV in Active domain: Clock supervision is reset during DeepSleep and Hibernate modes.  When enabled it begins operating automatically after a DeepSleep wakeup, but it must be reconfigured after Hibernate wakeup.  

