Infineon/mtb-pdl-cat2/devices/svd/psoc4hvpaspm10.svd
When CSV error detection occurs - the CSV_CLK_SW, CSV_INT_EN and CVS_TRIG_EN control where the error is reported.</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REF_LIMIT</name>
          <description>Clock Supervision Reference Limits</description>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>LOWER</name>
              <description>Cycle time lower limit.  Set the lower limit -1, in reference clock cycles, before the next monitored clock event is allowed to happen.  If a monitored clock event happens before this limit is reached a CSV error is detected.
LOWER must be at least 1 less than UPPER. In case the clocks are asynchronous LOWER must be at least 3 less than UPPER.</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>UPPER</name>
              <description>Cycle time upper limit.  Set the upper limit -1, in reference clock cycles, before (or same time) the next monitored clock event must happen.  If a monitored clock event does not happen before this limit is reached, or does not happen at all (clock loss), a CSV error is detected.</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MON_CTL</name>
          <description>Clock Supervision Monitor Control</description>
          <addressOffset>0x38</addressOffset>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>PERIOD</name>
              <description>Period time.  Set the Period -1, in monitored clock cycles, before the next monitored clock event happens. 
PERIOD &lt;=  (UPPER+1) / FREQ_RATIO -1, with FREQ_RATIO = (Reference frequency / Monitored frequency)
In case the clocks are asynchronous: PERIOD &lt;=  UPPER / FREQ_RATIO -1
Additionaly margin must be added for accuracy of both clocks.</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR</name>
          <description>Interrupt Request Register</description>
          <addressOffset>0x40</addressOffset>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>PLL_LOCK</name>
              <description>HW will set this bit when PLL loses lock (PLL 'locked' output goes low).  Not applicable of PLL is absent from the product configuration.</description>
              <bitRange>[0:0]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>WD_ERR</name>
              <description>EXCO Watch Dog Error detected - Oscillator stopped oscillating</description>
              <bitRange>[1:1]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>CSV_CLK_SW</name>
              <description>Clock Supervisor Switched Clock Source to IMO</description>
              <bitRange>[2:2]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_SET</name>
          <description>Interrupt Set Register</description>
          <addressOffset>0x44</addressOffset>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>PLL_LOCK</name>
              <description>Write with '1' to set corresponding bit in interrupt request register. Not applicable of PLL is absent from the product configuration.</description>
              <bitRange>[0:0]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>WD_ERR</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[1:1]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>CSV_CLK_SW</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[2:2]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_MASK</name>
          <description>Interrupt Mask Register</description>
          <addressOffset>0x48</addressOffset>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>PLL_LOCK</name>
              <description>Mask bit for corresponding bit in interrupt request register. Not applicable of PLL is absent from the product configuration.</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>WD_ERR</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CSV_CLK_SW</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_MASKED</name>
          <description>Interrrupt Masked Register</description>
          <addressOffset>0x4C</addressOffset>
          <access>read-only</access>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>PLL_LOCK</name>
              <description>Logical and of corresponding request and mask bits. Not applicable of PLL is absent from the product configuration.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WD_ERR</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CSV_CLK_SW</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSTDLY_CTL</name>
          <description>Programmable Delay Counter  Control</description>
          <addressOffset>0x50</addressOffset>
          <resetMask>0x80000001</resetMask>
          <fields>
            <field>
              <name>LOAD</name>
              <description>Programmable Delay Counter Load - Reloads the DLYCOUNT into the COUNT_VAL register
0: No Action
1: Generate a 1 clock pulse that loads the Initial value into the COUNT_VAL register.</description>
              <bitRange>[0:0]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>EN</name>
              <description>Programmable Delay Counter Enable
'0': Disable
'1': Enable</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RSTDLY</name>
          <description>Programmable Delay Counter Initial  Amount</description>
          <addressOffset>0x54</addressOffset>
          <resetValue>0x00000100</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>DLYCOUNT</name>
              <description>Delay Count Value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RSTDLY_COUNT_VAL</name>
          <description>Programmable Delay Counter Value</description>
          <addressOffset>0x58</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000100</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>COUNT_VAL</name>
              <description>Current Programmable Delay Counter value</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECO_TRIM0</name>
          <description>ECO Trim0 Register</description>
          <addressOffset>0xFF00</addressOffset>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>WDTRIM</name>
              <description>Watch Dog Trim -  Delta voltage below stead state level
0x0 - 0.05V
0x1 - 0.1V
0x2 - 0.15V
0x3 - 0.2V</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ATRIM</name>
              <description>Amplitude trim to set the crystal drive level when ECO_CONFIG.AGC_EN=1.  WARNING: use care when setting this field because driving a crystal beyond its rated limit can permanently damage the crystal.
0x0 - 0.3Vpp
0x1 - 0.4Vpp
0x2 - 0.5Vpp
0x3 - 0.6Vpp
0x4 - 0.7Vpp
0x5 - 0.8Vpp
0x6 - 0.9Vpp
0x7 - 1.0Vpp</description>
              <bitRange>[4:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ECO_TRIM1</name>
          <description>ECO Trim1 Register</description>
          <addressOffset>0xFF04</addressOffset>
          <resetValue>0x00000015</resetValue>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>FTRIM</name>
              <description>Filter Trim - 3rd harmonic oscillation</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>RTRIM</name>
              <description>Feedback resistor Trim</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>GTRIM</name>
              <description>Gain Trim - Startup time</description>
              <bitRange>[5:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL_TRIM</name>
          <description>PLL Trim Register</description>
          <addressOffset>0xFF0C</addressOffset>
          <resetValue>0x00000012</resetValue>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>VCO_GAIN</name>
              <description>N/A</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>LOCK_WINDOW</name>
              <description>This register determines how much phase error is tolerated before declaring the PLL unlocked (lock_out goes low). Phase error is a measure of the phase difference between the PLL feedforward path (CLK_REF PERIOD/REFERENCE_DIV[1:0]) and feedback path (CLK_VCO/FEEDBACK_DIV[1:0]). The average phase error when locked is zero, but accumulated jitter - particularly on CLK_REF - leads to the need for a relatively large allowed phase error window.</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DELAY_25NS</name>
                  <description>Delay 25 ns</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_50NS</name>
                  <description>Delay 50 ns</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_75NS</name>
                  <description>Delay 75 ns</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_100NS</name>
                  <description>Delay 100 ns</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_DELAY</name>
              <description>N/A</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PFD_CLK_16</name>
                  <description>16 PFD clock cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFD_CLK_32</name>
                  <description>32 PFD clock cycles</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFD_CLK_48</name>
                  <description>48 PFD clock cycles</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFD_CLK_64</name>
                  <description>64 PFD clock cycles</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
