Infineon/mtb-pdl-cat2/devices/svd/psoc4hvpaspm10.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CPUSS</name>
      <version>3.0</version>
      <description>CPU Subsystem</description>
      <baseAddress>0x40100000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>srss_interrupt_srss</name>
        <description>SRSS interrupts</description>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>srss_wdt_irq</name>
        <description>WDT Interrupt</description>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>ioss_interrupt_gpio</name>
        <description>GPIO consolidated interrupt</description>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>ioss_interrupts_gpio_0</name>
        <description>GPIO P0</description>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>ioss_interrupts_gpio_2</name>
        <description>GPIO P2</description>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>ioss_interrupts_gpio_3</name>
        <description>GPIO P3</description>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>hvss_interrupt_hvss</name>
        <description>HVSS interface interrupt</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>scb_0_interrupt</name>
        <description>SCB #0 interrupt</description>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>scb_1_interrupt</name>
        <description>SCB #1 interrupt</description>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>isouart_interrupt</name>
        <description>isoUART interrupt</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>cpuss_interrupt_dma</name>
        <description>DMA Interrupt</description>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>cpuss_interrupt_spcif</name>
        <description>SPCIF interrupt</description>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>cpuss_interrupt_spcif1</name>
        <description>SPCIF interrupt, controller 1</description>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>cpuss_interrupt_fault_0</name>
        <description>Fault structure 0 interrupt</description>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>cpuss_interrupt_fault_1</name>
        <description>Fault structure 1 interrupt</description>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_interrupts_0</name>
        <description>TCPWM #0, Counter #0</description>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_interrupts_1</name>
        <description>TCPWM #0, Counter #1</description>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_interrupts_2</name>
        <description>TCPWM #0, Counter #2</description>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_interrupts_3</name>
        <description>TCPWM #0, Counter #3</description>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_interrupts_4</name>
        <description>TCPWM #0, Counter #4</description>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>pacss_interrupt</name>
        <description>PACSS consolidated interrupt</description>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>pacss_interrupts_dch_0</name>
        <description>PACSS digital channel #0</description>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>pacss_interrupts_dch_1</name>
        <description>PACSS digital channel #1</description>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>pacss_interrupts_dch_2</name>
        <description>PACSS digital channel #2</description>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>pacss_interrupts_dch_3</name>
        <description>PACSS digital channel #3</description>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>pacss_interrupt_mmio</name>
        <description>PACSS mmio</description>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>crypto_interrupt</name>
        <description>Crypto Interrupt</description>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>exco_interrupt</name>
        <description>EXCO Interrupt</description>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>canfd_interrupts0_0</name>
        <description>Canfd Int 0 for channel 0</description>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>canfd_interrupts1_0</name>
        <description>Canfd Int 1 for channel 0</description>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>lin_interrupts_0</name>
        <description>LIN interrupt, channel #0</description>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>lin_interrupts_1</name>
        <description>LIN interrupt, channel #1</description>
        <value>31</value>
      </interrupt>
      <registers>
        <register>
          <name>CONFIG</name>
          <description>Configuration register</description>
          <addressOffset>0x0</addressOffset>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>VECT_IN_RAM</name>
              <description>0': Vector Table is located at 0x0000:0000 in flash
'1': Vector Table is located at 0x2000:0000 in SRAM
Note that vectors for RESET and FAULT are always fetched from ROM. Value in flash/RAM is ignored for these vectors.</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSREQ</name>
          <description>SYSCALL control register</description>
          <addressOffset>0x4</addressOffset>
          <resetValue>0x30000000</resetValue>
          <resetMask>0xFC00FFFF</resetMask>
          <fields>
            <field>
              <name>SYSCALL_COMMAND</name>
              <description>Opcode of the system call being requested.</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>EXTERNAL_SYS_REQ</name>
              <description>External HW SYS REQ. This bit is set by HW to cause a SYSCALL to BOOTROM.  This bit may only be cleared by SW. When this bit is set, the SYSCALL_COMMAND, PRIVILEDGED, HMASTER0,  and SYSCALL_ARG content are invalid.</description>
              <bitRange>[26:26]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>DIS_RESET_VECT_REL</name>
              <description>Disable Reset Vector fetch relocation:
'0': CPU accesses to locations 0x0000:0000 - 0x0000:0007 are redirected to ROM.
'1': CPU accesses to locations 0x0000:0000 - 0x0000:0007 are made to flash.
Note that this field defaults to '0' on reset, ensuring actual reset vector fetches are always made to ROM. Note that this field does not affect DAP accesses. Flash DfT routines may set this bit to '1' to enable uninhibited read-back of programmed data in the first flash page.</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>PRIVILEGED</name>
              <description>Indicates whether the system is in privileged ('1') or user mode ('0'). Only CPU SW executing from ROM can set this field to '1' when ROM_ACCESS_EN is '1' (the CPU is executing a SystemCall NMI interrupt handler). Any other write to this field sets is to '0'. This field is used as the AHB-Lite hprot[1] signal to implement Infineon proprietary user/privileged modes. These modes are used to enable/disable access to specific MMIO registers and memory regions.</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>ROM_ACCESS_EN</name>
              <description>Indicates that executing from Boot ROM is enabled. HW sets this field to '1', on reset or when the SystemCall NMI vector is fetched from Boot ROM. HW sets this field to '0', when the CPU is NOT executing from either Boot or System ROM. This bit is used for debug purposes only.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HMASTER_0</name>
              <description>Indicates the source of the write access to the SYSREQ register.
'0': CPU write access.
'1': DAP write access.

