Infineon/mtb-pdl-cat2/devices/svd/psoc4hvpaspm10.svd
For a SW write to the SYSREQ register, the HW will update this field based on the value of SYSCALL_REQ.

SYSCALL_REQ = 0 : the current source of write access is captured.
SYSCALL_REQ = 1 : the previous value (captured when SYSCALL_REQ was 0), is retained/maintained until the next SW write to this register.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCALL_REQ</name>
              <description>CPU/DAP writes a '1' to this field to request a SystemCall. The HMASTER_0 field indicates the source of the write access. Setting this field to '1' immediate results in a NMI. The SystemCall NMI interrupt handler sets this field to '0' after servicing the request.</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSARG</name>
          <description>SYSARG control register</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>SYSCALL_ARG</name>
              <description>Argument to System Call specified in SYSREQ. Semantics of argument depends on system call made. Typically a pointer to a parameter block.</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_SEL</name>
          <description>Interrupt multiplexer select register</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>DSI</name>
              <description>Specifies interrupt source:
'0': Fixed Function.
'1': DSI.
When changing the source of a specific interrupt, it is advised to temporarily disable the interrupt using the CM0 NVIC's CLRENA and SETENA interrupt enable clear and set registers to prevent a spurious interrupt activation. In addition, the CM0 NVIC's CLRPEND interrupt pending clear register should be used clear a pending interrupt before re-enabling the interrupt.</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_MODE</name>
          <description>DSI interrupt pulse mode register</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>DSI_INT_PULSE</name>
              <description>Specifies DSI interrupt format:
'0': level sensitive; i.e. no pulse generator.
'1': pulse generator on rising edge.</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NMI_MODE</name>
          <description>DSI NMI pulse mode register</description>
          <addressOffset>0x28</addressOffset>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>DSI_NMI_PULSE</name>
              <description>Specifies DSI NMI format:
'0': level sensitive; i.e. no pulse generator.
'1': pulse generator on rising edge.</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_CTL</name>
          <description>FLASH control register</description>
          <addressOffset>0x30</addressOffset>
          <resetMask>0x0033011F</resetMask>
          <fields>
            <field>
              <name>FLASH_WS</name>
              <description>For Flash With ECC the number of wait states (WS):
WS = 3 for SYSCLK &lt;= FMAX
WS = 2 for SYSCLK &lt;= 3/4 * FMAX
WS = 1 for SYSCLK &lt;= 1/2 * FMAX
WS = 0 for SYSCLK &lt;= 1/4 * FMAX
4-15 : Future Use - To be used, if 3 Wait State is not sufficient.</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>PREF_EN</name>
              <description>N/A</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>FLASH_INVALIDATE</name>
              <description>N/A</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ARB</name>
              <description>N/A</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>FLASH_ECC_INJ_EN</name>
              <description>N/A</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>FLASH_ERR_SILENT</name>
              <description>N/A</description>
              <bitRange>[21:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ROM_CTL</name>
          <description>ROM control register</description>
          <addressOffset>0x34</addressOffset>
          <resetMask>0x00030001</resetMask>
          <fields>
            <field>
              <name>ROM_WS</name>
              <description>Amount of ROM wait states:
'0': 0 wait states. Use this setting for newer, faster ROM design. Use this setting for older, slower ROM design and frequencies in the range [0, 24] MHz.
'1': 1 wait state. Use this setting for older, slower ROM design and frequencies in the range &lt;24, 48] MHz.

Should always be set to 0.</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ARB</name>
              <description>N/A</description>
              <bitRange>[17:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM_CTL</name>
          <description>RAM control register</description>
          <addressOffset>0x38</addressOffset>
          <resetMask>0x00030055</resetMask>
          <fields>
            <field>
              <name>ECC_ENABLE</name>
              <description>Enable ECC operation:
'0': ECC Disabled - ECC is not generated/checked
'1': ECC Enabled - ECC is generated/checked</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ECC_AUTO_CORRECT</name>
              <description>HW ECC autocorrect functionality:
'0': Disabled.
'1': Enabled. HW automatically writes back SRAM with corrected data when a recoverable ECC error is detected.</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ECC_INJ_EN</name>
              <description>Enable error injection.
0:  Syndrome is source from ECC Syndrome hardware.
1: ECC_TEST.SYND_DATA is used when a full 32-bit write is done to the ECC_TEST.WORD_ADDR word address of SRAM0.</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ECC_BIST_SWITCH</name>
              <description>ECC_BIST_SWITCH: Substitutes Syndrome bits for normal data path during BIST testing. Data bits 31:25 on the SRAM data path both to and from the SRAM are replaced with the SRAM Syndrome data bits 38:32 during BIST testing when this bit is set to 1.
'0': Source normal datapath to BIST bus
'1': Source Syndrome bits to BIST bus</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ARB</name>
              <description>Arbitration Policy:
'0': CPU has priority
'1': DW/DMA has priority
'2': Roundrobin
'3': Roundrobin - sticky</description>
              <bitRange>[17:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAC_CTL</name>
          <description>DMA controller register</description>
          <addressOffset>0x3C</addressOffset>
          <resetMask>0x00030000</resetMask>
          <fields>
            <field>
              <name>ARB</name>
              <description>Arbitration policy:
0: CPU has priority
1: DW/DMA has priority
2: Roundrobin
3: Roundrobin - sticky</description>
              <bitRange>[17:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM1_CTL</name>
          <description>RAM 1 control register</description>
          <addressOffset>0xA4</addressOffset>
          <resetMask>0x00030055</resetMask>
          <fields>
            <field>
              <name>ECC_ENABLE</name>
              <description>Enable ECC operation:
'0': ECC Disabled - ECC is not generated/checked
'1': ECC Enabled - ECC is generated/checked</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ECC_AUTO_CORRECT</name>
              <description>HW ECC autocorrect functionality:
'0': Disabled.
'1': Enabled. HW automatically writes back SRAM with corrected data when a recoverable ECC error is detected.</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ECC_INJ_EN</name>
              <description>Enable error injection.
0:  Syndrome is source from ECC Syndrome hardware.
1: ECC_TEST.SYND_DATA is used when a full 32-bit write is done to the ECC_TEST.WORD_ADDR word address of SRAM1.</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ECC_BIST_SWITCH</name>
              <description>ECC_BIST_SWITCH: Substitutes Syndrome bits for normal data path during BIST testing. Data bits 31:25 on the SRAM data path both to and from the SRAM are replaced with the SRAM Syndrome data bits 38:32 during BIST testing when this bit is set to 1.
'0': Source normal datapath to BIST bus
'1': Source Syndrome bits to BIST bus</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ARB</name>
              <description>Arbitration policy:
0: CPU has priority
1: DW/DMA has priority
2: Roundrobin
3: Roundrobin - sticky</description>
              <bitRange>[17:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHC1_CTL</name>
          <description>FLASH Control1  control register</description>
          <addressOffset>0xA8</addressOffset>
          <resetMask>0x0033011F</resetMask>
          <fields>
            <field>
              <name>FLASH_WS</name>
              <description>Amount of ROM wait states:
For Flash (without ECC).
0: 0 wait states (fast flash: [0, 24] MHz system frequency, slow flash: [0, 16] MHz system frequency)
1: 1 wait state (fast flash: [24, 48] MHz system frequency, slow flash: [16, 32] MHz system frequency)
2: 2 wait states (slow flash: [32, 48] MHz system frequency)
3-15 : Future Use.

For Flash With ECC.
0: 0 wait states ([0, 12] MHz system frequency)
1: 1 wait state ([12, 24] MHz system frequency)
2: 2 wait states (24,36] MHz system frequency)
3: 3 wait states ([36,48] MHz System Frequency)
4-15 : Future Use - To be used, if 3 Wait State is not sufficient.</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>PREF_EN</name>
              <description>Prefetch enable:
'0': disabled. This is a desirable setting when FLASH_WS is 0 or when predictable execution behavior is required.
'1': enabled.</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>FLASH_INVALIDATE</name>
              <description>1': Invalidates the content of the flash controller's buffers.</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ARB</name>
              <description>Arbitration policy:
0: CPU has priority
1: DW/DMA has priority
2: Roundrobin
3: Roundrobin - sticky</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>FLASH_ECC_INJ_EN</name>
              <description>Enable error injection for FLASH main interface.
When'1', the parity (ECC_CTL.PARITY[7:0]) is used for a load from the ECC_CTL.WORD_ADDR[23:0] word address.</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>FLASH_ERR_SILENT</name>
              <description>Specifies bus transfer behavior for a non-recoverable error on the FLASH macro main interface (either a non-correctable ECC error, a FLASH macro main interface internal error, a FLASH macro main interface memory hole access, a M0S8 protection violation error):
0: Bus transfer has a bus error.
1: Bus transfer does NOT have a bus error; i.e. the error is 'silent'

In either case, a Zero value is returned. 

This field is ONLY used by CPU bus transfers. Non-CPU bus transfers always have a bus transfer with a bus error, in case of a non-recoverable error</description>
              <bitRange>[21:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FAULT_CTL</name>
          <description>Fault Control Register</description>
          <addressOffset>0xAC</addressOffset>
          <resetMask>0x00030000</resetMask>
          <fields>
            <field>
              <name>ARB</name>
              <description>Arbitration policy:
0: CPU has priority
1: DW/DMA has priority
2: Roundrobin
3: Roundrobin - sticky</description>
              <bitRange>[17:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MTB_CTL</name>
          <description>MTB control register</description>
          <addressOffset>0xB0</addressOffset>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>CPU_HALT_TSTOP_EN</name>
              <description>1': Enable CPU Halt to stop MTB trace. (HALTED output of CM0+ can stop the trace when high/'1')
'0': HALTED output of CM0+ can not strop trace.</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DAP_CTL</name>
          <description>SWD DP Instance ID</description>
          <addressOffset>0xC4</addressOffset>
          <access>read-only</access>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>INSTANCE_ID</name>
              <description>Specifies the SWD DP Instance ID
This is used with the SWD Multi-Drop feature to uniquely identify a chip.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM_STATUS</name>
          <description>RAM Controller 0 Status</description>
          <addressOffset>0xD0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>WB_EMPTY</name>
              <description>Write buffer empty. This information is used when entering DeepSleep power mode: WB_EMPTY must be '1' before a transition to system DeepSleep power mode.
'0': Write buffer NOT empty.
'1': Write buffer empty.

Note: the SRAM controller write buffer is only used when ECC checking is enabled. (RAMi_CTL.ECC_EN is '1').</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM1_STATUS</name>
          <description>RAM Controller 1 Status</description>
          <addressOffset>0xD4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>WB_EMPTY</name>
              <description>Write buffer empty. This information is used when entering DeepSleep power mode: WB_EMPTY must be '1' before a transition to system DeepSleep power mode.
'0': Write buffer NOT empty.
'1': Write buffer empty.

Note: the SRAM controller write buffer is only used when ECC checking is enabled. (RAMi_CTL.ECC_EN is '1').</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOT_RESULT_0</name>
          <description>Boot Result Register 0</description>
          <addressOffset>0xE0</addressOffset>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>BOOT_RESULT</name>
              <description>Record details of Boot Process.</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOT_RESULT_1</name>
          <description>Boot Result Register 1</description>
          <addressOffset>0xE4</addressOffset>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>BOOT_RESULT</name>
              <description>Record details of Boot Process.</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <dim>24</dim>
          <dimIncrement>4</dimIncrement>
          <name>SL_CTL[%s]</name>
          <description>Slave control register</description>
          <addressOffset>0x100</addressOffset>
          <resetMask>0x00030000</resetMask>
          <fields>
            <field>
              <name>ARB</name>
              <description>Arbitration policy:
0: CPU priority
1: DMA priority
2: Roundrobin
3: Roundrobin - sticky</description>
              <bitRange>[17:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM_ECC_STATUS0</name>
          <description>RAM ECC Status 0</description>
          <addressOffset>0x200</addressOffset>
          <resetMask>0x80000000</resetMask>
          <fields>
            <field>
              <name>ECC_CAPTURE_ADDR_31_2</name>
              <description>Snapshot of CPUSS Address which caused the first correctable/un-correctable error interrupt. When first correctable/un-correctable error interrupt is generated, ECC_CAPTURE_ADDR_SYNDROME_VALID is transitioned from 0 to 1 , and this registered captures the first error address. The register only captures bits 31-2 of the address.</description>
              <bitRange>[29:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ECC_CAPTURE_ADDR_SYNDROME_VALID</name>
              <description>ECC Capture address and Syndrome valid.  
0: ECC_CAPTURE_ADDR_31_2 not valid
1: ECC_CAPTURE_ADDR_31_2 valid - SW writes a 1 to clear</description>
              <bitRange>[31:31]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM_ECC_STATUS1</name>
          <description>RAM ECC Status 1</description>
          <addressOffset>0x204</addressOffset>
          <access>read-only</access>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ECC_CAPTURE_SYNDROME</name>
              <description>Snapshot of CPUSS Syndrome which caused the first correctable/un-correctable error interrupt. When first correctable/un-correctable error interrupt is generated, ECC_CAPTURE_ADDR_SYNDROME_VALID is transitioned from 0 to 1 , and this registered captures the first Syndrome corresponding to the Error.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM1_ECC_STATUS0</name>
          <description>RAM1 ECC Status 0</description>
          <addressOffset>0x208</addressOffset>
          <resetMask>0x80000000</resetMask>
          <fields>
            <field>
              <name>ECC_CAPTURE_ADDR_31_2</name>
              <description>Snapshot of CPUSS Address which caused the first correctable/un-correctable error interrupt. When first correctable/un-correctable error interrupt is generated, ECC_CAPTURE_ADDR_SYNDROME_VALID is transitioned from 0 to 1 , and this registered captures the first error address. The register only captures bits 31-2 of the address.</description>
              <bitRange>[29:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ECC_CAPTURE_ADDR_SYNDROME_VALID</name>
              <description>ECC Capture address and Syndrome valid.  
0: ECC_CAPTURE_ADDR_31_2 not valid
1: ECC_CAPTURE_ADDR_31_2 valid - SW writes a 1 to clear</description>
              <bitRange>[31:31]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM1_ECC_STATUS1</name>
          <description>RAM1 ECC Status 1</description>
          <addressOffset>0x20C</addressOffset>
          <access>read-only</access>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ECC_CAPTURE_SYNDROME</name>
              <description>Snapshot of CPUSS Syndrome which caused the first correctable/un-correctable error interrupt. When first correctable/un-correctable error interrupt is generated, ECC_CAPTURE_ADDR_SYNDROME_VALID is transitioned from 0 to 1 , and this registered captures the first Syndrome corresponding to the Error.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_TEST</name>
          <description>ECC Test</description>
          <addressOffset>0x210</addressOffset>
          <fields>
            <field>
              <name>WORD_ADDR</name>
              <description>Specifies the word address where an error will be injected.
- For SRAMs, the word address WORD_ADDR[24:0] is the device address A[26:2]. On a write transfer to this SRAM address and when the corresponding RAM_CTL.ECC_INJ_EN or RAM1_CTL.ECC_INJ_EN bit is '1', the parity (SYND_DATA[6:0]) is injected into the corresponding SRAM location.</description>
              <bitRange>[24:0]</bitRange>
            </field>
            <field>
              <name>SYND_DATA</name>
              <description>ECC syndrome to use for error injection at address WORD_ADDR.</description>
              <bitRange>[31:25]</bitRange>
            </field>
          </fields>
        </register>
