Infineon/mtb-pdl-cat2/devices/svd/psoc4hvpaspm10.svd
Hardware inverts the field value on the completion of a descriptor structure when CONTROL.FLIPPING of the current descriptor structure is set to '1'.</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>ENABLED</name>
              <description>'0': channel disabled. The channel's trigger is ignored and the channel cannot be activated. If the activated channel is disabled, the data transfer(s) are aborted. 
'1': channel enabled.

Software sets this field to '1' to enable a specific channel.

Hardware sets this field to '0' on erroneous channel behavior (the specific error is specified by STATUS.RESP in the channel's descriptor structure).</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR</name>
          <description>Interrupt register</description>
          <addressOffset>0x7F0</addressOffset>
          <fields>
            <field>
              <name>CH</name>
              <description>Set to '1', when event is detected. Write INTR field with '1', to clear bit. Write INTR_SET field with '1', to set bit.</description>
              <bitRange>[31:0]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_SET</name>
          <description>Interrupt set register</description>
          <addressOffset>0x7F4</addressOffset>
          <fields>
            <field>
              <name>CH</name>
              <description>Write INTR_SET field with '1' to set corresponding INTR field (a write of '0' has no effect).</description>
              <bitRange>[31:0]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_MASK</name>
          <description>Interrupt mask register</description>
          <addressOffset>0x7F8</addressOffset>
          <fields>
            <field>
              <name>CH</name>
              <description>Mask for corresponding field in INTR register.</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_MASKED</name>
          <description>Interrupt masked register</description>
          <addressOffset>0x7FC</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>CH</name>
              <description>Logical BITWISE AND of corresponding request and mask fields.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>16</dim>
          <dimIncrement>32</dimIncrement>
          <name>DESCR[%s]</name>
          <description>Descriptors</description>
          <addressOffset>0x800</addressOffset>
          <register>
            <name>PING_SRC</name>
            <description>Ping source address</description>
            <addressOffset>0x0</addressOffset>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>ADDR</name>
                <description>Base address of source location. The effective source location is calculated by adding on offset (derived from PING.STATUS.CURR_DATA_NR) to this base address.</description>
                <bitRange>[31:0]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>PING_DST</name>
            <description>Ping destination address</description>
            <addressOffset>0x4</addressOffset>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>ADDR</name>
                <description>Base address of destination location. The effective destination location is calculated by adding on offset (derived from PING.STATUS.CURR_DATA_NR) to this base address.</description>
                <bitRange>[31:0]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>PING_CTL</name>
            <description>Ping control word</description>
            <addressOffset>0x8</addressOffset>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA_NR</name>
                <description>Number of data elements that are transferred by a single descriptor.
In DW mode (OPCODE is '0') each trigger initiates the transfer of a single data element. This field specifies the source and/or destination buffer size in data elements: buffer size = DATA_NR+1. The buffer is typically associated to a memory structure.
In DMA mode (OPCODE is '1' or '2') each trigger initiates the transfer of DATA_NR+1 data elements.</description>
                <bitRange>[15:0]</bitRange>
              </field>
              <field>
                <name>DATA_SIZE</name>
                <description>Specifies the data element size:
'0': Byte (8 bits).
'1': Halfword (16 bits).
'2': Word (32 bits).
DATA_SIZE, SRC_TRANSFER_SIZE and DST_TRANSFER_SIZE together determine how data elements are transferred. The following are the 9 legal settings:
- DATA is 8 bit, SRC is 8 bit, DST is 8 bit
- DATA is 8 bit, SRC is 32 bit (higher 24 bits are dropped), DST is 8 bit
- DATA is 8 bit, SRC is 8 bit, DST is 32 bit (higher 24 bits are made '0')
- DATA is 8 bit, SRC is 32 bit (higher 24 bits are dropped), DST is 32 bit (higher 24 bits are made '0')
- DATA is 16 bit, SRC is 16 bit, DST is 16 bit
- DATA is 16 bit, SRC is 32 bit (higher 16 bits are dropped), DST is 16 bit
- DATA is 16 bit, SRC is 16 bit, DST is 32 bit (higher 16 bits are made '0')
- DATA is 16 bit, SRC is 32 bit (higher 16 bits are dropped), DST is 32 bit (higher 16 bits are made '0')
- DATA is 32 bit, SRC is 32 bit, DST is 32 bit</description>
                <bitRange>[17:16]</bitRange>
              </field>
              <field>
                <name>DST_TRANSFER_SIZE</name>
                <description>Specifies the bus transfer size to the destination location:
'0': As specified by DATA_SIZE.
'1': Word (32 bits).
Distinguishing bus transfer size from data element size allows for destination components with data elements that are smaller than their 32-bit bus interface width. E.g., a DAC destination has a 32-bit bus transfer size, but only requires a 16-bit data element.</description>
                <bitRange>[20:20]</bitRange>
              </field>
              <field>
                <name>DST_ADDR_INCR</name>
                <description>Specifies whether the destination location address is incremented by the DST_TRANSFER_SIZE after each single data element transfer or not.
'0' : No increment, typically used for transmit (TX) FIFO structures.
'1': Increment, typically used for memory structures.</description>
                <bitRange>[21:21]</bitRange>
              </field>
              <field>
                <name>SRC_TRANSFER_SIZE</name>
                <description>Specifies the bus transfer size to the source location:
'0': As specified by DATA_SIZE.
'1': Word (32 bits).
Distinguishing bus transfer size from data element size allows for source components with data elements that are smaller than their 32-bit bus interface width. E.g., an ADC source has a 32-bit bus transfer size, but only provides a 16-bit data element.</description>
                <bitRange>[22:22]</bitRange>
              </field>
              <field>
                <name>SRC_ADDR_INCR</name>
                <description>Specifies whether the source location address is incremented by the SRC_TRANSFER_SIZE after each single data element transfer or not.
'0': No increment, typically used for receive (RX) FIFO structures.
'1': Increment, typically used for memory structures.</description>
                <bitRange>[23:23]</bitRange>
              </field>
              <field>
                <name>WAIT_FOR_DEACT</name>
                <description>Specifies whether the data transfer engine should wait for the channel to be deactivated; i.e. the selected system trigger is not active. This field is used to synchronize the controller's data transfer(s) with the agent that generated the trigger. This field is ONLY used at the completion of an opcode. E.g., a FIFO indicates that it is empty and it needs a new data sample. The agent removes the trigger ONLY when the data sample has been written by the transfer engine AND received by the agent.  Furthermore, the agent's trigger may be delayed by a few cycles before it reaches the DW/DMA controller. This field is used for level sensitive trigger, which reflect state (pulse sensitive triggers should have this field set to '0'). The wait cycles incurred by this field reduce DW/DMA controller performance.
'0': Do not wait for de-activation (for pulse sensitive triggers).
'1': Wait for up to 4 cycles.
'2': Wait for up to 8 cycles.
'3': Wait indefinitely. This option may result in DW/DMA controller lockup if the system trigger is not de-activated by the source agent.</description>
                <bitRange>[25:24]</bitRange>
              </field>
              <field>
                <name>INV_DESCR</name>
                <description>'1': On completion of the current descriptor structure, the VALID bit of the descriptor's STATUS word is set to '0'.</description>
                <bitRange>[26:26]</bitRange>
              </field>
              <field>
                <name>SET_CAUSE</name>
                <description>'1': On completion of the current descriptor structure, the interrupt cause field of the channel is set to '1' (INTR.CH[i]).</description>
                <bitRange>[27:27]</bitRange>
              </field>
              <field>
                <name>PREEMPTABLE</name>
                <description>'1': Transfer is preemptable. In DMA mode (OPCODE is '1' or '2'), multi data element transfers are constructed out of multiple single data element load (from the source location) and store (to the destination location) sequences. This field allows higher priority activated channels to preempt the current transfer in between these atomic (load, store) sequences. Preemption will NOT deactivate the current channel. As a result, after completion of a higher priority activated channel, the current channel is rescheduled.</description>
                <bitRange>[28:28]</bitRange>
              </field>
              <field>
                <name>FLIPPING</name>
                <description>'1': On completion of the current descriptor structure, the current descriptor identifier CH_CTLi.PING_PONG is flipped/inverted. In DMA mode, descriptor list transfer, flipping of the current descriptor identifier can be used to construct a linked list of descriptor structures.</description>
                <bitRange>[29:29]</bitRange>
              </field>
              <field>
                <name>OPCODE</name>
                <description>Specifies the specific data transfer (only when the VALID bit of the descriptor's STATUS word is '1'):

'0': A single trigger initiates a single data element transfer (DW mode). This opcode specifies a transfer of a single data element. The current descriptor is completed when the amount of transferred single data elements equals the programmed buffer size (DATA_NR+1).

