Infineon/mtb-pdl-cat2/devices/svd/psoc4hvpaspm10.svd
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[0:0]</bitRange>
                </field>
                <field>
                  <name>RF0WE</name>
                  <description>Rx FIFO 0 Watermark Reached Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[1:1]</bitRange>
                </field>
                <field>
                  <name>RF0FE</name>
                  <description>Rx FIFO 0 Full Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[2:2]</bitRange>
                </field>
                <field>
                  <name>RF0LE</name>
                  <description>Rx FIFO 0 Message Lost Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[3:3]</bitRange>
                </field>
                <field>
                  <name>RF1NE</name>
                  <description>Rx FIFO 1 New Message Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[4:4]</bitRange>
                </field>
                <field>
                  <name>RF1WE</name>
                  <description>Rx FIFO 1 Watermark Reached Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[5:5]</bitRange>
                </field>
                <field>
                  <name>RF1FE</name>
                  <description>Rx FIFO 1 Full Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[6:6]</bitRange>
                </field>
                <field>
                  <name>RF1LE</name>
                  <description>Rx FIFO 1 Message Lost Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[7:7]</bitRange>
                </field>
                <field>
                  <name>HPME</name>
                  <description>High Priority Message Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[8:8]</bitRange>
                </field>
                <field>
                  <name>TCE</name>
                  <description>Transmission Completed Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[9:9]</bitRange>
                </field>
                <field>
                  <name>TCFE</name>
                  <description>Transmission Cancellation Finished Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[10:10]</bitRange>
                </field>
                <field>
                  <name>TFEE</name>
                  <description>Tx FIFO Empty Interrupt Enable
0= Interrupt Disabled
1= Interrupt EnabledTx FIFO Empty Interrupt Enable</description>
                  <bitRange>[11:11]</bitRange>
                </field>
                <field>
                  <name>TEFNE</name>
                  <description>Tx Event FIDO New Entry Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[12:12]</bitRange>
                </field>
                <field>
                  <name>TEFWE</name>
                  <description>Tx Event FIFO Watermark Reached Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[13:13]</bitRange>
                </field>
                <field>
                  <name>TEFFE</name>
                  <description>Tx Event FIFO Full Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[14:14]</bitRange>
                </field>
                <field>
                  <name>TEFLE</name>
                  <description>Tx Event FIFO Event Lost Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[15:15]</bitRange>
                </field>
                <field>
                  <name>TSWE</name>
                  <description>Timestamp Wraparound Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[16:16]</bitRange>
                </field>
                <field>
                  <name>MRAFE</name>
                  <description>Message RAM Access Failure Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[17:17]</bitRange>
                </field>
                <field>
                  <name>TOOE</name>
                  <description>Timeout Occurred Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[18:18]</bitRange>
                </field>
                <field>
                  <name>DRXE</name>
                  <description>Message stored to Dedicated Rx Buffer Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[19:19]</bitRange>
                </field>
                <field>
                  <name>BECE</name>
                  <description>Bit Error Corrected Interrupt Enable (not used in M_TTCAN)
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[20:20]</bitRange>
                </field>
                <field>
                  <name>BEUE</name>
                  <description>Bit Error Uncorrected Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[21:21]</bitRange>
                </field>
                <field>
                  <name>ELOE</name>
                  <description>Error Logging Overflow Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[22:22]</bitRange>
                </field>
                <field>
                  <name>EPE</name>
                  <description>Error Passive Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[23:23]</bitRange>
                </field>
                <field>
                  <name>EWE</name>
                  <description>Warning Status Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[24:24]</bitRange>
                </field>
                <field>
                  <name>BOE</name>
                  <description>Bus_Off Status Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[25:25]</bitRange>
                </field>
                <field>
                  <name>WDIE</name>
                  <description>Watchdog Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[26:26]</bitRange>
                </field>
                <field>
                  <name>PEAE</name>
                  <description>Protocol Error in Arbitration Phase Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[27:27]</bitRange>
                </field>
                <field>
                  <name>PEDE</name>
                  <description>Protocol Error in Data Phase Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[28:28]</bitRange>
                </field>
                <field>
                  <name>ARAE</name>
                  <description>N/A</description>
                  <bitRange>[29:29]</bitRange>
                </field>
              </fields>
            </register>
            <register>
              <name>ILS</name>
              <description>Interrupt Line Select</description>
              <addressOffset>0x58</addressOffset>
              <resetMask>0x3FFFFFFF</resetMask>
              <fields>
                <field>
                  <name>RF0NL</name>
                  <description>Rx FIFO 0 New Message Interrupt Select
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[0:0]</bitRange>
                </field>
                <field>
                  <name>RF0WL</name>
                  <description>Rx FIFO 0 Watermark Reached Interrupt Select 
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[1:1]</bitRange>
                </field>
                <field>
                  <name>RF0FL</name>
                  <description>Rx FIFO 0 Full Interrupt Select 
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[2:2]</bitRange>
                </field>
                <field>
                  <name>RF0LL</name>
                  <description>Rx FIFO 0 Message Lost Interrupt Select 
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[3:3]</bitRange>
                </field>
                <field>
                  <name>RF1NL</name>
                  <description>Rx FIFO 1 New Message Interrupt Select 
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[4:4]</bitRange>
                </field>
                <field>
                  <name>RF1WL</name>
                  <description>Rx FIFO 1 Watermark Reached Interrupt Select 
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[5:5]</bitRange>
                </field>
                <field>
                  <name>RF1FL</name>
                  <description>Rx FIFO 1 Full Interrupt Select 
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[6:6]</bitRange>
                </field>
                <field>
                  <name>RF1LL</name>
                  <description>Rx FIFO 1 Message Lost Interrupt Select 
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[7:7]</bitRange>
                </field>
                <field>
                  <name>HPML</name>
                  <description>High Priority Message Interrupt Select 
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[8:8]</bitRange>
                </field>
                <field>
                  <name>TCL</name>
                  <description>Transmission Completed Interrupt Select 
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[9:9]</bitRange>
                </field>
                <field>
                  <name>TCFL</name>
                  <description>Transmission Cancellation Finished Interrupt Select 
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[10:10]</bitRange>
                </field>
                <field>
                  <name>TFEL</name>
                  <description>Tx FIFO Empty Interrupt Select 
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[11:11]</bitRange>
                </field>
                <field>
                  <name>TEFNL</name>
                  <description>Tx Event FIFO New Entry Interrupt Select 
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[12:12]</bitRange>
                </field>
                <field>
                  <name>TEFWL</name>
                  <description>Tx Event FIFO Watermark Reached Interrupt Select 
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[13:13]</bitRange>
                </field>
                <field>
                  <name>TEFFL</name>
                  <description>Tx Event FIFO Full Interrupt Select 
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[14:14]</bitRange>
                </field>
                <field>
                  <name>TEFLL</name>
                  <description>Tx Event FIFO Event Lost Interrupt Select 
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[15:15]</bitRange>
                </field>
                <field>
                  <name>TSWL</name>
                  <description>Timestamp Wraparound Interrupt Select 
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[16:16]</bitRange>
                </field>
                <field>
                  <name>MRAFL</name>
                  <description>Message RAM Access Failure Interrupt Select  
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[17:17]</bitRange>
                </field>
                <field>
                  <name>TOOL</name>
                  <description>Timeout Occurred Interrupt Select 
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[18:18]</bitRange>
                </field>
                <field>
                  <name>DRXL</name>
                  <description>Message stored to Dedicated Rx Buffer Interrupt Select 
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[19:19]</bitRange>
                </field>
                <field>
                  <name>BECL</name>
                  <description>Bit Error Corrected Interrupt Select  (not used in M_TTCAN) 
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[20:20]</bitRange>
                </field>
                <field>
                  <name>BEUL</name>
                  <description>Bit Error Uncorrected Interrupt Select 
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[21:21]</bitRange>
                </field>
                <field>
                  <name>ELOL</name>
                  <description>Error Logging Overflow Interrupt Select 
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[22:22]</bitRange>
                </field>
                <field>
                  <name>EPL</name>
                  <description>Error Passive Interrupt Select 
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[23:23]</bitRange>
                </field>
                <field>
                  <name>EWL</name>
                  <description>Warning Status Interrupt Select 
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[24:24]</bitRange>
                </field>
                <field>
                  <name>BOL</name>
                  <description>Bus_Off Status Interrupt Select 
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[25:25]</bitRange>
                </field>
                <field>
                  <name>WDIL</name>
                  <description>Watchdog Interrupt Select 
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[26:26]</bitRange>
                </field>
                <field>
                  <name>PEAL</name>
                  <description>Protocol Error in Arbitration Phase Select 
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[27:27]</bitRange>
                </field>
                <field>
                  <name>PEDL</name>
                  <description>Protocol Error in Data Phase Select 
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[28:28]</bitRange>
                </field>
                <field>
                  <name>ARAL</name>
                  <description>N/A</description>
                  <bitRange>[29:29]</bitRange>
                </field>
              </fields>
            </register>
            <register>
              <name>ILE</name>
              <description>Interrupt Line Enable</description>
              <addressOffset>0x5C</addressOffset>
              <resetMask>0x00000003</resetMask>
              <fields>
                <field>
                  <name>EINT0</name>
                  <description>Enable Interrupt Line 0
0= Interrupt line m_ttcan_int0 disabled
1= Interrupt line m_ttcan_int0 enabled</description>
                  <bitRange>[0:0]</bitRange>
                </field>
                <field>
                  <name>EINT1</name>
                  <description>Enable Interrupt Line 1
0= Interrupt line m_ttcan_int1 disabled
1= Interrupt line m_ttcan_int1 enabled</description>
                  <bitRange>[1:1]</bitRange>
                </field>
              </fields>
            </register>
            <register>
              <name>GFC</name>
              <description>Global Filter Configuration</description>
              <addressOffset>0x80</addressOffset>
              <resetMask>0x0000003F</resetMask>
              <fields>
                <field>
                  <name>RRFE</name>
                  <description>Reject Remote Frames Extended
0= Filter remote frames with 29-bit extended IDs
1= Reject all remote frames with 29-bit extended IDs</description>
                  <bitRange>[0:0]</bitRange>
                </field>
                <field>
                  <name>RRFS</name>
                  <description>Reject Remote Frames Standard
0= Filter remote frames with 11-bit standard IDs
1= Reject all remote frames with 11-bit standard IDs</description>
                  <bitRange>[1:1]</bitRange>
                </field>
                <field>
                  <name>ANFE</name>
                  <description>Accept Non-matching Frames Extended
Defines how received messages with 29-bit IDs that do not match any element of the filter list are
treated.
00= Accept in Rx FIFO 0
01= Accept in Rx FIFO 1
10= Reject
11= Reject</description>
                  <bitRange>[3:2]</bitRange>
                </field>
                <field>
                  <name>ANFS</name>
                  <description>Accept Non-matching Frames Standard
Defines how received messages with 11-bit IDs that do not match any element of the filter list are
treated.
00= Accept in Rx FIFO 0
01= Accept in Rx FIFO 1
10= Reject
11= Reject</description>
                  <bitRange>[5:4]</bitRange>
                </field>
              </fields>
            </register>
            <register>
              <name>SIDFC</name>
              <description>Standard ID Filter Configuration</description>
              <addressOffset>0x84</addressOffset>
              <resetMask>0x00FFFFFC</resetMask>
              <fields>
                <field>
                  <name>FLSSA</name>
                  <description>Filter List Standard Start Address
Start address of standard Message ID filter list (32-bit word address, see Figure 2).</description>
                  <bitRange>[15:2]</bitRange>
                </field>
                <field>
                  <name>LSS</name>
                  <description>List Size Standard
0= No standard Message ID filter
1-128= Number of standard Message ID filter elements
128= Values greater than 128 are interpreted as 128</description>
                  <bitRange>[23:16]</bitRange>
                </field>
              </fields>
            </register>
            <register>
              <name>XIDFC</name>
              <description>Extended ID Filter Configuration</description>
              <addressOffset>0x88</addressOffset>
              <resetMask>0x007FFFFC</resetMask>
              <fields>
                <field>
                  <name>FLESA</name>
                  <description>Filter List Extended Start Address
Start address of extended Message ID filter list (32-bit word address, see Figure 2).</description>
                  <bitRange>[15:2]</bitRange>
                </field>
                <field>
                  <name>LSE</name>
                  <description>List Size Extended
0= No extended Message ID filter
1-64= Number of extended Message ID filter elements
64= Values greater than 64 are interpreted as 64</description>
                  <bitRange>[22:16]</bitRange>
                </field>
              </fields>
            </register>
            <register>
              <name>XIDAM</name>
              <description>Extended ID AND Mask</description>
              <addressOffset>0x90</addressOffset>
              <resetMask>0x1FFFFFFF</resetMask>
              <fields>
                <field>
                  <name>EIDM</name>
                  <description>Extended ID Mask
For acceptance filtering of extended frames the Extended ID AND Mask is ANDed with the Message
ID of a received frame. Intended for masking of 29-bit IDs in SAE J1939. With the reset value of all
bits set to one the mask is not active.</description>
                  <bitRange>[28:0]</bitRange>
                </field>
              </fields>
            </register>
            <register>
              <name>HPMS</name>
              <description>High Priority Message Status</description>
              <addressOffset>0x94</addressOffset>
              <access>read-only</access>
              <resetMask>0x0000FFFF</resetMask>
              <fields>
                <field>
                  <name>BIDX</name>
                  <description>Buffer Index
Index of Rx FIFO element to which the message was stored. Only valid when MSI[1] = '1'.</description>
                  <bitRange>[5:0]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>MSI</name>
                  <description>Message Storage Indicator
00= No FIFO selected
01= FIFO message lost
10= Message stored in FIFO 0
11= Message stored in FIFO 1</description>
                  <bitRange>[7:6]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>FIDX</name>
                  <description>Filter Index
Index of matching filter element. Range is 0 to SIDFC.LSS - 1 resp. XIDFC.LSE - 1.</description>
                  <bitRange>[14:8]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>FLST</name>
                  <description>Filter List
Indicates the filter list of the matching filter element.
0= Standard Filter List
1= Extended Filter List</description>
                  <bitRange>[15:15]</bitRange>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
