Infineon/mtb-pdl-cat2/devices/svd/psoc4hvpaspm10.svd
            <register>
              <name>TTIR</name>
              <description>TT Interrupt Register</description>
              <addressOffset>0x120</addressOffset>
              <resetMask>0x0007FFFF</resetMask>
              <fields>
                <field>
                  <name>SBC</name>
                  <description>Start of Basic Cycle
0= No Basic Cycle started since bit has been reset
1= Basic Cycle started</description>
                  <bitRange>[0:0]</bitRange>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                </field>
                <field>
                  <name>SMC</name>
                  <description>Start of Matrix Cycle
0= No Matrix Cycle started since bit has been reset
1= Matrix Cycle started</description>
                  <bitRange>[1:1]</bitRange>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                </field>
                <field>
                  <name>CSM_</name>
                  <description>Change of Synchronization Mode
0= No change in master to slave relation or schedule synchronization
1= Master to slave relation or schedule synchronization changed,
also set when TTOST.SPL is reset</description>
                  <bitRange>[2:2]</bitRange>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                </field>
                <field>
                  <name>SOG</name>
                  <description>Start of Gap
0= No reference message seen with Next_is_Gap bit set
1= Reference message with Next_is_Gap bit set becomes valid</description>
                  <bitRange>[3:3]</bitRange>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                </field>
                <field>
                  <name>RTMI</name>
                  <description>Register Time Mark Interrupt
Set when time referenced by TTOCN.TMC (cycle, local, or global) equals TTTMK.TM, independent
of the synchronization state.
0= Time mark not reached
1= Time mark reached</description>
                  <bitRange>[4:4]</bitRange>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                </field>
                <field>
                  <name>TTMI</name>
                  <description>Trigger Time Mark Event Internal
Internal time mark events are configured by trigger memory element TMIN (see Section 2.4.7). Set
when the trigger memory element becomes active, and the M_TTCAN is in synchronization state
In_Gap or In_Schedule.
0= Time mark not reached
1= Time mark reached (Level 0: cycle time TTOCF.IRTO * 0x200)</description>
                  <bitRange>[5:5]</bitRange>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                </field>
                <field>
                  <name>SWE</name>
                  <description>Stop Watch Event
0= No rising/falling edge at stop watch trigger pin m_ttcan_swt detected
1= Rising/falling edge at stop watch trigger pin m_ttcan_swt detected</description>
                  <bitRange>[6:6]</bitRange>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                </field>
                <field>
                  <name>GTW</name>
                  <description>Global Time Wrap
0= No global time wrap occurred
1= Global time wrap from 0xFFFF to 0x0000 occurred</description>
                  <bitRange>[7:7]</bitRange>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                </field>
                <field>
                  <name>GTD</name>
                  <description>Global Time Discontinuity
0= No discontinuity of global time
1= Discontinuity of global time</description>
                  <bitRange>[8:8]</bitRange>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                </field>
                <field>
                  <name>GTE</name>
                  <description>Global Time Error
Synchronization deviation SD exceeds limit specified by TTOCF.LDSDL, TTCAN Level 0,2 only.
0= Synchronization deviation within limit
1= Synchronization deviation exceeded limit</description>
                  <bitRange>[9:9]</bitRange>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                </field>
                <field>
                  <name>TXU</name>
                  <description>Tx Count Underflow
0= Number of Tx Trigger as expected
1= Less Tx trigger than expected in one matrix cycle</description>
                  <bitRange>[10:10]</bitRange>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                </field>
                <field>
                  <name>TXO</name>
                  <description>Tx Count Overflow
0= Number of Tx Trigger as expected
1= More Tx trigger than expected in one matrix cycle</description>
                  <bitRange>[11:11]</bitRange>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                </field>
                <field>
                  <name>SE1</name>
                  <description>Scheduling Error 1
0= No scheduling error 1
1= Scheduling error 1 occurred</description>
                  <bitRange>[12:12]</bitRange>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                </field>
                <field>
                  <name>SE2</name>
                  <description>Scheduling Error 2
0= No scheduling error 2
1= Scheduling error 2 occurred</description>
                  <bitRange>[13:13]</bitRange>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                </field>
                <field>
                  <name>ELC</name>
                  <description>Error Level Changed
Not set when error level changed during initialization.
0= No change in error level
1= Error level changed</description>
                  <bitRange>[14:14]</bitRange>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                </field>
                <field>
                  <name>IWT</name>
                  <description>Initialization Watch Trigger
The initialization is restarted by resetting IWT.
0= No missing reference message during system startup
1= No system startup due to missing reference message</description>
                  <bitRange>[15:15]</bitRange>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                </field>
                <field>
                  <name>WT</name>
                  <description>Watch Trigger
0= No missing reference message
1= Missing reference message (Level 0: cycle time 0xFF00)</description>
                  <bitRange>[16:16]</bitRange>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                </field>
                <field>
                  <name>AW</name>
                  <description>Application Watchdog
0= Application watchdog served in time
1= Application watchdog not served in time</description>
                  <bitRange>[17:17]</bitRange>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                </field>
                <field>
                  <name>CER</name>
                  <description>Configuration Error
Trigger out of order.
0= No error found in trigger list
1= Error found in trigger list</description>
                  <bitRange>[18:18]</bitRange>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                </field>
              </fields>
            </register>
            <register>
              <name>TTIE</name>
              <description>TT Interrupt Enable</description>
              <addressOffset>0x124</addressOffset>
              <resetMask>0x0007FFFF</resetMask>
              <fields>
                <field>
                  <name>SBCE</name>
                  <description>Start of Basic Cycle Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[0:0]</bitRange>
                </field>
                <field>
                  <name>SMCE</name>
                  <description>Start of Matrix Cycle Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[1:1]</bitRange>
                </field>
                <field>
                  <name>CSME</name>
                  <description>Change of Synchronization Mode Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[2:2]</bitRange>
                </field>
                <field>
                  <name>SOGE</name>
                  <description>Start of Gap Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[3:3]</bitRange>
                </field>
                <field>
                  <name>RTMIE</name>
                  <description>Register Time Mark Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[4:4]</bitRange>
                </field>
                <field>
                  <name>TTMIE</name>
                  <description>Trigger Time Mark Event Internal Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[5:5]</bitRange>
                </field>
                <field>
                  <name>SWEE</name>
                  <description>Stop Watch Event Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[6:6]</bitRange>
                </field>
                <field>
                  <name>GTWE</name>
                  <description>Global Time Wrap Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[7:7]</bitRange>
                </field>
                <field>
                  <name>GTDE</name>
                  <description>Global Time Discontinuity Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[8:8]</bitRange>
                </field>
                <field>
                  <name>GTEE</name>
                  <description>Global Time Error Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[9:9]</bitRange>
                </field>
                <field>
                  <name>TXUE</name>
                  <description>Tx Count Underflow Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[10:10]</bitRange>
                </field>
                <field>
                  <name>TXOE</name>
                  <description>Tx Count Overflow Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[11:11]</bitRange>
                </field>
                <field>
                  <name>SE1E</name>
                  <description>Scheduling Error 1 Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[12:12]</bitRange>
                </field>
                <field>
                  <name>SE2E</name>
                  <description>Scheduling Error 2 Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[13:13]</bitRange>
                </field>
                <field>
                  <name>ELCE</name>
                  <description>Change Error Level Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[14:14]</bitRange>
                </field>
                <field>
                  <name>IWTE</name>
                  <description>Initialization Watch Trigger Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[15:15]</bitRange>
                </field>
                <field>
                  <name>WTE</name>
                  <description>Watch Trigger Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[16:16]</bitRange>
                </field>
                <field>
                  <name>AWE_</name>
                  <description>Application Watchdog Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[17:17]</bitRange>
                </field>
                <field>
                  <name>CERE</name>
                  <description>Configuration Error Interrupt Enable
0= Interrupt Disabled
1= Interrupt Enabled</description>
                  <bitRange>[18:18]</bitRange>
                </field>
              </fields>
            </register>
            <register>
              <name>TTILS</name>
              <description>TT Interrupt Line Select</description>
              <addressOffset>0x128</addressOffset>
              <resetMask>0x0007FFFF</resetMask>
              <fields>
                <field>
                  <name>SBCL</name>
                  <description>Start of Basic Cycle Interrupt Select
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[0:0]</bitRange>
                </field>
                <field>
                  <name>SMCL</name>
                  <description>Start of Matrix Cycle Interrupt Select
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[1:1]</bitRange>
                </field>
                <field>
                  <name>CSML</name>
                  <description>Change of Synchronization Mode Interrupt Select
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[2:2]</bitRange>
                </field>
                <field>
                  <name>SOGL</name>
                  <description>Start of Gap Interrupt Select
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[3:3]</bitRange>
                </field>
                <field>
                  <name>RTMIL</name>
                  <description>Register Time Mark Interrupt Select
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[4:4]</bitRange>
                </field>
                <field>
                  <name>TTMIL</name>
                  <description>Trigger Time Mark Event Internal Select
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[5:5]</bitRange>
                </field>
                <field>
                  <name>SWEL</name>
                  <description>Stop Watch Event Interrupt Select
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[6:6]</bitRange>
                </field>
                <field>
                  <name>GTWL</name>
                  <description>Global Time Wrap Interrupt Select
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[7:7]</bitRange>
                </field>
                <field>
                  <name>GTDL</name>
                  <description>Global Time Discontinuity Interrupt Select
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[8:8]</bitRange>
                </field>
                <field>
                  <name>GTEL</name>
                  <description>Global Time Error Interrupt Select
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[9:9]</bitRange>
                </field>
                <field>
                  <name>TXUL</name>
                  <description>Tx Count Underflow Interrupt Select
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[10:10]</bitRange>
                </field>
                <field>
                  <name>TXOL</name>
                  <description>Tx Count Overflow Interrupt Select
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[11:11]</bitRange>
                </field>
                <field>
                  <name>SE1L</name>
                  <description>Scheduling Error 1 Interrupt Select
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[12:12]</bitRange>
                </field>
                <field>
                  <name>SE2L</name>
                  <description>Scheduling Error 2 Interrupt Select
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[13:13]</bitRange>
                </field>
                <field>
                  <name>ELCL</name>
                  <description>Change Error Level Interrupt Select
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[14:14]</bitRange>
                </field>
                <field>
                  <name>IWTL</name>
                  <description>Initialization Watch Trigger Interrupt Select
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[15:15]</bitRange>
                </field>
                <field>
                  <name>WTL</name>
                  <description>Watch Trigger Interrupt Select
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[16:16]</bitRange>
                </field>
                <field>
                  <name>AWL_</name>
                  <description>Application Watchdog Interrupt Select
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[17:17]</bitRange>
                </field>
                <field>
                  <name>CERL</name>
                  <description>Configuration Error Interrupt Select
0= Assign to interrupt  enabled by ILE.EINT0
1= Assign to interrupt enabled by ILE.EINT1</description>
                  <bitRange>[18:18]</bitRange>
                </field>
              </fields>
            </register>
