Infineon/mtb-pdl-cat2/devices/svd/psoc4hvpaspm10.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="SCB0">
      <name>SCB1</name>
      <baseAddress>0x40250000</baseAddress>
    </peripheral>
    <peripheral>
      <name>LIN0</name>
      <version>1.0</version>
      <description>LIN</description>
      <headerStructName>LIN</headerStructName>
      <baseAddress>0x402D0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>65536</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ERROR_CTL</name>
          <description>Error control</description>
          <addressOffset>0x0</addressOffset>
          <resetMask>0x80EF001F</resetMask>
          <fields>
            <field>
              <name>CH_IDX</name>
              <description>Specifies the channel index of the channel to which HW  injected channel transmitter errors applies.</description>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>TX_SYNC_ERROR</name>
              <description>The synchronization field is changed from 0x55 to 0x00.

At the receiver, this should result in INTR.RX_HEADER_SYNC_ERROR activation.</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>TX_SYNC_STOP_ERROR</name>
              <description>The synchronization field STOP bits are inverted to '0'.

At the receiver, this should result in INTR.RX_HEADER_SYNC_ERROR or INTR.RX_HEADER_FRAME_ERROR activation.</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>TX_PARITY_ERROR</name>
              <description>In LIN mode, the PID parity bit P[1] is inverted from !(ID[5] ^ ID[4] ^ ID[3] ^ ID[1]) to (ID[5] ^ ID[4] ^ ID[3] ^ ID[1]).

At the receiver, this should result in INTR.RX_HEADER_PARITY_ERROR activation.

In UART mode, a data field's parity bit is inverted.</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>TX_PID_STOP_ERROR</name>
              <description>The PID field STOP bits are inverted to '0'.

At the receiver, this should result in INTR.RX_HEADER_FRAME_ERROR activation.</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TX_DATA_STOP_ERROR</name>
              <description>The data field STOP bits are inverted to '0'.

At the receiver, this should result in INTR.RX_RESPONSE_FRAME_ERROR activation.

Note: Used in UART mode.</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>TX_CHECKSUM_ERROR</name>
              <description>The checksum field is inverted.

At the receiver, this should result in INTR.RX_RESPONSE_CHECKSUM_ERROR activation.</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>TX_CHECKSUM_STOP_ERROR</name>
              <description>The checksum field STOP bits are inverted to '0'.

At the receiver, this should result in INTR.RX_RESPONSE_FRAME_ERROR activation.</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>ENABLED</name>
              <description>Error injection enable:
'0': Disabled.
'1': Enabled.</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TEST_CTL</name>
          <description>Test control</description>
          <addressOffset>0x4</addressOffset>
          <resetMask>0x8001001F</resetMask>
          <fields>
            <field>
              <name>CH_IDX</name>
              <description>Specifies the channel index of the channel to which test applies. The channel IO signals of channel indices CH_IDX and CH_NR-1 are connected as specified by MODE. CH_IDX should be in the range [0, CH_NR-2], as channel index CH_NR-1 is always involved in test and cannot be connected to itself. The test mode allows BOTH of the two connected channels to be tested.

Note: this testing functionality simplifies SW development, but may also be used in the field to verify correct channel functionality.</description>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MODE</name>
              <description>Test mode:
'0': Partial disconnect from IOSS. This mode's isolation allows for device test without relying on an external LIN transceiver. The IOSS 'tx' IO cell can be used to observe messages outside of the device.
- tx_in[CH_IDX] = IOSS lin_tx_in[CH_IDX].
- tx_in[CH_NR-1] = IOSS lin_tx_in[CH_IDX].
- rx_in[CH_IDX] = IOSS lin_tx_in[CH_IDX].
- rx_in[CH_NR-1] = IOSS lin_tx_in[CH_IDX].
- lin_tx_out[CH_IDX] = tx_out[CH_IDX] &amp; tx_out[CH_NR-1].
- lin_tx_out[CH_NR-1] = tx_out[CH_IDX] &amp; tx_out[CH_NR-1].

'1': Full disconnect from IOSS (the IOSS/HSIOM should disconnect 'tx_out' from the 'tx' IO cell). This mode's isolation allows for device test without effecting an operational LIN cluster.
- tx_in[CH_IDX] = lin_tx_out[CH_IDX].
- tx_in[CH_NR-1] = lin_tx_out[CH_IDX].
- rx_in[CH_IDX] = lin_tx_out[CH_IDX].
- rx_in[CH_NR-1] = lin_tx_out[CH_IDX].
- lin_tx_out[CH_IDX] = tx_out[CH_IDX] &amp; tx_out[CH_NR-1].
- lin_tx_out[CH_NR-1] = tx_out[CH_IDX] &amp; tx_out[CH_NR-1].</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ENABLED</name>
              <description>Test enable:
'0': Disabled. Functional mode.
- tx_in[CH_IDX] = IOSS lin_tx_in[CH_IDX].
- tx_in[CH_NR-1] = IOSS lin_tx_in[CH_NR-1].
- rx_in[CH_IDX] = IOSS lin_rx_in[CH_IDX].
- rx_in[CH_NR-1] = IOSS lin_rx_in[CH_NR-1].
- lin_tx_out[CH_IDX] = tx_out[CH_IDX].
- lin_tx_out[CH_NR-1] = tx_out[CH_NR-1].
'1': Enabled. Test mode, specific test mode is specified by MODE.</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>2</dim>
          <dimIncrement>256</dimIncrement>
          <name>CH[%s]</name>
          <description>LIN channel structure</description>
          <addressOffset>0x8000</addressOffset>
          <register>
            <name>CTL0</name>
            <description>Control 0</description>
            <addressOffset>0x0</addressOffset>
            <resetValue>0x400C0101</resetValue>
            <resetMask>0xF91F0313</resetMask>
            <fields>
              <field>
                <name>STOP_BITS</name>
                <description>STOP bit periods:
'0': 1/2 bit period.
'1': 1 bit period.
'2': 1 1/2 bit period.
'3': 2 bit periods.


In LIN mode, this field should be set to '1' (the default value) . 

In UART mode, this field can be programmed as desired.

Note: receiver STOP bit frame errors can only be detected if the number of STOP bit periods is 1 or more bit period.</description>
                <bitRange>[1:0]</bitRange>
              </field>
              <field>
                <name>AUTO_EN</name>
                <description>LIN transceiver auto enable:
'0': Disabled.
'1': Enabled. The TX_RX_STATUS.EN_OUT field is controlled by HW.</description>
                <bitRange>[4:4]</bitRange>
              </field>
              <field>
                <name>BREAK_DELIMITER_LENGTH</name>
                <description>In LIN mode, this field specifies the break delimiter length:
(used in header transmission, not used in header reception).
'0': 1 bit period.
'1': 2 bit periods (default value).
'2': 3 bit periods.
'3': 4 bit periods.

In UART mode, this field specifies the data field size:
'0': 5 bit data field.
'1': 6 bit data field.
'2': 7 bit data field.
'3': 8 bit data field.
When the data field size is less than 8 bits, the most significant (unused) bits of the DATAx.DATAy[7:0] fields should be set to '0' for the transmitter.</description>
                <bitRange>[9:8]</bitRange>
              </field>
              <field>
                <name>BREAK_WAKEUP_LENGTH</name>
                <description>Break/wakeup length (minus 1) in bit periods:
'0': 1 bit period.
...
'10': 11 bit periods (break length for slave nodes)
...
'12': 13 bit periods (break length for master nodes)
...
'30': 31 bit periods.
'31': Illegal (should NOT be used!!!)

This field is used for transmission/reception of BOTH break and wakeup signals. Note that these functions are mutually exclusive:
- When CMD.TX_HEADER is '1', the field specifies the transmitted break field.
- When CMD.TX_WAKEUP is '1', the field specifies the transmitted wakeup field.
- When CMD.RX_HEADER is '1', the field specifies the to be received break field.
- Otherwise, the field specifies the to be received wakeup field.

Per the standard, the master wakeup duration is between 250 us and 5 ms. To support uncalibrated slaves, a slave has a detection threshold of 150 us (3 bit periods at 20 kbps). After transmission of a break or wakeup signal, the INTR.TX_BREAK_WAKEUP_DONE interrupt cause is activated. After reception of a wakeup signal, the INTR.RX_BREAK_WAKEUP_DONE interrupt cause is activated.

To specify longer wakeup signals in terms of absolute time (us/ms rather than bit periods), the associated PERI clock divider value can be (temporarily) increased to make the LIN bit period longer.

Note: entering bus sleep mode is achieved with the 'go-to-sleep' command.</description>
                <bitRange>[20:16]</bitRange>
              </field>
              <field>
                <name>MODE</name>
                <description>Mode of operation:
'0': LIN mode.
'1': UART mode.</description>
                <bitRange>[24:24]</bitRange>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LIN</name>
                    <description>LIN mode.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UART</name>
                    <description>UART mode.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BIT_ERROR_IGNORE</name>
                <description>Specifies behavior on a detected bit error during header or response transmission:
'0': Message transfer is aborted.
'1': Message transfer is NOT aborted.

Note: this field does NOT effect the reporting of the bit error through INTR/STATUS.TX_HEADER/RESPONSE_BIT_ERROR; i.e. bit errors are always reported.</description>
                <bitRange>[27:27]</bitRange>
              </field>
              <field>
                <name>PARITY</name>
                <description>Parity mode:
'0': Even parity: even number of '1' bits (including parity).
'1': Odd parity.

Note: Used in UART mode only.</description>
                <bitRange>[28:28]</bitRange>
              </field>
              <field>
                <name>PARITY_EN</name>
                <description>Parity generation enable:
'0': Disabled. No parity bit is transferred.
'1': Enabled. The parity bit is transferred after the last (most significant) data field bit.

Note: Used in UART mode only.</description>
                <bitRange>[29:29]</bitRange>
              </field>
              <field>
                <name>FILTER_EN</name>
                <description>RX filter (for 'lin_rx_in'):
'0': No filter.
'1': Median 3 (default value) operates on the last three 'lin_rx_in' values. The sequences '000', '001', '010' and '100' result in a filtered value '0'. The sequences '111', '110', '101' and '011' result in a filtered value '1'.</description>
                <bitRange>[30:30]</bitRange>
              </field>
              <field>
                <name>ENABLED</name>
                <description>Channel enable:
'0': Disabled. If a channel is disabled, all non-retained MMIO registers (e.g. the TX_RX_STATUS, and INTR registers) have their fields reset to their default value.
'1': Enabled.</description>
                <bitRange>[31:31]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>CTL1</name>
            <description>Control 1</description>
            <addressOffset>0x4</addressOffset>
            <resetMask>0x03000000</resetMask>
            <fields>
              <field>
                <name>DATA_NR</name>
                <description>Number of data fields (minus 1) in the response (not including the checksum):
'0': 1 data field.
'1': 2 data fields.
...
'7': 8 data fields.

Note: master and slave nodes need to agree upon the number of data fields before message transfer.
In RX_RESPONSE case, When PID (header) is received, firmware has the time of one response data byte, to modify CTL1.DATA_NR.</description>
                <bitRange>[2:0]</bitRange>
              </field>
              <field>
                <name>CHECKSUM_ENHANCED</name>
                <description>Checksum mode:
'0': Classic mode. PID field is NOT included in the checksum calculation.
'1': Enhanced mode. PID field is included in the checksum calculation. This mode requires special attention when the master node transmits the header and a (different) slave node transmits the response: the slave node will use the calculated partial checksum over the received PID field as a starting point for the calculation over the to be transmitted data fields.

Note: If the frame identifier ID[5:0] is 0x3c or 0x3d, the classic mode will ALWAYS be used for transmission and assumed for reception, independent of the CHECKSUM_ENHANCED value.</description>
                <bitRange>[8:8]</bitRange>
              </field>
              <field>
                <name>FRAME_TIMEOUT</name>
                <description>Specifies the maximum allowed length (timeout value) for a frame, frame header or frame response in bit periods. The LIN specification prescribes to set the maximum length to 1.4x the nominal length (Theader_max = 1.4 x Theader_nom and Tresponse_max = 1.4 x Tresponse_nom). The nominal header length Theader_nom is 34 bit periods and the nominal response length Tresponse_nom is 10 * (data_nr + 1) bit periods (data_nr is the number of data fields) 

Note: the LIN specification specifies the following: 'Tools and tests shall check the Tframe_max (= Theader_max + Tresponse_max). Nodes shall not check this time. The receiving node of the frame shall accept the frame up to the next frame slot (i.e. next break field), even if it is longer then Tframe_max).'</description>
                <bitRange>[23:16]</bitRange>
              </field>
              <field>
                <name>FRAME_TIMEOUT_SEL</name>
                <description>Specifies the frame timeout mode:
'0': No timeout functionality (default value).
'1': Frame mode: detects timeout from the start of break field to checksum field STOP bits (inclusive). The minimum FRAME_TIMEOUT value is 34+20 bit periods (header and a response with 1 data field).
'2': Frame header mode: detects timeout from the start of break field to PID field STOP bits (inclusive). The minimum FRAME_TIMEOUT value is 34 bit periods (header).
'3': Frame response mode: detects timeout from the PID field STOP bits (exclusive) to checksum field STOP bits (the response space is included in the frame response). The minimum FRAME_TIMEOUT value is 20 bit periods (response with 1 data field).</description>
                <bitRange>[25:24]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUS</name>
            <description>Status</description>
            <addressOffset>0x8</addressOffset>
            <access>read-only</access>
            <resetMask>0x1F03333F</resetMask>
            <fields>
              <field>
                <name>DATA_IDX</name>
                <description>Number of transferred data and checksum fields in the response (also acts as an index/address into response data field and checksum field registers (DATA0, DATA1, PID_CHECKSUM)) :
'0': No data fields transferred.
'1': Data field 1 transferred.
...
'7': Data fields 1, 2, 3, ... and 7 transferred.
'8':  Data fields 1, 2, 3, ... and 8 transferred.
'9': Data fields 1, 2, 3, ..., 8 and checksum field transferred.
'10'-'15': Unused.

Set to '0' on the start of a TX_HEADER or RX_HEADER command.</description>
                <bitRange>[3:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>HEADER_RESPONSE</name>
                <description>Frame header / response identifier (only valid when TX_BUSY or RX_BUSY is '1'):
'0': Frame header being transferred.
'1': Frame response being transferred.</description>
                <bitRange>[4:4]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RX_DATA0_FRAME_ERROR</name>
                <description>Frame response, first data field frame error. HW sets this field to '1'  when the received STOP bits of the first response data field have an unexpected value (only after a RX_HEADER command), and this data byte is 0x00. HW clears this field to '0' at the falling edge of SYNC start bit (after INTR.RX_HEADER_BREAK_WAKEUP_DONE). This field is used together with INTR.RX_RESPONSE_FRAME_ERROR to distinguish 'no response', 'error response' and 'correct response' scenarios.

