Infineon/mtb-pdl-cat2/devices/svd/psoc4hvpaspm10.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ISOUART</name>
      <version>1.0</version>
      <description>iso-UART Block</description>
      <baseAddress>0x402E0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>65536</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTL</name>
          <description>General control register.</description>
          <addressOffset>0x0</addressOffset>
          <resetMask>0xF3F0FF0F</resetMask>
          <fields>
            <field>
              <name>BC_WRITE_TURN_TIME_CTL</name>
              <description>Broadcast Write Turnaround time control.

0 = normal turnaround time. Must be set to 0 when clk_sys &gt; clk_iuart.

1 = fast turnaround time. Must be set to 1 when clk_sys &lt;= clk_iuart.

NOTE: This bitfield is only relevant in peripheral role and if IF_CONFIG.FN = 0.</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OVS</name>
              <description>N/A</description>
              <bitRange>[3:1]</bitRange>
            </field>
            <field>
              <name>IFL_L_CMOSRCV_EN</name>
              <description>Enables single ended digital receiver.  Should only be enabled with AUX connection enabled.</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IFL_H_CMOSRCV_EN</name>
              <description>Enables single ended digital receiver.  Should only be enabled with AUX connection enabled.</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IFH_L_CMOSRCV_EN</name>
              <description>Enables single ended digital receiver.  Should only be enabled with AUX connection enabled.</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>IFH_H_CMOSRCV_EN</name>
              <description>Enables single ended digital receiver.  Should only be enabled with AUX connection enabled.</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>IFL_L_AUX_EN</name>
              <description>Enable AUX connection from HSIOM to IFL_L allowing other peripherals to control this IO.</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>IFL_H_AUX_EN</name>
              <description>Enable AUX connection from HSIOM to IFL_H allowing other peripherals to control this IO.</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>IFH_L_AUX_EN</name>
              <description>Enable AUX connection from HSIOM to IFH_L allowing other peripherals to control this IO.</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IFH_H_AUX_EN</name>
              <description>Enable AUX connection from HSIOM to IFH_H allowing other peripherals to control this IO.</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>TRIG0_EMM</name>
              <description>Trigger input tr_emm_in[0] will cause an EMM to be sent if asserted.</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>TRIG1_EMM</name>
              <description>Trigger input tr_emm_in[1] will cause an EMM to be sent if asserted.</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>TRIG2_EMM</name>
              <description>Trigger input tr_emm_in[2] will cause an EMM to be sent if asserted.</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>TRIG3_EMM</name>
              <description>Trigger input tr_emm_in[3] will cause an EMM to be sent if asserted.</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>EMERGENCY</name>
              <description>Declare an Emergency.  Part will transmit EMM signal on the chain.  Hardware will clear this bit once the full emergency signal has been sent.</description>
              <bitRange>[24:24]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>RESET_INTERFACE</name>
              <description>Use when the interface gets stuck (i.e. when a slave fails to respond).

For MASTER: resets the sequencer, clears the MASTER_START register, and prepares for another transaction.
For SLAVE: moves the interface back to IDLE state</description>
              <bitRange>[25:25]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>CRC_POLY</name>
              <description>CRC Polynomial

0: SAE J1859 : z8 + z4 + z3 + z2 + 1
1: Old CRC:    x8+ x5+ x3+ x2+ x1+ x0</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>BLOCK_ID_EN</name>
              <description>Block ID Enable</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>REGULATOR_BYPASS</name>
              <description>This bit bypasses the regulator and connects vddif directly to vddd. Regulator is bypassed in CMOS mode</description>
              <bitRange>[30:30]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Normal mode. Wake sequence can enable the regulator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>VDDIF connected directly to VDDD for CMOS mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLED</name>
              <description>IP enabled ('1') or not ('0'). Disabling will clear all non-configuration registers.</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERFACE_STATUS</name>
          <description>Current state of the interface</description>
          <addressOffset>0x4</addressOffset>
          <access>read-only</access>
          <resetMask>0x7F7F777F</resetMask>
          <fields>
            <field>
              <name>INTERFACE_STATE</name>
              <description>This register shows the current state of the interface logic</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLEEP</name>
                  <description>Interface is in SLEEP state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INIT</name>
                  <description>Interface is in INIT state, wakeup has been received</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>Interface is in IDLE state</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQUEST</name>
                  <description>Interface is in REQUEST state, start bit of Sync-Frame to end of CRC Frame</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REVERSE</name>
                  <description>Interface is in REVERSE state, upstream device is transmitting. If MASTER then Node is responding with WRITE REPLY, READ REPLY or MULTIREAD REPLY</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPLY</name>
                  <description>Interface is in REPLY state, we are transmitting</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BC_WAIT</name>
                  <description>Interface is in BC_WAIT state, downstream device is transmitting. If MASTER then Node is responding to broadcast read or broadcast multiread</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BC_REPLY</name>
                  <description>Interface is in BC_REPLY state, we are transmitting</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BC_REVERSE</name>
                  <description>Interface is in BC_REVERSE state, upstream device is transmitting</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMM</name>
                  <description>Interface is in EMM state, EMM was detected from INIT state and we are transmitting</description>
                  <value>9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REQUEST_STATE</name>
              <description>Sub-state from REQUEST state.  This register is not valid if INTERFACE_STATE != REQUEST.</description>
              <bitRange>[6:4]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCK_ID</name>
                  <description>Host is sending SYNC-Frame</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEVICE_ID</name>
                  <description>Host is sending ID-Frame</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDR</name>
                  <description>Host is sending ADDR-Frame</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA1</name>
                  <description>Host is sending DATA1-Frame</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA0</name>
                  <description>Host is sending DATA0-Frame</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC</name>
                  <description>Host is sending CRC-Frame</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HOST_COMMAND</name>
              <description>Command type sent by host.  Valid for an INTERFACE_STATE where a slave is transmitting: REVERSE, REPLY, BC_WAIT, BC_REPLY, BC_REVERSE.</description>
              <bitRange>[10:8]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITE</name>
                  <description>Host issued a Write command</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BC_WRITE</name>
                  <description>Host issued a Broadcast Write command</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Host issued a Read command</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULTI_READ</name>
                  <description>Host issued a Multi-Read command</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BC_READ</name>
                  <description>Host issued a Broadcast Read command</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BC_MULTI_READ</name>
                  <description>Host issued a Broadcast Multi-Read command</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REPLY_STATE</name>
              <description>Sub-state from any state where a reply is being sent by any slave.  Valid for an INTERFACE_STATE where a slave is transmitting: REVERSE, REPLY, BC_WAIT, BC_REPLY, and BC_REVERSE.</description>
              <bitRange>[14:12]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REPLY_FRAME</name>
                  <description>A Reply frame is being sent</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID_FRAME</name>
                  <description>An ID frame is being sent</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDR_FRAME</name>
                  <description>An Address frame is being sent</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA1_FRAME</name>
                  <description>A Data1 frame is being sent</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA0_FRAME</name>
                  <description>A Data0 frame is being sent</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_FRAME</name>
                  <description>A CRC frame is being sent</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEVID_TRANSMITTING</name>
              <description>Device ID of the device currently transmitting.  Valid in any state other than SLEEP, INIT, IDLE, and EMM.  DEVID=0 for host, actual Device ID for any slave.</description>
              <bitRange>[22:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PACKET_NUMBER</name>
              <description>The packet number being transmitted.  Valid when HOST_COMMAND = MULTI_READ or BC_MULTI_READ.  A packet is defined as the five frames ID, Addr, Data1, Data0, and CRC. 0 = first packet</description>
              <bitRange>[30:24]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MULTI_READ_CTL</name>
          <description>Control interpretation of the multi-read configuration register</description>
          <addressOffset>0x8</addressOffset>
          <resetMask>0x80007F7F</resetMask>
          <fields>
            <field>
              <name>MULTI_READ_BASE_A</name>
              <description>Base addresses used when returning registers enabled by bits 4 and 3:0 of the multi-read configuration register.</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>MULTI_READ_BASE_B</name>
              <description>Base addresses used when returning registers enabled by bits 8 and 7:5 of the multi-read configuration register.</description>
              <bitRange>[14:8]</bitRange>
            </field>
            <field>
              <name>MULTI_READ_BC_EN</name>
              <description>Enables Multi Read Broadcast</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
