Infineon/mtb-pdl-cat2/devices/svd/psoc4hvpaspm10.svd
        <register>
          <name>MASTER_CFG</name>
          <description>Master configuration register</description>
          <addressOffset>0x20</addressOffset>
          <resetMask>0xFFFFF7FF</resetMask>
          <fields>
            <field>
              <name>LOW_INTERFACE_MODE</name>
              <description>Determines the operating mode for the LOW interface</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLAVE</name>
                  <description>Interface is a slave in the chain.  Both interfaces must be configured as slave for proper operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RECEIVER</name>
                  <description>Interface is the end point for loop topology, or waiting for reply from slave</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER</name>
                  <description>Interface is the master of a chain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSVD</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HIGH_INTERFACE_MODE</name>
              <description>Allows software to read the current contents of the MUILTI_READ_CFG register.  Cannot be written by software since this register must be identical in all parts in the chain.</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLAVE</name>
                  <description>Interface is a slave in the chain.  Both interfaces must be configured as slave for proper operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RECEIVER</name>
                  <description>Interface is the end point for loop topology</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER</name>
                  <description>Interface is the master of a chain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSVD</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG0_WRITE_DONE</name>
              <description>Specifies whether output trigger 0 asserts when a transaction (either manual write, or sequence) is complete</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_TRIGGER</name>
                  <description>No trigger, interrupt only</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Both interrupt and trigger output are asserted</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG1_LOW_SRAM_FULL</name>
              <description>Specifies whether output trigger 1 asserts when data is written into the last allocated address in local SRAM</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_TRIGGER</name>
                  <description>No trigger, interrupt only</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Both interrupt and trigger output are asserted</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG2_HIGH_SRAM_FULL</name>
              <description>Specifies whether output trigger 2 asserts when data is written into the last allocated address in local SRAM</description>
              <bitRange>[6:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_TRIGGER</name>
                  <description>No trigger, interrupt only</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Both interrupt and trigger output are asserted</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTERNAL_LOOPBACK</name>
              <description>Local loopback control.  Value is ignored unless one interface is configured as MASTER and other as RECEIVER.</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TX_BLOCK_ID</name>
              <description>Determines the blockID to be sent.  Legal values are 0 - 6.</description>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>MASTER_MODE</name>
              <description>N/A</description>
              <bitRange>[12:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MANUAL</name>
                  <description>Send and receive data one byte at a time.  No interface interpretation of the contents</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQUENCED</name>
                  <description>Perform Write and Read Transactions with a single register write</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASTER_BITRATE</name>
              <description>Determines the datarate of the ISOUART chain</description>
              <bitRange>[13:13]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2_1Mbps</name>
                  <description>Set datarate to 2.1Mbps</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_0Mbps</name>
                  <description>Set datarate to 3.0Mbps</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RECEIVE_MODE</name>
              <description>Specifies what is done with the data that is received.</description>
              <bitRange>[15:14]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REGISTER</name>
                  <description>Stored in respective RECEIVED register only</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNPACKED</name>
                  <description>Unpacked, with Data field being stored in local SRAM</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAW</name>
                  <description>Raw register values stored in local SRAM.  This allows for end (slave) to end (ASIL-D host) data integrity to be maintained.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSVD</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOW_INTERFACE_SRAM_SIZE</name>
              <description>N/A</description>
              <bitRange>[22:16]</bitRange>
            </field>
            <field>
              <name>RESET_LOW_INTERFACE_SRAM_PTR</name>
              <description>Writing a 1 causes the next read to start at the beginning of the allocated SRAM space.  This bit is cleared by hardware after the internal pointer is reset.</description>
              <bitRange>[23:23]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>HIGH_INTERFACE_SRAM_SIZE</name>
              <description>See LOW_INTERFACE_SRAM_SIZE for full description.

