Infineon/mtb-pdl-cat2/devices/svd/psoc4hvpaspm10.svd
HIGH SRAM allocation starts immediately after the LOW allocation in Loop configuration. In a non-ring configuration, SRAM pointer always starts at 0. In MoT, LOW_INTERFACE_SRAM_SIZE is used and HIGH_INTERFACE_SRAM_SIZE is ignored and in MoB HIGH_INTERFACE_SRAM_SIZE is used and LOW_INTERFACE_SRAM_SIZE is ignored. This is because if the configuration is non-ring then the node response will only come in one direction so no SRAM is assigned to the opposite direction, and the pointer always starts from 0</description>
              <bitRange>[30:24]</bitRange>
            </field>
            <field>
              <name>RESET_HIGH_INTERFACE_SRAM_PTR</name>
              <description>Writing a 1 causes the next read to start at the beginning of the allocated SRAM space.  This bit is cleared by hardware after the internal pointer is reset.</description>
              <bitRange>[31:31]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MASTER_START</name>
          <description>Trigger a write to the interface</description>
          <addressOffset>0x24</addressOffset>
          <resetMask>0xFF7FFFFF</resetMask>
          <fields>
            <field>
              <name>WRITE_DATA</name>
              <description>When MASTER_MODE is MANUAL:
    DATA&lt;7:0&gt; represents exact data to be sent onto the bus

When MASTER_MODE is SEQUENCED and R_W field is Write:
    Data&lt;15:0&gt; represents the 16 bit data being sent to the specified slave(s)

In all other cases, this field is ignored</description>
              <bitRange>[15:0]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>When MASTER_MODE is SEQUENCED:
    Represents the address of the slave(s) to be targeted with the sequence</description>
              <bitRange>[22:16]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>DEVICE_ID</name>
              <description>When MASTER_MODE is SEQUENCED:
    Represents the slave ID(s) to be targeted with the sequence</description>
              <bitRange>[29:24]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>READ_WRITE</name>
              <description>When MASTER_MODE is SEQUENCED:
    Determines the type of sequence to be initiated</description>
              <bitRange>[30:30]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read operation to transfer data from referenced slave(s)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE</name>
                  <description>Write operation to transfer data to referenced slave(s)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEND_WAKE_SEQUENCE</name>
              <description>Send wake sequence before command frame</description>
              <bitRange>[31:31]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LOW_INTERFACE_READ</name>
          <description>Most recent data read from LOW interface</description>
          <addressOffset>0x28</addressOffset>
          <access>read-only</access>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>READ_LOW_DATA</name>
              <description>Raw DATA received in most recent frame</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIGH_INTERFACE_READ</name>
          <description>Most recent data read from HIGH interface</description>
          <addressOffset>0x2C</addressOffset>
          <access>read-only</access>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>READ_HIGH_DATA</name>
              <description>Raw DATA received in most recent frame</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WAKE_DELAY_CFG</name>
          <description>Wake sequence configuration</description>
          <addressOffset>0x30</addressOffset>
          <resetValue>0x00002EE0</resetValue>
          <resetMask>0x00003FFF</resetMask>
          <fields>
            <field>
              <name>WAKE_CMD_DELAY</name>
              <description>Delay between wake sequence and command frame. Default is 500us (max twake of TLE9012). Each addition adds 0.0416us of delay</description>
              <bitRange>[13:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IF_GEN_DIAG</name>
          <description>General Diagnosis</description>
          <addressOffset>0x40</addressOffset>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>GPIO_WAKEUP</name>
              <description>Wake-up via GPIO

 0 - wake-up via iso UART
 1 - wake-up via GPIO</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MOT_MOB_N</name>
              <description>Master on Top/Bottom Configuraiton

0 - configured as master on bottom
1 - configured as master on top</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RSVD_ERR2</name>
              <description>N/A</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RSVD_ERR3</name>
              <description>N/A</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RSVD_ERR4</name>
              <description>N/A</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RSVD_ERR5</name>
              <description>N/A</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RSVD_ERR6</name>
              <description>N/A</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RSVD_ERR7</name>
              <description>N/A</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RSVD_ERR_15_8</name>
              <description>N/A</description>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IF_MULTI_READ_CFG</name>
          <description>Multi-read configuration register</description>
          <addressOffset>0x44</addressOffset>
          <access>read-only</access>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>MULTI_READ_CFG</name>
              <description>Allows software to read the current contents of the MUILTI_READ_CFG register.  Cannot be written by software since this register must be identical in all parts in the chain.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF_CONFIG</name>
          <description>Interface configuration register, containing the current Device ID</description>
          <addressOffset>0x48</addressOffset>
          <access>read-only</access>
          <resetMask>0x000009FF</resetMask>
          <fields>
            <field>
              <name>NODE_ID</name>
              <description>N/A</description>
              <bitRange>[5:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BLOCK_ID</name>
              <description>Block ID assigned to the node. Extracted from Sync frame. Only useful when blockid feature is enabled</description>
              <bitRange>[8:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FN</name>
              <description>The final node in the stack must have this bit set. If the final node does not have FN set, no reply frame on broadcast will be sent -&gt; UART time out

0 - not the final node (default)
1 - final node</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF_WDOG_CNT</name>
          <description>Interface watchdog register</description>
          <addressOffset>0x4C</addressOffset>
          <resetValue>0x0000007F</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>WDOG_CNT</name>
              <description>Watchdog Count Value. Configurable by SW and shows status of count value.</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_STATUS</name>
          <description>Interface clock status</description>
          <addressOffset>0x50</addressOffset>
          <access>read-only</access>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BR_COUNTER</name>
              <description>Amount of peripheral clock periods that constitute the transmission of the sync frame as determined by the receiver. BR_COUNTER / 8 is the amount of peripheral clock periods that constitute a bit period.  Used by the interface to automatically adjust the baud rate to track the host.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UVD_CTL</name>
          <description>Under Voltage Detection Control</description>
          <addressOffset>0x54</addressOffset>
          <resetValue>0x000002D0</resetValue>
          <resetMask>0x8000FFFF</resetMask>
          <fields>
            <field>
              <name>FILT_LIMIT</name>
              <description>Selects the glitch filter counter value limit for the UVD. If the glitch filter counter = FILT_LIMIT, the UVD interrupt will be asserted.Max value for this filter is 0x4B0, and default value is 0x2D0. Each addition adds 0.0208us of filter time</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable Under Voltage Detection (UVD)</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR</name>
          <description>Interrupt request register</description>
          <addressOffset>0x60</addressOffset>
          <resetMask>0x03FFF3FF</resetMask>
          <fields>
            <field>
              <name>WAKE_HIGH</name>
              <description>Wakeup Event on High Interface</description>
              <bitRange>[0:0]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>WAKE_LOW</name>
              <description>Wakeup Event on Low Interface</description>
              <bitRange>[1:1]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>WDOG_CNT_TIMEOUT</name>
              <description>Timeout of the watchdog counter, indicating that the interface is going to sleep mode</description>
              <bitRange>[2:2]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>EMM</name>
              <description>The Emergency signal was transmitted by another part in the chain</description>
              <bitRange>[3:3]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>REQUEST</name>
              <description>The host completed a request, with clean CRC (whether or not it was addressed to us)</description>
              <bitRange>[4:4]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>REQUEST_MATCH</name>
              <description>The host completed a request, with device ID matching ours, with clean CRC</description>
              <bitRange>[5:5]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>BC_WRITE</name>
              <description>The host completed a BC_WRITE request</description>
              <bitRange>[6:6]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>BC_READ</name>
              <description>The host completed a BC_READ request</description>
              <bitRange>[7:7]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>FRAME_ERR</name>
              <description>Framing communication error</description>
              <bitRange>[8:8]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>CRC_ERR</name>
              <description>CRC error</description>
              <bitRange>[9:9]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>REG_ACCESS_P</name>
              <description>Primary register specific access interrupt</description>
              <bitRange>[12:12]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>REG_ACCESS_S</name>
              <description>Secondary register specific access interrupt</description>
              <bitRange>[13:13]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>UVD</name>
              <description>Under Voltage Detection</description>
              <bitRange>[14:14]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ECC_ERR</name>
              <description>ECC Error</description>
              <bitRange>[15:15]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>WRITE_COMPLETE</name>
              <description>A master transaction completed</description>
              <bitRange>[16:16]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>MASTER_LOW_FRAME_RECEIVED</name>
              <description>A frame was received at the LOW interface while not in SLAVE mode</description>
              <bitRange>[17:17]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>MASTER_HIGH_FRAME_RECEIVED</name>
              <description>A frame was received at the HIGH interface while not in SLAVE mode</description>
              <bitRange>[18:18]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>MASTER_LOW_SRAM_FULL</name>
              <description>The LOW interface filled the allocated local SRAM</description>
              <bitRange>[19:19]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>MASTER_HIGH_SRAM_FULL</name>
              <description>The HIGH interface filled the allocated local SRAM</description>
              <bitRange>[20:20]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>MASTER_INTERNAL_ERROR</name>
              <description>An internal error (i.e. configuration problem) occurred</description>
              <bitRange>[21:21]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>MASTER_CRC_ERROR</name>
              <description>A CRC value from slave didn't match expected value</description>
              <bitRange>[22:22]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>MASTER_SLAVE_STATUS_ERROR</name>
              <description>The slave returned a reply frame with status error bit set</description>
              <bitRange>[23:23]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>MASTER_SLAVE_ACCESS_ERROR</name>
              <description>The slave returned a reply frame with access error bit set</description>
              <bitRange>[24:24]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>MASTER_SLAVE_ADDRESS_ERROR</name>
              <description>The slave returned a reply frame with address error bit set</description>
              <bitRange>[25:25]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
