Infineon/mtb-pdl-cat2/devices/svd/psoc4hvpaspm10.svd
        <register>
          <name>INTR_SET</name>
          <description>Interrupt set register</description>
          <addressOffset>0x64</addressOffset>
          <resetMask>0x03FFF3FF</resetMask>
          <fields>
            <field>
              <name>WAKE_HIGH</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[0:0]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>WAKE_LOW</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[1:1]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>WDOG_CNT_TIMEOUT</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[2:2]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>EMM</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[3:3]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>REQUEST</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[4:4]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>REQUEST_MATCH</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[5:5]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>BC_WRITE</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[6:6]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>BC_READ</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[7:7]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>FRAME_ERR</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[8:8]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>CRC_ERR</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[9:9]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>REG_ACCESS_P</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[12:12]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>REG_ACCESS_S</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[13:13]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>UVD</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[14:14]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>ECC_ERR</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[15:15]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>WRITE_COMPLETE</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[16:16]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>MASTER_LOW_FRAME_RECEIVED</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[17:17]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>MASTER_HIGH_FRAME_RECEIVED</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[18:18]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>MASTER_LOW_SRAM_FULL</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[19:19]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>MASTER_HIGH_SRAM_FULL</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[20:20]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>MASTER_INTERNAL_ERROR</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[21:21]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>MASTER_CRC_ERROR</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[22:22]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>MASTER_SLAVE_STATUS_ERROR</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[23:23]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>MASTER_SLAVE_ACCESS_ERROR</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[24:24]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>MASTER_SLAVE_ADDRESS_ERROR</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[25:25]</bitRange>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_MASK</name>
          <description>Interrupt mask register</description>
          <addressOffset>0x68</addressOffset>
          <resetMask>0x03FFF3FF</resetMask>
          <fields>
            <field>
              <name>WAKE_HIGH</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>WAKE_LOW</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>WDOG_CNT_TIMEOUT</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EMM</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>REQUEST</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>REQUEST_MATCH</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>BC_WRITE</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BC_READ</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FRAME_ERR</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CRC_ERR</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>REG_ACCESS_P</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>REG_ACCESS_S</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>UVD</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ECC_ERR</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>WRITE_COMPLETE</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>MASTER_LOW_FRAME_RECEIVED</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>MASTER_HIGH_FRAME_RECEIVED</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>MASTER_LOW_SRAM_FULL</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>MASTER_HIGH_SRAM_FULL</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>MASTER_INTERNAL_ERROR</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>MASTER_CRC_ERROR</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>MASTER_SLAVE_STATUS_ERROR</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>MASTER_SLAVE_ACCESS_ERROR</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>MASTER_SLAVE_ADDRESS_ERROR</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[25:25]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_MASKED</name>
          <description>Interrupt masked register</description>
          <addressOffset>0x6C</addressOffset>
          <access>read-only</access>
          <resetMask>0x03FFF3FF</resetMask>
          <fields>
            <field>
              <name>WAKE_HIGH</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WAKE_LOW</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WDOG_CNT_TIMEOUT</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EMM</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>REQUEST</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>REQUEST_MATCH</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BC_WRITE</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BC_READ</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FRAME_ERR</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CRC_ERR</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>REG_ACCESS_P</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>REG_ACCESS_S</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>UVD</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ECC_ERR</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WRITE_COMPLETE</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MASTER_LOW_FRAME_RECEIVED</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MASTER_HIGH_FRAME_RECEIVED</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MASTER_LOW_SRAM_FULL</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MASTER_HIGH_SRAM_FULL</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MASTER_INTERNAL_ERROR</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MASTER_CRC_ERROR</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MASTER_SLAVE_STATUS_ERROR</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MASTER_SLAVE_ACCESS_ERROR</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MASTER_SLAVE_ADDRESS_ERROR</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_REG_ACCESS_P</name>
          <description>Primary Register specific access interrupt cause</description>
          <addressOffset>0x70</addressOffset>
          <access>read-only</access>
          <resetMask>0x0000037F</resetMask>
          <fields>
            <field>
              <name>REG_ADDR</name>
              <description>Address of request that triggered the interrupt</description>
              <bitRange>[6:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>REG_EVENT</name>
              <description>The event that triggered the interrupt</description>
              <bitRange>[9:8]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITE</name>
                  <description>A write event occurred</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EARLY_READ</name>
                  <description>An early read event occurred</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LATE_READ</name>
                  <description>A late read event occurred</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_REG_ACCESS_S</name>
          <description>Secondary Register specific access interrupt cause</description>
          <addressOffset>0x74</addressOffset>
          <access>read-only</access>
          <resetMask>0x0000037F</resetMask>
          <fields>
            <field>
              <name>REG_ADDR</name>
              <description>Address of request that triggered the interrupt</description>
              <bitRange>[6:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>REG_EVENT</name>
              <description>The event that triggered the interrupt</description>
              <bitRange>[9:8]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITE</name>
                  <description>A write event occurred</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EARLY_READ</name>
                  <description>An early read event occurred</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LATE_READ</name>
                  <description>A late read event occurred</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_CTL</name>
          <description>ECC control</description>
          <addressOffset>0x80</addressOffset>
          <resetMask>0x00010000</resetMask>
          <fields>
            <field>
              <name>ECC_EN</name>
              <description>Enable ECC for ISOUART SRAM
When disabled also all error injection functionality is disabled.</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
