Infineon/mtb-pdl-cat2/devices/svd/psoc4hvpaspm10.svd
        <register>
          <name>ECC_ERR_INJ</name>
          <description>ECC error injection</description>
          <addressOffset>0x84</addressOffset>
          <resetValue>0x0000FFFC</resetValue>
          <resetMask>0x7F10FFFC</resetMask>
          <fields>
            <field>
              <name>ERR_ADDR</name>
              <description>Specifies the address of the word where an error will be injected on write or an non-correctable error will be suppressed.
When the ERR_EN bit is set an error parity (ERR_PAR) is injected when any write is done to this address.
When the ERR_EN bit is set and the access address matches ERR_ADDR then a non-correctable ECC error or an Address error will NOT result in a bus error or ISOUART shutdown. This address must be the AHB address (i.e. SRAM_WITH_ATTR)
Note that error reporting to the fault structure cannot be suppressed.</description>
              <bitRange>[15:2]</bitRange>
            </field>
            <field>
              <name>ERR_EN</name>
              <description>Enable error injection (ECC_EN must be 1).
When this bit is set the error parity (ERR_PAR) will be used when an AHB write is done to the ERR_ADDR address.
When the error word is read a single or double error will be reported to the fault structure just like for a real ECC error (even if this bit is no longer set).
When this bit is set (and ECC_EN=1) a non-correctable error (ECC or address error) for the ERR_ADDR will not be reported back to the ISOUART or AHB bus.</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>ERR_PAR</name>
              <description>ECC Parity bits to use for ECC error injection at address ERR_ADDR.</description>
              <bitRange>[30:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_STATUS</name>
          <description>ECC status</description>
          <addressOffset>0x88</addressOffset>
          <access>read-only</access>
          <resetMask>0x00007F03</resetMask>
          <fields>
            <field>
              <name>CORR_ERR</name>
              <description>Corrected ECC Error</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NOT_CORR_ERR</name>
              <description>Not Corrected ECC Error</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SYNDROME</name>
              <description>ECC Error Syndrome, can be used to determine the bit location on correctable ECC Errors</description>
              <bitRange>[14:8]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DFT_CTL</name>
          <description>DFT Control Register</description>
          <addressOffset>0x90</addressOffset>
          <resetValue>0x04000000</resetValue>
          <resetMask>0xBFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DDFT0_MUX_SEL</name>
              <description>DDFT0 Output Mux Selection

0 - off (low)
1 - wake_hs (output from PHY)
2 - wake_ls (output from PHY)
3 - reg_en (input to regulator)
4 - hs_pd_rec (High PHY powerdown receiver) (input to PHY)
5 - hs_en_tr (High PHY enable transmitter) (input to PHY) 
6 - ls_pd_rec (Low PHY powerdown receiver) (input to PHY)
7 - ls_en_tr (Low PHY enable transmitter) (input to PHY)
8 - hs_if_mode (input to PHY)
9 - ls_if_mode (input to PHY)
10 - hs_trn_tri (input to PHY)
11 - ls_trn_tri (input to PHY)
12 - hs_datain (output from PHY)
13 - ls_datain (output to PHY)
14 - wake_reset (input to PHY. From logic prespective there is onlay a single wake reset which goes to both PHY)
15 - reg_uv_n
16 - reg_vddif_sel (input to regulator)
17 - hs_data_out
18 - ls_data_out</description>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>DDFT1_MUX_SEL</name>
              <description>DDFT1 Output Mux Selection

0 - off (low)
1 - wake_hs
2 - wake_ls 
3 - reg_en
4 - hs_pd_rec (High PHY powerdown receiver)
5 - hs_en_tr (High PHY enable transmitter)
6 - ls_pd_rec (Low PHY powerdown receiver)
7 - ls_en_tr (Low PHY enable transmitter)
8 - hs_if_mode
9 - ls_if_mode
10 - hs_trn_tri
11 - ls_trn_tri
12 - hs_datain
13 - ls_datain
14 - wake_reset (input to PHY. From logic prespective there is onlay a single wake reset which goes to both PHY)
15 - reg_uv_n (output from regulator)
16 - reg_vddif_sel (input to regulator)
17 - hs_data_out
18 - ls_data_out</description>
              <bitRange>[9:5]</bitRange>
            </field>
            <field>
              <name>REG_ADFT_SEL</name>
              <description>Regulator ADFT Select

below selections correspond to amuxbusa,amuxbusb

0 - Hi-Z, Hi-Z: Disabled
1 - uv_n, Hi-Z: Undervoltage comparator test
2 - vddif, vddif_s: Internal vdddif measure
3 - internal regulator bias current output, internal comparator bias current output: Internal bias current measure
4 - internal comparator bias current output , internal regulator bias current output,: Internal bias current measure (swapped)
5 - Hi-Z, Hi-Z: Discharge off mode
6 - Hi-Z, Hi-Z: Current limit disable mode 
7 - Hi-Z, Hi-Z: Burn-In mode</description>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>FRC_REG_EN</name>
              <description>Force Regulator Enable

CTL.REGULATOR_ENABLE enables the regulator but requires a wake sequencer before the regulator is actually enabled. FRC_REG_EN enables the regulator without a wake sequence. This bit is used for testing and should be set to 0 in functional mode.

0 - Functional mode 
1 - Force Regulator enable for testing</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>PHY_HS_ADFT_SEL</name>
              <description>High Side Physical Interface ADFT select

