Infineon/mtb-pdl-cat2/devices/svd/psoc4hvpaspm10.svd
below selections correspond to amuxbusa, amuxbus

0 -  Hi-Z, Hi-Z
1 - sense_h_rec, sense_l_rec
2 - sense_h_wake, sense_l_wake
3 - sense_h_cmosi, sense_l_cmosi
4 - rec_ith_offset, Hi-Z
5 - wake_lch_h, wake_lch_l
6 - wake_g, wake_rstn
7 - wake_g, wake_output</description>
              <bitRange>[16:14]</bitRange>
            </field>
            <field>
              <name>PHY_HS_TRI_TM</name>
              <description>High Side Physically Interface Tri-state Test Mode

0 - Functional Mode
1 - Tri-state HS PHY Interface</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>PHY_LS_ADFT_SEL</name>
              <description>Low Side Physical Interface ADFT select

below selections correspond to amuxbusa, amuxbusb

0 -  Hi-Z, Hi-Z
1 - sense_h_rec, sense_l_rec
2 - sense_h_wake, sense_l_wake
3 - sense_h_cmosi, sense_l_cmosi
4 - rec_ith_offset, Hi-Z
5 - wake_lch_h, wake_lch_l
6 - wake_g, wake_rstn
7 - wake_g, wake_output</description>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>PHY_LS_TRI_TM</name>
              <description>Low Side Physically Interface Tri-state Test Mode

0 - Functional Mode
1 - Tri-state LS PHY Interface</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>REG_SPARE</name>
              <description>Regulator Spares Controls</description>
              <bitRange>[29:22]</bitRange>
            </field>
            <field>
              <name>EN_DFT_LS</name>
              <description>Enable DFT Stuck-At-1 Test for Level Shifters</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DFT_STATUS</name>
          <description>DFT Status Register</description>
          <addressOffset>0x94</addressOffset>
          <access>read-only</access>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>DFT_LS_OUT</name>
              <description>Observation point of level-shifters output. Used for detection of SA1 faults on the level-shifter enables.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>4</dimIncrement>
          <name>TRIG_INT_STRUCT[%s]</name>
          <description>Structure defining trigger and interrupt response to events</description>
          <addressOffset>0x100</addressOffset>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>TRIG_SRC</name>
              <description>Determines whether a trigger is enabled, and when it is asserted</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No trigger</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE</name>
                  <description>Trigger on a write event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EARLY_READ</name>
                  <description>Trigger on an early read event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LATE_READ</name>
                  <description>Trigger on a late read event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIM_INT_SRC</name>
              <description>Determines whether the primary interrupt  is enabled, and when it is asserted</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE</name>
                  <description>Interrupt on a write event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EARLY_READ</name>
                  <description>Interrupt on an early read event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LATE_READ</name>
                  <description>Interrupt on a late read event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC_INT_SRC</name>
              <description>Determines whether the secondary interrupt  is enabled, and when it is asserted</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE</name>
                  <description>Interrupt on a write event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EARLY_READ</name>
                  <description>Interrupt on an early read event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LATE_READ</name>
                  <description>Interrupt on a late read event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>64</dim>
          <dimIncrement>4</dimIncrement>
          <name>SRAM_DATA[%s]</name>
          <description>128 word x 16 bit SRAM representing data available to iso-UART interface</description>
          <addressOffset>0x200</addressOffset>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>DATA_E</name>
              <description>16 bit data field (even row). Same content as SRAM_WITH_ATTR.DATA
Writes to this address space only affect the data portion of SRAM, and reads only return the DATA portion of the SRAM. Since the data filed of each SRAM row is only 16 bit wide, read/writes to this offset accesses 2 consecutive SRAM locations to provide 32 bits.</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>DATA_O</name>
              <description>16 bit data field (odd row). Same content as SRAM_WITH_ATTR.DATA
Writes to this address space only affect the data portion of SRAM, and reads only return the DATA portion of the SRAM. Since the data filed of each SRAM row is only 16 bit wide, read/writes to this offset accesses 2 consecutive SRAM locations to provide 32 bits.</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <dim>128</dim>
          <dimIncrement>4</dimIncrement>
          <name>SRAM_WITH_ATTR[%s]</name>
          <description>128 word x 16 bit (only 9 usable bits) containing attributes</description>
          <addressOffset>0x400</addressOffset>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>16 bit data field.  Same content as SRAM_DATA.DATA</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>TRIG_INT_STRUCT_PTR</name>
              <description>Pointer to the Trig_Int_Struct entry for this address</description>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>ADDR_INVALID</name>
              <description>This address is valid.  If high, access by iso-UART generates invalid address error</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>ADDR_READONLY</name>
              <description>This address is read-only.  If high, write access by iso-UART generates read only register error</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>RSVD</name>
              <description>N/A</description>
              <bitRange>[24:23]</bitRange>
            </field>
            <field>
              <name>IGNORED</name>
              <description>ECC parity is stored in these bits of the SRAM.  ECC parity is set and read in hardware and are not directly accessible.  Writes to these bits are ignored. Reads always return zero for these bits.

