Infineon/mtb-pdl-cat2/devices/svd/psoc4hvpaspm10.svd
To test ECC functionality, use the ECC_ERR_INJ register</description>
              <bitRange>[31:25]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PHY_REG_TM</name>
          <description>Test Mode Register</description>
          <addressOffset>0xFEFC</addressOffset>
          <resetMask>0x0000E80D</resetMask>
          <fields>
            <field>
              <name>EN_PHY_HS_TM</name>
              <description>Enable PHY HS Test Mode</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FRC_HS_EN_TR</name>
              <description>Force PHY HS EN_TR</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>FRC_HS_PD_REC</name>
              <description>Force PHY HS PD_REC</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EN_PHY_LS_TM</name>
              <description>Enable PHY LS Test Mode</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>FRC_LS_EN_TR</name>
              <description>Force PHY LS EN_TR</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRC_LS_PD_REC</name>
              <description>Force PHY LS PD_REC</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FRC_HS_LS_WAKE_RESET</name>
              <description>Force PHY HS &amp; LS WAKE_RESET</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIM_PHY_V_HS</name>
          <description>Internal Voltage Trim for HS PHY</description>
          <addressOffset>0xFF00</addressOffset>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>INT_VOLT</name>
              <description>Internal Voltage Trim</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIM_PHY_V_LS</name>
          <description>Internal Voltage Trim for LS PHY</description>
          <addressOffset>0xFF04</addressOffset>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>INT_VOLT</name>
              <description>Internal Voltage Trim</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIM_PHY_ITH_HS</name>
          <description>Current Trim for HS PHY</description>
          <addressOffset>0xFF08</addressOffset>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>CURR</name>
              <description>Current Trim</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIM_PHY_ITH_LS</name>
          <description>Current Trim for LS PHY</description>
          <addressOffset>0xFF0C</addressOffset>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>CURR</name>
              <description>Current Trim</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PACSS</name>
      <version>1.0</version>
      <description>Programmable Analog Channel Sub-System</description>
      <baseAddress>0x40300000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>1048576</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <dim>4</dim>
          <dimIncrement>65536</dimIncrement>
          <name>DCHAN[%s]</name>
          <description>Digital Channel Configuration</description>
          <addressOffset>0x0</addressOffset>
          <register>
            <name>DCHAN_CTL</name>
            <description>Digital Channel Control</description>
            <addressOffset>0x0</addressOffset>
            <resetValue>0x000000F0</resetValue>
            <resetMask>0xC00003F7</resetMask>
            <fields>
              <field>
                <name>AGC_GAIN_EN</name>
                <description>AGC Gain Enable 

0 - Digital channel uses gain values from dchan configuration
1 - Digital channel uses gain values provided from AGC</description>
                <bitRange>[0:0]</bitRange>
              </field>
              <field>
                <name>PP_EN</name>
                <description>Post Processor Enable

Enables all features of the post processor including the accumulated result register. When disabled the post processor is bypassed.</description>
                <bitRange>[1:1]</bitRange>
              </field>
              <field>
                <name>FIR_EN</name>
                <description>FIR Enable

0 - Disabled
1 - Enabled</description>
                <bitRange>[2:2]</bitRange>
              </field>
              <field>
                <name>FIR_NUM_TAPS</name>
                <description>FIR number of Taps.

FIR_NUM_TAPS + 1 equals the numbers of Taps enabled in the FIR Filter</description>
                <bitRange>[9:4]</bitRange>
              </field>
              <field>
                <name>SEC_EN</name>
                <description>Secondary Channel Enable

Use case is for diagnostic or temperature measurements. When a digital channel is set as secondary, when it is triggered, by a secondary trigger, the conversion of the channel pends until the next primary conversion completes. Secondary channels should always have a higher dchan index than the enabled primary channels associated with the same analog channel (ACHAN).  For example if both dchan0 and dchan1 are  using achan0, then dchan0 should never be set as a secondary channel.
 
