Infineon/mtb-pdl-cat2/devices/svd/psoc4hvpaspm10.svd
0 - digital channel is configured as primary channel 
1 - digital channel is configured as secondary channel</description>
                <bitRange>[30:30]</bitRange>
              </field>
              <field>
                <name>ENABLE</name>
                <description>Enable Digital Channel</description>
                <bitRange>[31:31]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>SMP_CTL</name>
            <description>Sample Control</description>
            <addressOffset>0x4</addressOffset>
            <resetMask>0x7FFDF7F1</resetMask>
            <fields>
              <field>
                <name>ACHAN_SEL</name>
                <description>Analog Channel Selection

Select which analog to use with this digital channel.

 0 - Analog Channel 0
 1 - Analog Channel 1</description>
                <bitRange>[0:0]</bitRange>
              </field>
              <field>
                <name>POS_PIN_SEL</name>
                <description>Positive Pin Select ( Sequencer controlled)</description>
                <bitRange>[10:4]</bitRange>
              </field>
              <field>
                <name>NEG_PIN_SEL</name>
                <description>Negative Pin Select</description>
                <bitRange>[16:12]</bitRange>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_VSSA</name>
                    <description>0x00 - vssa</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_VSSA_K0</name>
                    <description>0x08 - vssa_k0, unused (floating)</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_VSSA_K1</name>
                    <description>0x09 - vssa_k1, vrefl</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_VSSA_K2</name>
                    <description>0x0A - vssa_k2, srss_vss</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_VSSA_K3</name>
                    <description>0x0B - vssa_k3, vdiv_ret</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_VSSA_K4</name>
                    <description>0x0C - vssa_k4, vts_ret</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_VSSA_K5</name>
                    <description>0x0D - vssa_k5, vtint_ret</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_VSSA_K6</name>
                    <description>0x0E - vssa_k6, gpio0</description>
                    <value>14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_VSSA_K7</name>
                    <description>0x0F - vssa_k7, gpio2</description>
                    <value>15</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_RSL0</name>
                    <description>0x10 - rsl0</description>
                    <value>16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_RSL1</name>
                    <description>0x18 - rsl1</description>
                    <value>24</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_AMUXA</name>
                    <description>0x1A - amuxbusa, if selected pos_pin_sel should be set to amuxbusb</description>
                    <value>26</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_AMUXB</name>
                    <description>0x1B - amuxbusb, if selected pos_pin_sel should be set to amuxbusa</description>
                    <value>27</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BYPASS_AAF</name>
                <description>Bypass the Anti-Aliasing Filter

Open SW1, SW2, SW4, and close SW3 of the AAF during this channels conversion</description>
                <bitRange>[18:18]</bitRange>
              </field>
              <field>
                <name>AAF_SHORT_R_EN</name>
                <description>Automatically short the Anti-Aliasing Filter  resistor during the channel selection delay. The expectation is that his will decrease the required settling time. Has no affect if BYPASS_AAF=1</description>
                <bitRange>[19:19]</bitRange>
              </field>
              <field>
                <name>CH_SEL_DLY</name>
                <description>Channel Selection Delay. The value written to this field,  plus 1, is the number of DSM clock cycles that will be inserted after the virtual channel configuration is loaded and before the decimator is started. Ex: write 7 for 8 clock cycles.</description>
                <bitRange>[27:20]</bitRange>
              </field>
              <field>
                <name>AVG_MODE</name>
                <description>N/A</description>
                <bitRange>[29:28]</bitRange>
              </field>
              <field>
                <name>MOV_SUM</name>
                <description>Moving Sum

0 - Off
1 - When AVG_MODE is enabled, no right shift occurs to divided result.
Ex. If AVG_MODE=1 then the result is the sum of the last two samples. This register takes no affect when AVG_MODE=0.</description>
                <bitRange>[30:30]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>SMP_REF_CTL</name>
            <description>Sample Reference Control</description>
            <addressOffset>0x8</addressOffset>
            <resetMask>0x00070137</resetMask>
            <fields>
              <field>
                <name>VREFH_SEL</name>
                <description>VREFH selection</description>
                <bitRange>[2:0]</bitRange>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>VREFH_SEL_VREFH_DIRECT</name>
                    <description>VREFH Direct (HPBGR)</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VREFH_SEL_VREFH_BUFFERED</name>
                    <description>VREFH Buffered (HPBGR)</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VREFH_SEL_SRSS</name>
                    <description>VREF SRSS</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VREFH_SEL_VTS_REF</name>
                    <description>VTS_REF</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VREFH_SEL_VDDA_DIV4</name>
                    <description>VDDA/4</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VREF_HSEL_VDDA_DIV3</name>
                    <description>VDDA/3</description>
                    <value>5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VREFL_SEL</name>
                <description>VREFL selection</description>
                <bitRange>[5:4]</bitRange>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>VREFL_SEL_VREFL</name>
                    <description>VREFL</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VREFL_SEL_VSSA_SRSS</name>
                    <description>VSSA_SRSS</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VREFL_SEL_VSSA_KELVIN</name>
                    <description>VSSA_KELVIN</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VREFL_SEL_VTS_RET</name>
                    <description>VTS_RET</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VREF_BUF_EN</name>
                <description>VREF Buffer Enable

