Infineon/mtb-pdl-cat2/devices/svd/psoc4hvpaspm10.svd
VREF_BUF_EN should only be used when a reference other than the default reference (HPBGR 0.1 percent reference) is used.  When the HPBGR reference is used, the reference is provided directly from the HPBGR with the help from external cap for the transients.

If this bit is set on a secondary channel, vref_buf_en for the assigned analog channel will be set once the secondary channel is pended to allow enough ramp up time of the VREFH buffer so that it is ready to sample once the secondary channel is ready to convert. The required ramp-up time of the VREFH buffer is 6 us, it is on the user to ensure the secondary channel is pended early enough to ensure this ramp-up time if the associated primary channel does not have this bit set.</description>
                <bitRange>[8:8]</bitRange>
              </field>
              <field>
                <name>RS_PULLUP_SEL</name>
                <description>Resistor Pull-up Select

Based on the selection, the pin is pulled-up to VDDA via 4k-ohm (typ) resistor for open wire detection.</description>
                <bitRange>[17:16]</bitRange>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>RS_PULLUP_SEL_RSH1</name>
                    <description>RSH[1] Pull-up Selected</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RS_PULLUP_SEL_RSH0</name>
                    <description>RSH[0] Pull-up Selected</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RS_PULLUP_SEL_RSL1</name>
                    <description>RSL[1] Pull-up Selected</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RS_PULLUP_SEL_RSL0</name>
                    <description>RSL[0] Pull-up Selected</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RS_PULLUP_EN</name>
                <description>Resistor Pull-up Enable</description>
                <bitRange>[18:18]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>DEC_CTL</name>
            <description>Decimator Control</description>
            <addressOffset>0xC</addressOffset>
            <resetValue>0x000053F0</resetValue>
            <resetMask>0xFFF1FFFF</resetMask>
            <fields>
              <field>
                <name>SINC_MODE</name>
                <description>Decimator Sinc Mode

0 - Sinc3, Decimator is configured as a 3-state CIC decimation filter
1 - Sinc4, Decimator is configured as a 4-stage CIC decimation filter</description>
                <bitRange>[0:0]</bitRange>
              </field>
              <field>
                <name>CONV_MODE</name>
                <description>Conversion Mode

0 - Incremental (Single Sample)
1 - Continuous

This bit can be cleared during a continuous conversion to end the sample.

In the expected use case: Primary channels should use Continuous, while secondary channels should be set to Incremental.</description>
                <bitRange>[1:1]</bitRange>
              </field>
              <field>
                <name>OCOR_EN</name>
                <description>Offset Correction Enable

This bit controls the offset correction feature of the Decimator filter.  The offset value is programmed in the OCOR bits of the OFST_COR register. Conversion results are unpredictable if this bit is changed while the filter is running.

This must be set to use DCHAN.OFST_COR or GAIN_LVL_STRUCT.OFST_COR, which one it chooses is based on DCHAN_CTL.AGC_GAIN_EN.

If OCOR_EN and GCOR_EN are both disabled this prevents the capability to loop back the data valid HW trigger of this channel and use it as the conversion start HW trigger of this channel. If either GCOR or OCOR is enabled this is allowed.</description>
                <bitRange>[2:2]</bitRange>
              </field>
              <field>
                <name>GCOR_EN</name>
                <description>Gain Correction Enable

This bit controls the gain correction feature of the Decimator filter. The gain coefficient is programmed in the GCOR bits of the GAIN_COR register. Which bits in this 16-bit field that are valid is set in GVAL. Conversion results are unpredictable if this bit is changed while the filter is running. When this feature is enabled, the DR register field must be set to a value higher than 32 (worst case) for proper operation. See the DR register definition of cases where values less than 32 are allowed.

This must be set to use DCHAN.GAIN_COR or GAIN_LVL_STRUCT.GAIN_COR.  
The value chosen, is based on DCHAN_CTL.AGC_GAIN_EN

If OCOR_EN and GCOR_EN are both disabled this prevents the capability to loop back the data valid HW trigger of this channel and use it as the conversion start HW trigger of this channel. If either GCOR or OCOR is enabled this is allowed.</description>
                <bitRange>[3:3]</bitRange>
              </field>
              <field>
                <name>DR</name>
                <description>Decimation Ratio

DR is an 7-bit field that sets the decimation ratio (DR+1) in the  sinc3/sinc4 CIC filter.  The decimation ratio minus one is the value that is programmed into this register.

Changing this field during a conversion will disrupt the output value. Conversion results are unpredictable if these bits are changed while the filter is running.

The suggested minimum value of DR is 0x3F. 
If a lower value is required, the minimum DR is determined by GVAL if gain is enabled.

DR &gt; (GCOR_COR.GVAL) * 2 when GCOR_EN is set to 1.

An example of some acceptable values for DR/DR2:

Data Rate:           DR+1:          DR2+1: 
 48ksps                   64                 1
   8ksps                   64                 6
   4ksps                  128                6
   2ksps                  128               12
   1ksps                  128               24</description>
                <bitRange>[10:4]</bitRange>
              </field>
              <field>
                <name>SAT_EN</name>
                <description>Saturation Enable

Controls saturation logic in the Decimator. When enabled, gain and offset calculations are held to the most positive or negative values, rather then wrapping around. Conversion results are unpredictable if this bit is changed while during a conversion. This bit is ignored if OCOR_EN and GCOR_EN are all 0. This feature is used to prevent wrap-around if the decimator is incorrectly configured. This bit should be set to 1 if OCOR_EN or GCOR_EN is set to 1.</description>
                <bitRange>[11:11]</bitRange>
              </field>
              <field>
                <name>DR2</name>
                <description>Decimation Ratio 2 

