Infineon/mtb-pdl-cat2/devices/svd/psoc4hvpaspm10.svd
DR2 is a 5-bit field that sets the decimation ratio (DR2+1) of the sinc2 rate reducer within the Decimator. The decimation ratio of the rate reducer minus one is the value that is programmed into this register. This field should not be changed during a conversion.

DR2 must be less than DR/2.

An example of some acceptable values for DR/DR2:

Data Rate:           DR+1:          DR2+1: 
 48ksps                   64                 1
   8ksps                   64                 6
   4ksps                  128                6
   2ksps                  128               12
   1ksps                  128               24</description>
                <bitRange>[16:12]</bitRange>
              </field>
              <field>
                <name>SHIFTL</name>
                <description>Shift Left (Scaler)

Value for left shift amount of modulator input data. Supported values are 0 - 9. Using values 10-15 may result in a loss of data

This register provides control information to the input (left) shifter. SHIFTL is a 4-bit field that sets the amount of left shift that the Modulator input will be shifted. Disturbing this field during a conversion will disturb the output value. This register should only be updated while the CIC filter is in the Standby state. Conversion results are unpredictable if these bits are changed while the filter is running. A read of this register produces the last value written to this register.

This value is overridden by the Gain Level setting when DCHAN_CTL.AGC_GAIN_EN=1</description>
                <bitRange>[23:20]</bitRange>
              </field>
              <field>
                <name>DEC_SHIFTR</name>
                <description>Decimator Output Right Shift

The maximum data path of the sinc4 filter is 42-bits. This shift register is used to align the resolution down to 32-bits,  otherwise the MSB bits will be truncated. 

To avoid truncation of relevant bits, the min value for this register should be:
log2(qlev) + max(SHIFTL) + N*log2(DR +1) - (32 - log2(U))

Where U = 1 for moving sum disabled, 2 for moving sum with avg mode=2 samples, and 4 for moving sum w/ avg mode =4 samples

where N = # of sinc stages (either 3 or 4 depending on sinc_mode field).
In the equation above DR and DR2 are the values used in register programming (decimation ratios minus one)</description>
                <bitRange>[27:24]</bitRange>
              </field>
              <field>
                <name>RR_SHIFTR</name>
                <description>Rate Reducer Output Right Shift

The maximum data path of the sinc2 rate reducer filter is 42-bits . This shift register is used to align the resolution down to 32-bits, otherwise the MSB bits will be truncated.

To avoid truncation of relevant bits, the min value for this register should be:
log2(qlev) + max(SHIFTL) + N*log2(DR +1)  +2*log2(DR2+1) - DEC_SHIFTR - (32 - log2(U))

Where U = 1 for moving sum disabled, 2 for moving sum with avg mode=2 samples, and 4 for moving sum w/ avg mode =4 samples

where  DR2 is the values used in register programming (decimation ratios minus one)</description>
                <bitRange>[31:28]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>PP_CTL</name>
            <description>Post Processing Control</description>
            <addressOffset>0x10</addressOffset>
            <resetValue>0x04000000</resetValue>
            <resetMask>0xFF33010F</resetMask>
            <fields>
              <field>
                <name>PP_SHIFTR</name>
                <description>Post Processor Right Shift

Value for the amount of right shift for the input of the post processor (output of the FIR filter). The right shift operation is the first Post Processor operation. Processor. Functional values range from 0 to 15, 0 = no shift. This shift value will be based on the values of the FIR coefficients and the number of FIR taps. If the FIR is disabled, this value can be 0.

If the FIR is enabled this shift value can be calculated by using the following:

datapath bandwith:
dp_bw =  log2(qlev) + max(SHIFTL) + N*log2(DR +1)  +2*log2(DR2+1) - DEC_SHIFTR - RR_SHIFTR

FIR datapath adjustment:
fir_dp_adj  = log2(coeff[0] + coeff[1] + ... + coeff[n])

pp_shiftr =  dp_bw + fir_adj -32</description>
                <bitRange>[3:0]</bitRange>
              </field>
              <field>
                <name>CLAMP</name>
                <description>Clamp

0 - Disabled (32-bit result)
1 - Clamps Result Data to 24-bits

When enabled the max positive value will be clamped to 0x7FFFFF and the max negative value will be clamped to 0x800000.</description>
                <bitRange>[8:8]</bitRange>
              </field>
              <field>
                <name>RANGE_DET_EN</name>
                <description>N/A</description>
                <bitRange>[17:16]</bitRange>
              </field>
              <field>
                <name>RANGE_COND</name>
                <description>Range Condition Select

0  - result &lt; RANGE_LOW
1 - RANGE_LOW &lt;= result &lt; RANGE_HIGH
2 - RANGE_HIGH &lt;= result
3 - result &lt; RANGE_LOW || RANGE_HIGH &lt;= result</description>
                <bitRange>[21:20]</bitRange>
              </field>
              <field>
                <name>RANGE_CNT_VAL</name>
                <description>Range Detection Count Value

This register limits RANGE_INTR from asserting unless enough range detections have occurred. It is only used when  RANGE_DET_EN=2'b10 mode. The range detection  counter increments when a sample meets the range condition and decrements otherwise. When the range detection counter matches the RANGE_CNT_VAL the RANGE_INTR is asserted.</description>
                <bitRange>[31:24]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>OFST_COR</name>
            <description>Offset Correction register</description>
            <addressOffset>0x14</addressOffset>
            <resetMask>0x000FFFFF</resetMask>
            <fields>
              <field>
                <name>OCOR</name>
                <description>Decimator Offset Correction Coefficient

