Infineon/mtb-pdl-cat2/devices/svd/psoc4hvpaspm10.svd
          <register>
            <name>CAP_CFG2</name>
            <description>Capacitor Configuration 2 register</description>
            <addressOffset>0x30</addressOffset>
            <resetMask>0x00F7771F</resetMask>
            <fields>
              <field>
                <name>SUMCAPIN</name>
                <description>The summer capacitance that lies on the path where the input signal is summed (50fF to 1.6pF in 50f steps)</description>
                <bitRange>[4:0]</bitRange>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SUMCAPIN_50fF</name>
                    <description>50fF</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPIN_100fF</name>
                    <description>100fF</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPIN_150fF</name>
                    <description>150fF</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPIN_200fF</name>
                    <description>200fF</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPIN_250fF</name>
                    <description>250fF</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPIN_300fF</name>
                    <description>300fF</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPIN_350fF</name>
                    <description>350fF</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPIN_400fF</name>
                    <description>400fF</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPIN_450fF</name>
                    <description>450fF</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPIN_500fF</name>
                    <description>500fF</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPIN_550fF</name>
                    <description>550fF</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPIN_600fF</name>
                    <description>600fF</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPIN_650fF</name>
                    <description>650fF</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPIN_700fF</name>
                    <description>700fF</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPIN_750fF</name>
                    <description>750fF</description>
                    <value>14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPIN_800fF</name>
                    <description>800fF</description>
                    <value>15</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPIN_850fF</name>
                    <description>850fF</description>
                    <value>16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPIN_900fF</name>
                    <description>900fF</description>
                    <value>17</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPIN_950fF</name>
                    <description>950fF</description>
                    <value>18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPIN_1000fF</name>
                    <description>1000fF</description>
                    <value>19</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPIN_1050fF</name>
                    <description>1050fF</description>
                    <value>20</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPIN_1100fF</name>
                    <description>1100fF</description>
                    <value>21</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPIN_1150fF</name>
                    <description>1150fF</description>
                    <value>22</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPIN_1200fF</name>
                    <description>1200fF</description>
                    <value>23</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPIN_1250fF</name>
                    <description>1250fF</description>
                    <value>24</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPIN_1300fF</name>
                    <description>1300fF</description>
                    <value>25</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPIN_1350fF</name>
                    <description>1350fF</description>
                    <value>26</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPIN_1400fF</name>
                    <description>1400fF</description>
                    <value>27</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPIN_1450fF</name>
                    <description>1450fF</description>
                    <value>28</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPIN_1500fF</name>
                    <description>1500fF</description>
                    <value>29</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPIN_1550fF</name>
                    <description>1550fF</description>
                    <value>30</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPIN_1600fF</name>
                    <description>1600fF</description>
                    <value>31</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SUMCAP1</name>
                <description>The summer capacitance that lies on the feed-forward path from the first integrator output (0fF to 350f, 50fF steps)</description>
                <bitRange>[10:8]</bitRange>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SUMCAP1_50fF</name>
                    <description>50fF</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAP1_100fF</name>
                    <description>100fF</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAP1_150fF</name>
                    <description>150fF</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAP1_200fF</name>
                    <description>200fF</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAP1_250fF</name>
                    <description>250fF</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAP1_300fF</name>
                    <description>300fF</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAP1_350fF</name>
                    <description>350fF</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAP1_400fF</name>
                    <description>400fF</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SUMCAP2</name>
                <description>The summer capacitance that lies on the feed-forward path from the second integrator output (0fF to 350 in 50fF steps)</description>
                <bitRange>[14:12]</bitRange>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SUMCAP2_50fF</name>
                    <description>50fF</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAP2_100fF</name>
                    <description>100fF</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAP2_150fF</name>
                    <description>150fF</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAP2_200fF</name>
                    <description>200fF</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAP2_250fF</name>
                    <description>250fF</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAP2_300fF</name>
                    <description>300fF</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAP2_350fF</name>
                    <description>350fF</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAP2_400fF</name>
                    <description>400fF</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SUMCAP3</name>
                <description>The summer capacitance that lies on the feed-forward path from the third integrator output (0fF to 350fF in 50fF step)</description>
                <bitRange>[18:16]</bitRange>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SUMCAP3_50fF</name>
                    <description>50fF</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAP3_100fF</name>
                    <description>100fF</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAP3_150fF</name>
                    <description>150fF</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAP3_200fF</name>
                    <description>200fF</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAP3_250fF</name>
                    <description>250fF</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAP3_300fF</name>
                    <description>300fF</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAP3_350fF</name>
                    <description>350fF</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAP3_400fF</name>
                    <description>400fF</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SUMCAPFB</name>
                <description>The summer feedback capacitance</description>
                <bitRange>[23:20]</bitRange>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SUMCAPFB_50fF</name>
                    <description>50fF</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPFB_100fF</name>
                    <description>100fF</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPFB_150fF</name>
                    <description>150fF</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPFB_200fF</name>
                    <description>200fF</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPFB_250fF</name>
                    <description>250fF</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPFB_300fF</name>
                    <description>300fF</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPFB_350fF</name>
                    <description>350fF</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPFB_400fF</name>
                    <description>400fF</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPFB_450fF</name>
                    <description>450fF</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPFB_500fF</name>
                    <description>500fF</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPFB_550fF</name>
                    <description>550fF</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPFB_600fF</name>
                    <description>600fF</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPFB_650fF</name>
                    <description>650fF</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPFB_700fF</name>
                    <description>700fF</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPFB_750fF</name>
                    <description>750fF</description>
                    <value>14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUMCAPFB_800fF</name>
                    <description>800fF</description>
                    <value>15</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ACC_THRESH</name>
            <description>Accumulated Data Threshold</description>
            <addressOffset>0x34</addressOffset>
            <resetValue>0x7FFFFFFF</resetValue>
            <fields>
              <field>
                <name>ACC_THRESH</name>
                <description>Accumulated Threshold

Once the ACC_RESULT register surpasses the threshold value written to this register the ACC_RESULT the ACC_THRESH_INTR is set. This value is signed and follows the two's-complement notation. 

If ACC_THRESH is set to a positive value, the ACC_RESULT must surpass the positive value of the ACC_THRESH to set the ACC_THRESH_INTR.

If ACC_THRESH is set to a negative value, the ACC_RESULT must surpass the negative value ( a greater magnitude) of the ACC_THRESH to set the ACC_THRESH_INTR.</description>
                <bitRange>[31:0]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>RESULT</name>
            <description>Channel result data register, updated at the end of each completed conversion</description>
            <addressOffset>0x40</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>RESULT</name>
                <description>Channel Result Data Register (signed)

This is a two's complement value that is updated at the end of each completed conversion</description>
                <bitRange>[31:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RESULT_TAG</name>
            <description>Tag register associated and updated simultaneously with the RESULT register</description>
            <addressOffset>0x44</addressOffset>
            <access>read-only</access>
            <resetMask>0x07F33F7F</resetMask>
            <fields>
              <field>
                <name>RESULT_PARITY</name>
                <description>Result Parity (ECC Parity)

This 7-bit ECC parity is generated from the 32-bit result data and is updated simultaneously with the result data.</description>
                <bitRange>[6:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SMP_COUNT</name>
                <description>Sample Count

