Infineon/mtb-pdl-cat2/devices/svd/psoc4hvpaspm10.svd
2'h0: low (1.57ns, typ)
2'h1: medium (2.54ns, typ)
2'h2: high (6.47ns, typ)
2'h3: very high (9.91ns, typ)

Default is low, other settings are for risk mitigation</description>
                <bitRange>[3:2]</bitRange>
              </field>
              <field>
                <name>ODET_TH</name>
                <description>Overload detection threshold. If the number of continuous 1s or 0s coming out of quantizer exceeds this number, the overload detection flag is set</description>
                <bitRange>[12:8]</bitRange>
              </field>
              <field>
                <name>OD_EN</name>
                <description>Overload Detect  Enable</description>
                <bitRange>[13:13]</bitRange>
              </field>
              <field>
                <name>MX_DIN</name>
                <description>Select the data source of the Decimator input :

0:  modulator data is selected as input to decimator
1:  dbg_io[3:0] is selected as the input to  the decimator. In this mode  dbg_io[5:4] are outputs. dbg_io[5:4]={modrst, clk_dsm_ana}

Previously named DPMODE</description>
                <bitRange>[14:14]</bitRange>
              </field>
              <field>
                <name>BUF_PGA_FCHOP</name>
                <description>Chopping Clock Frequency selection for Buffer and PGA</description>
                <bitRange>[18:16]</bitRange>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FCLOCKDIV2</name>
                    <description>Fclock/2</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCLOCKDIV4</name>
                    <description>Fclock/4</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCLOCKDIV8</name>
                    <description>Fclock/8</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCLOCKDIV16</name>
                    <description>Fclock/16</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCLOCKDIV32</name>
                    <description>Fclock/32</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCLOCKDIV64</name>
                    <description>Fclock/64</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCLOCKDIV128</name>
                    <description>Fclock/128</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCLOCKDIV256</name>
                    <description>Fclock/256</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BUF_PGA_CHOP_CLK_EN</name>
                <description>Buffer and PGA Chopping Clock  enable for Buffer and PGA 

This bit should be set to 1 by SW in the default use case.</description>
                <bitRange>[19:19]</bitRange>
              </field>
              <field>
                <name>RESET1_EN</name>
                <description>Allow first stage integrating capacitance to be reset. If enabled this reset is triggered by an overload detection</description>
                <bitRange>[20:20]</bitRange>
              </field>
              <field>
                <name>RESET2_EN</name>
                <description>Allow second stage integrating capacitance to be reset.  If enabled this reset is triggered by an overload detection</description>
                <bitRange>[21:21]</bitRange>
              </field>
              <field>
                <name>RESET3_EN</name>
                <description>Allow third stage integrating capacitance to be reset.  If enabled this reset is triggered by an overload detection</description>
                <bitRange>[22:22]</bitRange>
              </field>
              <field>
                <name>MX_DOUT</name>
                <description>Select the DSM data routed to the dbg_io output:

2'h0: none
2'h1: dbg_io[5:0] = {modrst, clk_dsm_ana, dout2scomp[3:0]}
2'h2: dbg_io[5:0] = {ovdcause, ovdflag, agc_gain_lvl[3:0]}
2'h3: dbg_io[5:0] = {modrst, clk_dsm_ana, agc_gain_lvl[3:0]}</description>
                <bitRange>[25:24]</bitRange>
              </field>
              <field>
                <name>FCLOCK_EN</name>
                <description>Modulator Clock Enable (FCLOCK)

By default the modulator clock only runs when converting a sample. Setting FCLOCK_CLK_EN=1 makes FCLOCK free running.</description>
                <bitRange>[28:28]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>BUF_CTL</name>
            <description>Buffer Control</description>
            <addressOffset>0x18</addressOffset>
            <resetValue>0x00000033</resetValue>
            <resetMask>0x00000033</resetMask>
            <fields>
              <field>
                <name>BUF_PWR_LEVELS</name>
                <description>Buffer Power Levels

00 - 32 percent Power Mode
01 - 55 percent Power Mode
10 - 78 percent Power Mode
11 - 100 percent Power Mode</description>
                <bitRange>[1:0]</bitRange>
              </field>
              <field>
                <name>BUF_CHOP_EN</name>
                <description>Buffer chopping enable</description>
                <bitRange>[4:4]</bitRange>
              </field>
              <field>
                <name>BUF_IDAC_EN</name>
                <description>Buffer IDAC enable</description>
                <bitRange>[5:5]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>PUMP_CTL</name>
            <description>Pump Control</description>
            <addressOffset>0x20</addressOffset>
            <resetMask>0x00000033</resetMask>
            <fields>
              <field>
                <name>VNEG_PWR_MODE</name>
                <description>Negative pump power mode.  Trim for risk mitigation, not intended for customer use.</description>
                <bitRange>[1:0]</bitRange>
              </field>
              <field>
                <name>CLOCK_SEL</name>
                <description>Negative Pump Clock selection

The negative pump requires a 24 MHz clock

For bit decode use the following:

00: pump clock sourced by clk_pump/2, use if clk_pump is set to 48MHz
01: pump clock sourced by clk_pump/1, use if clk_pump is set to 24 MHz
10: pump clock sourced by clk_hf/2, use if clk_hf is set to 48 MHz
11: pump clock sourced by clk_hf/1, use if clk_hf is set to 24 MHz</description>
                <bitRange>[5:4]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>REF_CTL</name>
            <description>Reference Control</description>
            <addressOffset>0x24</addressOffset>
            <resetValue>0x0000000A</resetValue>
            <resetMask>0x0000007F</resetMask>
            <fields>
              <field>
                <name>VREF_PWR</name>
                <description>Power control for the voltage reference buffer for the sigma delta ADC</description>
                <bitRange>[1:0]</bitRange>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>VREF_26uA</name>
                    <description>VREF Buffer is operating in Low Power (26 uA) mode</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VREF_32uA</name>
                    <description>VREF Buffer is operating in Medium Power (32 uA) mode</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VREF_118uA</name>
                    <description>VREF Buffer is operating in High Power (118 uA) mode</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VREF_232uA</name>
                    <description>VREF Buffer is operating in Turbo Power (232 uA) mode</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VCM_PWR</name>
                <description>Power Control for the Voltage Common Mode Buffer for the Sigma Delta ADC</description>
                <bitRange>[3:2]</bitRange>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>VCM_18uA</name>
                    <description>VCM Buffer is operating in Low Power (18 uA) mode</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VCM_28uA</name>
                    <description>VCM Buffer is operating in Medium Power (28 uA) mode</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VCM_55uA</name>
                    <description>VCM Buffer is operating in High Power (55 uA) mode</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VCM_114uA</name>
                    <description>VCM Buffer is operating in Turbo Power (114 uA) mode</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VCM_SEL</name>
                <description>N/A</description>
                <bitRange>[5:4]</bitRange>
              </field>
              <field>
                <name>VREF_QTZ_SEL</name>
                <description>VREF_QTZ selection

0 - VREFH CDAC
1 - VCCA_KELVIN</description>
                <bitRange>[6:6]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>START</name>
            <description>Start Conversion</description>
            <addressOffset>0x28</addressOffset>
            <resetMask>0x00000101</resetMask>
            <fields>
              <field>
                <name>START_PRIM</name>
                <description>Start Primary Conversion (FW Trigger) . A write of 1 to this bit starts a  primary conversion. This bit is cleared once the conversion is started. A write of 1 while the sequencer is busy is ignored and the FWT_COLLISION interrupt is set for the digital channels assigned to this sequencer.</description>
                <bitRange>[0:0]</bitRange>
                <modifiedWriteValues>oneToSet</modifiedWriteValues>
              </field>
              <field>
                <name>PEND_SEC</name>
                <description>Pend Secondary Conversion (FW Trigger) A write of 1 to this bit pends a secondary conversion. This bit is cleared after the next primary conversion completes.</description>
                <bitRange>[8:8]</bitRange>
                <modifiedWriteValues>oneToSet</modifiedWriteValues>
              </field>
            </fields>
          </register>
          <register>
            <name>INMUX_CTL</name>
            <description>INMUX Control</description>
            <addressOffset>0x2C</addressOffset>
            <resetMask>0x00011F7F</resetMask>
            <fields>
              <field>
                <name>POS_PIN_SEL</name>
                <description>Positive Pin Select

This register is only functional when the sequencer control of the INMUX is disabled. See SWITCH_SQ_CTL.INMUX. This register is the manual (non-sequencer) configuration of INMUX positive pin selection.</description>
                <bitRange>[6:0]</bitRange>
              </field>
              <field>
                <name>NEG_PIN_SEL</name>
                <description>Negative Pin Select

This register is only functional when the sequencer control of the INMUX is disabled. See SWITCH_SQ_CTL.INMUX. This register is the manual (non-sequencer) configuration of INMUX negative pin selection.</description>
                <bitRange>[12:8]</bitRange>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_VSSA</name>
                    <description>0x00 - vssa</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_VSSA_K0</name>
                    <description>0x08 - vssa_k0, unused (floating)</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_VSSA_K1</name>
                    <description>0x09 - vssa_k1, vrefl</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_VSSA_K2</name>
                    <description>0x0A - vssa_k2, srss_vss</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_VSSA_K3</name>
                    <description>0x0B - vssa_k3, vdiv_ret</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_VSSA_K4</name>
                    <description>0x0C - vssa_k4, vts_ret</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_VSSA_K5</name>
                    <description>0x0D - vssa_k5, vtint_ret</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_VSSA_K6</name>
                    <description>0x0E - vssa_k6, gpio0</description>
                    <value>14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_VSSA_K7</name>
                    <description>0x0F - vssa_k7, gpio2</description>
                    <value>15</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_RSL0</name>
                    <description>0x10 - rsl0</description>
                    <value>16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_RSL1</name>
                    <description>0x18 - rsl1</description>
                    <value>24</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DECODE_EN</name>
                <description>Enables Decode Logic to close switches. This must be set to '1' allow usage of POS_PIN_SEL and NEG_PIN_SEL.  If set to '0' all switches in the INMUX will be open. This register is only applicable when SWITCH_SQ_CTL.INMUX=0</description>
                <bitRange>[16:16]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>DEM_CTL</name>
            <description>Dynamic Element Matching Control</description>
            <addressOffset>0x30</addressOffset>
            <resetValue>0x00000004</resetValue>
            <resetMask>0x00000007</resetMask>
            <fields>
              <field>
                <name>SCRAM0_EN</name>
                <description>Enable Scrambler 0

