Infineon/mtb-pdl-cat2/devices/svd/psoc4hvpaspm10.svd
Number of DSM clock cycles (AAF_BLANK_CNT) where the AAF will either be shorted or disconnected after a gain level change.</description>
                <bitRange>[15:8]</bitRange>
              </field>
              <field>
                <name>DEC_BLANK_CNT</name>
                <description>Decimator Blank Count

Number of DSM clock cycles (DEC_BLANK_CNT) where the decimator will be disconnected from the modulator output stream, and connected to a circular FIFO of the last 32 data values after a gain level change.</description>
                <bitRange>[23:16]</bitRange>
              </field>
              <field>
                <name>SCALER_BLANK_CNT</name>
                <description>Scaler Blank Count 

Number of DSM clock cycles (SCALER_BLANKT_CNT) where the gain scaler of next gain level will be delayed after a gain level change. The scaler will use its previous value until this count value is reached.</description>
                <bitRange>[31:24]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>AGC_CTL2</name>
            <description>Auto-Gain Correction Control 2</description>
            <addressOffset>0xC</addressOffset>
            <resetMask>0xFFFF0001</resetMask>
            <fields>
              <field>
                <name>LO_THRESH_FLT_MODE</name>
                <description>Low Threshold Filter Mode

0 - counter mode 
1 - integrator mode</description>
                <bitRange>[0:0]</bitRange>
              </field>
              <field>
                <name>LO_THRESH_CNT</name>
                <description>Low Threshold Filter Counter 

LO_THRESH_CNT + 1, is the count value used for filtering the next gain level change.</description>
                <bitRange>[31:16]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>AGC_CTL3</name>
            <description>Auto-Gain Correction Control 3</description>
            <addressOffset>0x10</addressOffset>
            <resetMask>0xFFFF0001</resetMask>
            <fields>
              <field>
                <name>HI_THRESH_FLT_MODE</name>
                <description>High Threshold Filter Mode

0 - counter mode 
1 - integrator mode</description>
                <bitRange>[0:0]</bitRange>
              </field>
              <field>
                <name>HI_THRESH_CNT</name>
                <description>High Threshold Filter Counter

HI_THRESH_CNT + 1, is the count value used for filtering the next gain level change.</description>
                <bitRange>[31:16]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>TMPS_CTL</name>
            <description>Temperature Sensor Control</description>
            <addressOffset>0x20</addressOffset>
            <resetMask>0xFB1FF9FF</resetMask>
            <fields>
              <field>
                <name>IREF_UNIT</name>
                <description>Number of units, between 0 (all switches open) and 9
IREF current = 9.6uA * (# of bits set)
Each bit set of IREF_UNIT adds a multiple of 9.6uA.</description>
                <bitRange>[8:0]</bitRange>
              </field>
              <field>
                <name>IREF_SEL</name>
                <description>Temperature Sensor Current Reference Select 

Select between SRSS and AREF current reference
0 - selects AREF as current reference source
1 - selects SRSS as current reference source</description>
                <bitRange>[11:11]</bitRange>
              </field>
              <field>
                <name>BIPOLAR_UNIT</name>
                <description>Number of bipolar transistors,  between 0 (all switches open) and 9
Each bit set of BIPOLAR_UNIT, adds a BIPOLAR transistors 
Only applicable for PNP and NPN load modes</description>
                <bitRange>[20:12]</bitRange>
              </field>
              <field>
                <name>LOAD_MODE</name>
                <description>N/A</description>
                <bitRange>[25:24]</bitRange>
              </field>
              <field>
                <name>AMUXA_SEL</name>
                <description>Select amuxbus_a as a current source for biasing BJTs or Resistor</description>
                <bitRange>[27:27]</bitRange>
              </field>
              <field>
                <name>AMUXB_SEL</name>
                <description>Select amuxbus_b to be connected to temp sensor vbe/vres output.</description>
                <bitRange>[28:28]</bitRange>
              </field>
              <field>
                <name>VTEMP_SUP_SEL</name>
                <description>Select external current source to bias the BJTs or Resistor.</description>
                <bitRange>[29:29]</bitRange>
              </field>
              <field>
                <name>VTEMP_SEL</name>
                <description>Connect VTEMP pin to vbe/vres output voltage.</description>
                <bitRange>[30:30]</bitRange>
              </field>
              <field>
                <name>VTEMP_RET_SEL</name>
                <description>Connect VTEMP_RET pin to the vssa_kelvin of the BJTs and resistor.</description>
                <bitRange>[31:31]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>VPOS_PUMP_CTL</name>
            <description>Positive Pump Control</description>
            <addressOffset>0x24</addressOffset>
            <resetMask>0x0000003F</resetMask>
            <fields>
              <field>
                <name>VPOS_PWR_MODE</name>
                <description>N/A</description>
                <bitRange>[2:0]</bitRange>
              </field>
              <field>
                <name>VPOS_BYPASS_EN</name>
                <description>N/A</description>
                <bitRange>[3:3]</bitRange>
              </field>
              <field>
                <name>CLOCK_SEL</name>
                <description>Positive Pump Clock selection

The positive pump requires a 24 MHz clock

For bit decode use the following:

00: pump clock sourced by clk_pump/2, use if clk_pump is set to 48MHz
01: pump clock sourced by clk_pump/1, use if clk_pump is set to 24 MHz
10: pump clock sourced by clk_hf/2, use if clk_hf is set to 48 MHz
11: pump clock sourced by clk_hf/1, use if clk_hf is set to 24 MHz</description>
                <bitRange>[5:4]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>START</name>
            <description>Start Conversion</description>
            <addressOffset>0x30</addressOffset>
            <resetMask>0x00000101</resetMask>
            <fields>
              <field>
                <name>START_PRIM</name>
                <description>Start Primary Conversion (FW Trigger) . A write of 1 to this bit starts a  primary conversion on both sequencers simultaneously. This bit is cleared once the conversion is started. A write of 1 while the sequencer(s) is busy is ignored and the FWT_COLLISION interrupt is set for the digital channels assigned to sequencer(s) that are busy.</description>
                <bitRange>[0:0]</bitRange>
                <modifiedWriteValues>oneToSet</modifiedWriteValues>
              </field>
              <field>
                <name>PEND_SEC</name>
                <description>Pend Secondary Conversion (FW Trigger) A write of 1 to this bit pends a secondary conversion. This bit is cleared after the next primary conversion completes.</description>
                <bitRange>[8:8]</bitRange>
                <modifiedWriteValues>oneToSet</modifiedWriteValues>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR</name>
            <description>System Interrupt request register</description>
            <addressOffset>0x40</addressOffset>
            <resetMask>0x00007701</resetMask>
            <fields>
              <field>
                <name>AGC_GLVL_CHG</name>
                <description>AGC Gain Level Change Interrupt 

Hardware sets this interrupt when a gain level change occurs.  Write with '1' to clear bit.</description>
                <bitRange>[0:0]</bitRange>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>OCD0_TRIGGER</name>
                <description>Over Current Detection 0 Trigger Interrupt

Hardware sets this interrupt when an over current detection trigger occurs.  Write with '1' to clear bit.</description>
                <bitRange>[8:8]</bitRange>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>OCD0_UNFILTERED</name>
                <description>Over Current Detection 0 Unfiltered Interrupt

