Infineon/mtb-pdl-cat2/devices/svd/psoc4hvpaspm10.svd
Hardware sets this interrupt when either ocd_pos_out or ocd_neg_out is asserted.  Write with '1' to clear bit.</description>
                <bitRange>[9:9]</bitRange>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>OCD0_FAULT</name>
                <description>Over Current Detection 0 Fault Interrupt

Hardware sets this interrupt when there is a fault in the Over Current Detection Glitch Filter as defined in tables 4 and 5 in BROS .  Write with '1' to clear bit.</description>
                <bitRange>[10:10]</bitRange>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>OCD1_TRIGGER</name>
                <description>Over Current Detection 1 Trigger Interrupt

Hardware sets this interrupt when an over current detection trigger occurs.  Write with '1' to clear bit.</description>
                <bitRange>[12:12]</bitRange>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>OCD1_UNFILTERED</name>
                <description>Over Current Detection 1 Unfiltered Interrupt

Hardware sets this interrupt when either ocd_pos_out or ocd_neg_out is asserted.  Write with '1' to clear bit.</description>
                <bitRange>[13:13]</bitRange>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>OCD1_FAULT</name>
                <description>Over Current Detection 1 Fault Interrupt

Hardware sets this interrupt when there is a fault in the Over Current Detection Glitch Filter as defined in tables 4 and 5 in BROS .  Write with '1' to clear bit.</description>
                <bitRange>[14:14]</bitRange>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR_SET</name>
            <description>System Interrupt set request register</description>
            <addressOffset>0x44</addressOffset>
            <resetMask>0x00007701</resetMask>
            <fields>
              <field>
                <name>AGC_GLVL_CHG_SET</name>
                <description>Write with '1' to set corresponding bit in interrupt request register.</description>
                <bitRange>[0:0]</bitRange>
                <modifiedWriteValues>oneToSet</modifiedWriteValues>
              </field>
              <field>
                <name>OCD0_TRIGGER_SET</name>
                <description>Write with '1' to set corresponding bit in interrupt request register.</description>
                <bitRange>[8:8]</bitRange>
                <modifiedWriteValues>oneToSet</modifiedWriteValues>
              </field>
              <field>
                <name>OCD0_UNFILTERED_SET</name>
                <description>Write with '1' to set corresponding bit in interrupt request register.</description>
                <bitRange>[9:9]</bitRange>
                <modifiedWriteValues>oneToSet</modifiedWriteValues>
              </field>
              <field>
                <name>OCD0_FAULT_SET</name>
                <description>Write with '1' to set corresponding bit in interrupt request register.</description>
                <bitRange>[10:10]</bitRange>
                <modifiedWriteValues>oneToSet</modifiedWriteValues>
              </field>
              <field>
                <name>OCD1_TRIGGER_SET</name>
                <description>Write with '1' to set corresponding bit in interrupt request register.</description>
                <bitRange>[12:12]</bitRange>
                <modifiedWriteValues>oneToSet</modifiedWriteValues>
              </field>
              <field>
                <name>OCD1_UNFILTERED_SET</name>
                <description>Write with '1' to set corresponding bit in interrupt request register.</description>
                <bitRange>[13:13]</bitRange>
                <modifiedWriteValues>oneToSet</modifiedWriteValues>
              </field>
              <field>
                <name>OCD1_FAULT_SET</name>
                <description>Write with '1' to set corresponding bit in interrupt request register.</description>
                <bitRange>[14:14]</bitRange>
                <modifiedWriteValues>oneToSet</modifiedWriteValues>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR_MASK</name>
            <description>System Interrupt mask register</description>
            <addressOffset>0x48</addressOffset>
            <resetMask>0x00007701</resetMask>
            <fields>
              <field>
                <name>AGC_GLVL_CHG_MASK</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[0:0]</bitRange>
              </field>
              <field>
                <name>OCD0_TRIGGER_MASK</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[8:8]</bitRange>
              </field>
              <field>
                <name>OCD0_UNFILTERED_MASK</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[9:9]</bitRange>
              </field>
              <field>
                <name>OCD0_FAULT_MASK</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[10:10]</bitRange>
              </field>
              <field>
                <name>OCD1_TRIGGER_MASK</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[12:12]</bitRange>
              </field>
              <field>
                <name>OCD1_UNFILTERED_MASK</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[13:13]</bitRange>
              </field>
              <field>
                <name>OCD1_FAULT_MASK</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[14:14]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR_MASKED</name>
            <description>System Interrupt masked request register</description>
            <addressOffset>0x4C</addressOffset>
            <access>read-only</access>
            <resetMask>0x00007701</resetMask>
            <fields>
              <field>
                <name>AGC_GLVL_CHG_MASKED</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>OCD0_TRIGGER_MASKED</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[8:8]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>OCD0_UNFILTERED_MASKED</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[9:9]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>OCD0_FAULT_MASKED</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[10:10]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>OCD1_TRIGGER_MASKED</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[12:12]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>OCD1_UNFILTERED_MASKED</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[13:13]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>OCD1_FAULT_MASKED</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[14:14]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR_CAUSE</name>
            <description>Interrupt Cause Register</description>
            <addressOffset>0x50</addressOffset>
            <access>read-only</access>
            <resetMask>0x0000001F</resetMask>
            <fields>
              <field>
                <name>DCH0_INT</name>
                <description>Digital Channel 0 Interrupt Pending</description>
                <bitRange>[0:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>DCH1_INT</name>
                <description>Digital Channel 1 Interrupt Pending</description>
                <bitRange>[1:1]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>DCH2_INT</name>
                <description>Digital Channel 2 Interrupt Pending</description>
                <bitRange>[2:2]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>DCH3_INT</name>
                <description>Digital Channel 3 Interrupt Pending</description>
                <bitRange>[3:3]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>PACSS_INT</name>
                <description>System (PACSS_MMIO) Interrupt Pending</description>
                <bitRange>[4:4]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUS0</name>
            <description>Status Register 0</description>
            <addressOffset>0x60</addressOffset>
            <access>read-only</access>
            <resetMask>0x000FFFF3</resetMask>
            <fields>
              <field>
                <name>SEQ_BUSY</name>
                <description>Sequencer Busy, bit per analog channel</description>
                <bitRange>[1:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>AGC_CURR_GLVL</name>
                <description>AGC Current gain level</description>
                <bitRange>[7:4]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>AGC_FAST_DEC_RESULT</name>
                <description>AGC Fast Decimator Result</description>
                <bitRange>[19:8]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUS1</name>
            <description>Status Register 1</description>
            <addressOffset>0x64</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>LO_THRESH_CNTR</name>
                <description>Status of Low threshold counter</description>
                <bitRange>[15:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>HI_THRESH_CNTR</name>
                <description>Status of High threshold counter</description>
                <bitRange>[31:16]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <cluster>
            <dim>10</dim>
            <dimIncrement>16</dimIncrement>
            <name>GAINLVL_STRUCT[%s]</name>
            <description>Gain Level Configuration</description>
            <addressOffset>0x100</addressOffset>
            <register>
              <name>GAIN_CFG0</name>
              <description>Gain configuration register 0</description>
              <addressOffset>0x0</addressOffset>
              <resetMask>0x3F3F00F7</resetMask>
              <fields>
                <field>
                  <name>PGA_GAIN</name>
                  <description>Gain setting of 1,2,4,8,16, 32 are supported</description>
                  <bitRange>[2:0]</bitRange>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>GAIN_1X</name>
                      <description>1x</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>GAIN_2X</name>
                      <description>2x</description>
                      <value>1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>GAIN_4X</name>
                      <description>4x</description>
                      <value>2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>GAIN_8X</name>
                      <description>8x</description>
                      <value>3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>GAIN_16X</name>
                      <description>16x</description>
                      <value>4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>GAIN_32X</name>
                      <description>32x</description>
                      <value>5</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>SHIFT1</name>
                  <description>Value for left shift amount (see SHIFTL in DEC_CTL)</description>
                  <bitRange>[7:4]</bitRange>
                </field>
                <field>
                  <name>DACCAP</name>
                  <description>Binary weighted first stage DAC capacitance</description>
                  <bitRange>[21:16]</bitRange>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DACCAP_min</name>
                      <description>Min Value = 96 fF</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DACCAP_max</name>
                      <description>Max Value = 6.4 pF</description>
                      <value>63</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DACCAP_96fF</name>
                      <description>DACCAP[0] set -&gt; add 12*8= +96 fF</description>
                      <value>1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DACCAP_192fF</name>
                      <description>DACCAP[1] set -&gt; add 24*8= +192 fF</description>
                      <value>2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DACCAP_400fF</name>
                      <description>DACCAP[2] set -&gt; add 50*8= +400 fF</description>
                      <value>4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DACCAP_800fF</name>
                      <description>DACCAP[3] set -&gt; add 100*8= +800 fF</description>
                      <value>8</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DACCAP_1600fF</name>
                      <description>DACCAP[4] set -&gt; add 200*8= +1600 fF</description>
                      <value>16</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DACCAP_3200fF</name>
                      <description>DACCAP[5] set -&gt; add 400*8= +3200 fF</description>
                      <value>32</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>IPCAP1</name>
                  <description>Binary weighted first stage integrating capacitance</description>
                  <bitRange>[29:24]</bitRange>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>IPCAP1_min</name>
                      <description>Min Value = 100 fF</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>IPCAP1_max</name>
                      <description>Max Value = 6.4 pF</description>
                      <value>63</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>IPCAP1_100fF</name>
                      <description>IPCAP1[0] set -&gt; +100 fF</description>
                      <value>1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>IPCAP1_200fF</name>
                      <description>IPCAP1[1] set -&gt; +200 fF</description>
                      <value>2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>IPCAP1_400fF</name>
                      <description>IPCAP1[2] set -&gt; +400 fF</description>
                      <value>4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>IPCAP1_80fF</name>
                      <description>IPCAP1[3] set -&gt; +800 fF</description>
                      <value>8</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>IPCAP1_1600fF</name>
                      <description>IPCAP1[4] set -&gt; +1600 fF</description>
                      <value>16</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>IPCAP1_3200fF</name>
                      <description>IPCAP1[5] set -&gt; +3200 fF</description>
                      <value>32</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
