Infineon/mtb-pdl-cat2/devices/svd/psoc4hvpaspm10.svd
          <register>
            <name>AREF_DFT_CTL</name>
            <description>Analog Reference DFT Control</description>
            <addressOffset>0x610</addressOffset>
            <resetMask>0x00713F17</resetMask>
            <fields>
              <field>
                <name>DFT_SOURCE</name>
                <description>N/A</description>
                <bitRange>[2:0]</bitRange>
              </field>
              <field>
                <name>DFT_SUM</name>
                <description>DFT outputs sum (0: Single currents to ADFT, 1: Sum of all currents of type selected by DFT_SOURCE are sent to ADFT)</description>
                <bitRange>[4:4]</bitRange>
              </field>
              <field>
                <name>DFT_CURR_SEL</name>
                <description>Selects which single current from DFT_SOURCE type to send to ADFT. (0: first current, 1: second current, etc, to max of available currents)</description>
                <bitRange>[11:8]</bitRange>
              </field>
              <field>
                <name>DFT_RSEL</name>
                <description>DFT Resistor Select

For applying an internal pulldown resistor on the current output to amuxbus. When the pulldown is activated, both amuxbus_a and amuxbus_b connect to the resistor, allowing for kelvin connection to measure the resistor.

0 - No resistor (current output only)
1 - 10k resistor pulldown
2 - 200k resistor pulldown
3 - 1.2M resistor pulldown</description>
                <bitRange>[13:12]</bitRange>
              </field>
              <field>
                <name>DFT_OUT_SEL</name>
                <description>ADFT output select (0: to amuxbusa, 1: to amuxbusb)</description>
                <bitRange>[16:16]</bitRange>
              </field>
              <field>
                <name>AREF_SPARE</name>
                <description>N/A</description>
                <bitRange>[22:20]</bitRange>
              </field>
            </fields>
          </register>
          <cluster>
            <dim>2</dim>
            <dimIncrement>16</dimIncrement>
            <name>OCD_STRUCT[%s]</name>
            <description>Over Current Detector Configuration</description>
            <addressOffset>0x700</addressOffset>
            <register>
              <name>OCD_CTL</name>
              <description>Over Current Detector Control</description>
              <addressOffset>0x0</addressOffset>
              <resetMask>0xF31FF01F</resetMask>
              <fields>
                <field>
                  <name>OCD_THRESH</name>
                  <description>Select threshold for overcurrent.  Applies to both POS and NEG comparators. There are 3 shunt resistor categories listed below

25uohm shunt resistor  case.
The thresholds are from 37.5mV = 1500A
to 50.0mV = 2000A.

50uohm shunt resistor  case.
The thresholds are from 75.0mV = 1500A
to 100.0mV = 2000A.

100uohm shunt resistor 
case. The thresholds are
from 150.0mV = 1500A
to 200.0mV = 2000A.</description>
                  <bitRange>[4:0]</bitRange>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>THRESH_37_5</name>
                      <description>37.5 mV</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>THRESH_40_0</name>
                      <description>40.0 mV</description>
                      <value>1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>THRESH_42_5</name>
                      <description>42.5 mV</description>
                      <value>2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>THRESH_45_0</name>
                      <description>45 mV</description>
                      <value>3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>THRESH_47_5</name>
                      <description>47.5 mV</description>
                      <value>4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>THRESH_50_0</name>
                      <description>50 mV</description>
                      <value>5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>THRESH_50_0A</name>
                      <description>50 mV</description>
                      <value>6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>THRESH_50_0B</name>
                      <description>50 mV</description>
                      <value>7</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>THRESH_75_0</name>
                      <description>75 mV</description>
                      <value>8</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>THRESH_80_0</name>
                      <description>80 mV</description>
                      <value>9</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>THRESH_85_0</name>
                      <description>85 mV</description>
                      <value>10</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>THRESH_90_0</name>
                      <description>90 mV</description>
                      <value>11</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>THRESH_95_0</name>
                      <description>95 mV</description>
                      <value>12</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>THRESH_100</name>
                      <description>100 mV</description>
                      <value>13</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>THRESH_100A</name>
                      <description>100 mV</description>
                      <value>14</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>THRESH_100B</name>
                      <description>100 mV</description>
                      <value>15</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>THRESH_150</name>
                      <description>150 mV</description>
                      <value>16</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>THRESH_160</name>
                      <description>160 mV</description>
                      <value>17</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>THRESH_170</name>
                      <description>170 mV</description>
                      <value>18</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>THRESH_180</name>
                      <description>180 mV</description>
                      <value>19</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>THRESH_190</name>
                      <description>190 mV</description>
                      <value>20</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>THRESH_200</name>
                      <description>200 mV</description>
                      <value>21</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>THRESH_200A</name>
                      <description>200 mV</description>
                      <value>22</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>THRESH_200B</name>
                      <description>200 mV</description>
                      <value>23</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>THRESH_200C</name>
                      <description>200 mV</description>
                      <value>24</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>ST_MODE</name>
                  <description>Self Test mode. Bypasses OCD inputs from hard-ip (pos &amp; neg) with control bits. Disables outputs depending on the mode.</description>
                  <bitRange>[13:12]</bitRange>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DISABLED</name>
                      <description>Self Test is disabled</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ENABLED_1</name>
                      <description>Self Test is enabled. Triggers, interrupts, and outputs are enabled</description>
                      <value>1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ENABLED_2</name>
                      <description>Self Test is enabled. Triggers, interrupts, and outputs are disabled</description>
                      <value>2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>RSVD</name>
                      <description>Self Test is disabled</description>
                      <value>3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>ST_POS</name>
                  <description>Self Test positive control. Self Test must be enabled for this to have any effect. During Self Test mode controls the positive input to the OCD filter</description>
                  <bitRange>[14:14]</bitRange>
                </field>
                <field>
                  <name>ST_NEG</name>
                  <description>Self Test negative control. Self Test must be enabled for this to have any effect. During Self Test mode controls the negative input to the OCD filter</description>
                  <bitRange>[15:15]</bitRange>
                </field>
                <field>
                  <name>CLOCK_DIV</name>
                  <description>Uses the  dsm clock (clk_dsm)  to create OCD clock using the following formula:

Focd = Fclk_dsm / (2*(CLOCK_DIV+1))</description>
                  <bitRange>[19:16]</bitRange>
                </field>
                <field>
                  <name>CLOCK_EDGE</name>
                  <description>Selects which high freq. clock (clk_hf) edge is aligned with OCD clocks</description>
                  <bitRange>[20:20]</bitRange>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NEG_EDGE</name>
                      <description>OCD clock aligned with negative  high freq. clock (clk_hf) edge</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>POS_EDGE</name>
                      <description>OCD clock aligned with positive high freq. clock (clk_hf) edge</description>
                      <value>1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>GLITCH_FILTER_MODE</name>
                  <description>Selects the operating mode for the glitch filter</description>
                  <bitRange>[24:24]</bitRange>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>CONTINUOUS</name>
                      <description>In this mode, the positive or negative OCD comparator must be continuously asserted for the number of cycles determined by OCD_FILT.</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UP_DN</name>
                      <description>In this mode, the glitch filter counts away from zero when either OCD comparator is asserted, and back towards zero when both are deasserted.</description>
                      <value>1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>IO_POLARITY</name>
                  <description>Selects the assertion polarity of the GPIO OCD output.</description>
                  <bitRange>[25:25]</bitRange>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>ASSERT_LOW</name>
                      <description>GPIO will be high by default, and assert low during an OCD event</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ASSERT_HIGH</name>
                      <description>GPIO will be low by default, and assert high during an OCD event</description>
                      <value>1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>OCD_MODE</name>
                  <description>Selects the output mode. Only exists for OCD0.  In any mode other than the default it is used to condense both the OCD1 output and the OCD2 output onto one pin.</description>
                  <bitRange>[29:28]</bitRange>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Default</name>
                      <description>OCD0 output pin = OCD0</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>AND</name>
                      <description>OCD0 output pin = OCD0 &amp;&amp; OCD1</description>
                      <value>1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>OR</name>
                      <description>OCD0 output pin = OCD0 || OCD1</description>
                      <value>2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>RSVD</name>
                      <description>N/A</description>
                      <value>3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>NEG_EN</name>
                  <description>Enable negative comparator</description>
                  <bitRange>[30:30]</bitRange>
                </field>
                <field>
                  <name>POS_EN</name>
                  <description>Enable positive comparator</description>
                  <bitRange>[31:31]</bitRange>
                </field>
              </fields>
            </register>
            <register>
              <name>OCD_FILT_LIMIT</name>
              <description>Glitch Filter Comparator Settings</description>
              <addressOffset>0x4</addressOffset>
              <fields>
                <field>
                  <name>NEG_LIMIT</name>
                  <description>Selects the glitch filter counter value limit for the negative OCD.  Must be a negative number in twos complement notation.  If glitch filter counter = NEG_LIMIT, the OCD output will be asserted.</description>
                  <bitRange>[15:0]</bitRange>
                </field>
                <field>
                  <name>POS_LIMIT</name>
                  <description>Selects the glitch filter counter value limit for the positive OCD.  Must be a positive number in twos complement notation.  If glitch filter counter = POS_LIMIT, the OCD output will be asserted.</description>
                  <bitRange>[31:16]</bitRange>
                </field>
              </fields>
            </register>
            <register>
              <name>OCD_STATUS</name>
              <description>Over Current Detector Status</description>
              <addressOffset>0x8</addressOffset>
              <resetMask>0xFFFF0331</resetMask>
              <fields>
                <field>
                  <name>OCD</name>
                  <description>Current state of glitch filter output</description>
                  <bitRange>[0:0]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>OCD_NEG_COMP</name>
                  <description>Current state of negative OCD comparator</description>
                  <bitRange>[4:4]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>OCD_POS_COMP</name>
                  <description>Current state of positive OCD comparator</description>
                  <bitRange>[5:5]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>OCD_NEG_HELD</name>
                  <description>Set if negative OCD comparator has triggered. Clear with write of '1'</description>
                  <bitRange>[8:8]</bitRange>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                </field>
                <field>
                  <name>OCD_POS_HELD</name>
                  <description>Set if positive OCD comparator has triggered. Clear with write of '1'</description>
                  <bitRange>[9:9]</bitRange>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                </field>
                <field>
                  <name>GLITCH_FILTER_COUNT</name>
                  <description>Current state of glitch filter counter</description>
                  <bitRange>[31:16]</bitRange>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>OCD_DFT</name>
              <description>Over Current Detector DFT Control</description>
              <addressOffset>0xC</addressOffset>
              <resetMask>0x00001FF3</resetMask>
              <fields>
                <field>
                  <name>OCD_ADFT_SEL</name>
                  <description>OCD ADFT selection 

if ocd_en = 0, then amuxbus_a = Hi-Z, amuxbus_b = Hi-Z 
when ocd_en = 1 then sel_adft settings:

0 - amuxbus_a = Hi-Z, amuxbus_b = Hi-Z
1 - amuxbus_a = Hi-Z, amuxbus_b = Hi-Z
2 - amuxbus_a = Reference H output (to measure internal REFH/divout)  , amuxbus_b = Reference L output ( to measure internal REFL)
3 - amuxbus_a = Ref amp output  , amuxbus_b = Ext. REFH</description>
                  <bitRange>[1:0]</bitRange>
                </field>
                <field>
                  <name>OCD_DDFT_SEL</name>
                  <description>OCD DDFT selection

0 - ddft[1] = 0, ddft[0] = 0
1 - ddft[1] = pos_comp_out, ddft[0] = en_pos
2 - ddft[1] = cnt1 , ddft[0] = cnt1
3 - ddft[1] = cnt1 , ddft[0] = cnt1b
4 - ddft[1] = cnt1 , ddft[0] = cnt2
5 - ddft[1] = cnt1 , ddft[0] = cnt3
6 - ddft[1] = ocd_en , ddft[0] = buf_PG
7 - ddft[1] = neg_comp_out , ddft[0] = en_neg
8 - ddft[1] = cnt1 , ddft[0] = buf_PG
9 - ddft[1] = 0, ddft[0] = 0
.....
15 - ddft[1] = 0, ddft[0] = 0</description>
                  <bitRange>[7:4]</bitRange>
                </field>
                <field>
                  <name>OCD_SPARE</name>
                  <description>N/A</description>
                  <bitRange>[11:8]</bitRange>
                </field>
                <field>
                  <name>OCD_EN_LS</name>
                  <description>Enable for OCD level shifter</description>
                  <bitRange>[12:12]</bitRange>
                </field>
              </fields>
            </register>
          </cluster>
          <register>
            <name>REG_PROT</name>
            <description>Register Protection</description>
            <addressOffset>0x800</addressOffset>
            <resetValue>0xF08169E7</resetValue>
            <fields>
              <field>
                <name>MAGIC</name>
                <description>Setting this register to the value 0xf08169e7 unlocks access to Lock Protected Registers. These registers can not be written to unless this value has been written into this register. Writing a value OTHER than the magic key will disable access to the registers. The register POR value is set to 'unlock' the register access.</description>
                <bitRange>[31:0]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>PDFT_CTL</name>
            <description>PACSS DFT Control</description>
            <addressOffset>0x900</addressOffset>
            <resetMask>0x000300FF</resetMask>
            <fields>
              <field>
                <name>DDFT0_MUX_SEL</name>
                <description>N/A</description>
                <bitRange>[3:0]</bitRange>
              </field>
              <field>
                <name>DDFT1_MUX_SEL</name>
                <description>N/A</description>
                <bitRange>[7:4]</bitRange>
              </field>
              <field>
                <name>LDO_BYPASS</name>
                <description>N/A</description>
                <bitRange>[16:16]</bitRange>
              </field>
              <field>
                <name>VPOS_PMP_TEST_EN</name>
                <description>Positive Pump Test Enable</description>
                <bitRange>[17:17]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_REGL0_CTL</name>
            <description>Regulator (LDO) Trim 0 (lock protected)</description>
            <addressOffset>0xFF00</addressOffset>
            <resetMask>0x00000017</resetMask>
            <fields>
              <field>
                <name>FINE</name>
                <description>Fine Trim</description>
                <bitRange>[2:0]</bitRange>
              </field>
              <field>
                <name>COARSE</name>
                <description>Coarse Trim</description>
                <bitRange>[4:4]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_HPBGR0_CTL</name>
            <description>High Precision Bandgap Reference Trim Control 0 (lock protected)</description>
            <addressOffset>0xFF04</addressOffset>
            <resetValue>0x00000080</resetValue>
            <resetMask>0x000000FF</resetMask>
            <fields>
              <field>
                <name>VREF_OS</name>
                <description>Offset trim for HPBGR 1.2V output</description>
                <bitRange>[7:0]</bitRange>
              </field>
            </fields>
          </register>
