Infineon/mtb-pdl-cat2/devices/svd/psoc4hvpaspm10.svd
          <register>
            <name>TRIM_HPBGR1_CTL</name>
            <description>High Precision Bandgap Reference Trim Control 1 (lock protected)</description>
            <addressOffset>0xFF08</addressOffset>
            <resetValue>0x00000040</resetValue>
            <resetMask>0x0000007F</resetMask>
            <fields>
              <field>
                <name>VREF_TC</name>
                <description>First order temp-co correction trim</description>
                <bitRange>[6:0]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_HPBGR2_CTL</name>
            <description>High Precision Bandgap Reference Trim Control 2 (lock protected)</description>
            <addressOffset>0xFF0C</addressOffset>
            <resetValue>0x00000088</resetValue>
            <resetMask>0x000000FF</resetMask>
            <fields>
              <field>
                <name>VREF_NL1</name>
                <description>Low temperature second order temp-co correction trim</description>
                <bitRange>[3:0]</bitRange>
              </field>
              <field>
                <name>VREF_NL2</name>
                <description>High temperature second order temp-co correction trim</description>
                <bitRange>[7:4]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_HPBGR3_CTL</name>
            <description>High Precision Bandgap Reference Trim Control 3 (lock protected)</description>
            <addressOffset>0xFF10</addressOffset>
            <resetValue>0x00000090</resetValue>
            <resetMask>0x0000009F</resetMask>
            <fields>
              <field>
                <name>VREF_AMP</name>
                <description>Chopping amplifier trim</description>
                <bitRange>[4:0]</bitRange>
              </field>
              <field>
                <name>NL_COREC_DIS</name>
                <description>Second order temp-co correction enable (0: correction, 1: no correction)</description>
                <bitRange>[7:7]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_HPBGR4_CTL</name>
            <description>High Precision Bandgap Reference Trim Control 4 (lock protected)</description>
            <addressOffset>0xFF14</addressOffset>
            <resetMask>0x000000FF</resetMask>
            <fields>
              <field>
                <name>NL1TEMP</name>
                <description>Non-linearity Temperature Trim 1</description>
                <bitRange>[1:0]</bitRange>
              </field>
              <field>
                <name>NL1GAIN</name>
                <description>Non-linearity Gain Trim 1</description>
                <bitRange>[3:2]</bitRange>
              </field>
              <field>
                <name>NL2TEMP</name>
                <description>Non-linearity Temperature Trim 2</description>
                <bitRange>[5:4]</bitRange>
              </field>
              <field>
                <name>NL2GAIN</name>
                <description>Non-linearity Gain Trim 2</description>
                <bitRange>[7:6]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_AREF0_CTL</name>
            <description>Analog Reference Trim Control 0 (lock protected)</description>
            <addressOffset>0xFF18</addressOffset>
            <resetMask>0x0000001F</resetMask>
            <fields>
              <field>
                <name>ICTAT</name>
                <description>Trim for AREF CTAT currents</description>
                <bitRange>[4:0]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_AREF1_CTL</name>
            <description>Analog Reference Trim Control 1 (lock protected)</description>
            <addressOffset>0xFF1C</addressOffset>
            <resetMask>0x0000000F</resetMask>
            <fields>
              <field>
                <name>IPTAT_COARSE</name>
                <description>Coarse Trim for AREF PTAT currents</description>
                <bitRange>[3:0]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_AREF2_CTL</name>
            <description>Analog Reference Trim Control 2 (lock protected)</description>
            <addressOffset>0xFF20</addressOffset>
            <resetMask>0x0000001F</resetMask>
            <fields>
              <field>
                <name>IPTAT_FINE</name>
                <description>Fine Trim for AREF PTAT currents</description>
                <bitRange>[4:0]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_AREF3_CTL</name>
            <description>Analog Reference Trim Control 3 (lock protected)</description>
            <addressOffset>0xFF24</addressOffset>
            <resetMask>0x00000007</resetMask>
            <fields>
              <field>
                <name>PTAT_DAC</name>
                <description>Trim for AREF PTAT DAC</description>
                <bitRange>[2:0]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_AREF4_CTL</name>
            <description>Analog Reference Trim Control 4 (lock protected)</description>
            <addressOffset>0xFF28</addressOffset>
            <resetMask>0x0000000F</resetMask>
            <fields>
              <field>
                <name>ZTAT_COARSE</name>
                <description>Coarse Trim for AREF ZTAT</description>
                <bitRange>[3:0]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_AREF5_CTL</name>
            <description>Analog Reference Trim Control 5 (lock protected)</description>
            <addressOffset>0xFF2C</addressOffset>
            <resetMask>0x0000001F</resetMask>
            <fields>
              <field>
                <name>ZTAT_FINE</name>
                <description>Fine Trim for AREF ZTAT
Only bits [3:0] are functional.  Bit 4 is a spare bit.</description>
                <bitRange>[4:0]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_AREF6_CTL</name>
            <description>Analog Reference Trim Control 6 (lock protected)</description>
            <addressOffset>0xFF30</addressOffset>
            <resetMask>0x0000000F</resetMask>
            <fields>
              <field>
                <name>CTAT_COARSE</name>
                <description>Coarse Trim for AREF CTAT</description>
                <bitRange>[3:0]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_OCD00_CTL</name>
            <description>Trim Control 0 for Over Current Detector 0 (lock protected)</description>
            <addressOffset>0xFF34</addressOffset>
            <resetMask>0x000000FF</resetMask>
            <fields>
              <field>
                <name>TRIM0</name>
                <description>N/A</description>
                <bitRange>[7:0]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_OCD01_CTL</name>
            <description>Trim Control 0 for Over Current Detector 1 (lock protected)</description>
            <addressOffset>0xFF38</addressOffset>
            <resetMask>0x000000FF</resetMask>
            <fields>
              <field>
                <name>TRIM1</name>
                <description>N/A</description>
                <bitRange>[7:0]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_OCD10_CTL</name>
            <description>Trim Control 1 for Over Current Detector 0 (lock protected))</description>
            <addressOffset>0xFF3C</addressOffset>
            <resetMask>0x000000FF</resetMask>
            <fields>
              <field>
                <name>TRIM0</name>
                <description>N/A</description>
                <bitRange>[7:0]</bitRange>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_OCD11_CTL</name>
            <description>Trim Control 1 for Over Current Detector 1 (lock protected)</description>
            <addressOffset>0xFF40</addressOffset>
            <resetMask>0x000000FF</resetMask>
            <fields>
              <field>
                <name>TRIM1</name>
                <description>N/A</description>
                <bitRange>[7:0]</bitRange>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
  </peripherals>
</device>